{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth\n",
    "import neo4j\n",
    "import time\n",
    "import aiohttp\n",
    "import asyncio\n",
    "import json\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path\n",
    "import pandas as pd\n",
    "import requests\n",
    "from datetime import datetime"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to neo4j\n"
     ]
    }
   ],
   "source": [
    "#load the environment variables\n",
    "dotenv_path = Path('~/.env')\n",
    "load_dotenv(dotenv_path=dotenv_path)  # This line brings all environment variables from .env into os.environ\n",
    "\n",
    "# Get variables\n",
    "SUSTAINGRAPH_URI = os.getenv('SUSTAINGRAPH_URI')\n",
    "SUSTAINGRAPH_USER = os.getenv('SUSTAINGRAPH_USER')\n",
    "SUSTAINGRAPH_PASSWORD = os.getenv('SUSTAINGRAPH_PASSWORD')\n",
    "database_name = os.getenv('DATABASE_NAME')\n",
    "\n",
    "# Connect to database\n",
    "driver = GraphDatabase.driver(SUSTAINGRAPH_URI, auth=(SUSTAINGRAPH_USER, SUSTAINGRAPH_PASSWORD))\n",
    "\n",
    "# Verify connectivity\n",
    "with driver.session(database=database_name) as session:\n",
    "    print(session.run(\"RETURN 'Connected to ' + $db\", db=database_name).single()[0])"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Constaints "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_constraint(tx,statement):\n",
    "    tx.run(statement)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Uniqueness"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_goal = \"\"\" \n",
    "CREATE CONSTRAINT goal_unique IF NOT EXISTS FOR (goal:Goal) \n",
    "REQUIRE (goal.code,goal.title,goal.description) IS NODE KEY;\n",
    "\"\"\"\n",
    "statement_target=\"\"\"\n",
    "CREATE CONSTRAINT target_unique IF NOT EXISTS FOR (t:Target) \n",
    "REQUIRE (t.code,t.title,t.description) IS NODE KEY;\n",
    "\"\"\"\n",
    "statement_indicator =\"\"\"\n",
    "CREATE CONSTRAINT indicator_unique IF NOT EXISTS FOR (i:Indicator) \n",
    "REQUIRE (i.code,i.description) IS NODE KEY;\n",
    "\"\"\"\n",
    "\n",
    "statement_series =\"\"\"\n",
    "CREATE CONSTRAINT series_unique IF NOT EXISTS FOR (s:Series) \n",
    "REQUIRE (s.code,s.description) IS NODE KEY;\n",
    "\"\"\"\n",
    "\n",
    "statement_sm =\"\"\"\n",
    "CREATE CONSTRAINT sm_unique IF NOT EXISTS FOR ( seriesmetadata:SeriesMetadata )\n",
    " REQUIRE (seriesmetadata.attributesCode, seriesmetadata.dimensionsCode,seriesmetadata.seriesCode) IS NODE KEY;\n",
    "\"\"\"\n",
    "\n",
    "statement_has_obs = \"\"\" \n",
    "CREATE CONSTRAINT has_obs_unique IF NOT EXISTS\n",
    "FOR ()-[has_obs:HAS_OBSERVATION]-() REQUIRE (has_obs.attributesCode, has_obs.dimensionsCode,has_obs.seriesCode,has_obs.geoCode,has_obs.time) IS RELATIONSHIP KEY\n",
    "\"\"\"\n",
    "\n",
    "statement_so =\"\"\"CREATE CONSTRAINT source_name IF NOT EXISTS FOR (s:Source) \n",
    "REQUIRE s.name IS NODE KEY;\n",
    "\"\"\" "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Property types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Goal\n",
    "statement_goal_code = \"\"\" \n",
    "CREATE CONSTRAINT goal_type_code IF NOT EXISTS\n",
    "FOR (g:Goal) REQUIRE g.code :: STRING\n",
    "\"\"\"\n",
    "statement_goal_desc = \"\"\" \n",
    "CREATE CONSTRAINT goal_type_desc IF NOT EXISTS\n",
    "FOR (g:Goal) REQUIRE g.description :: STRING\n",
    "\"\"\"\n",
    "statement_goal_title = \"\"\" \n",
    "CREATE CONSTRAINT goal_type_title IF NOT EXISTS\n",
    "FOR (g:Goal) REQUIRE g.title :: STRING\n",
    "\"\"\"\n",
    "\n",
    "## Target\n",
    "statement_target_code = \"\"\" \n",
    "CREATE CONSTRAINT target_type_code IF NOT EXISTS\n",
    "FOR (t:Target) REQUIRE t.code :: STRING\n",
    "\"\"\"\n",
    "statement_target_desc = \"\"\" \n",
    "CREATE CONSTRAINT target_type_desc IF NOT EXISTS\n",
    "FOR (t:Target) REQUIRE t.description :: STRING\n",
    "\"\"\"\n",
    "statement_target_title = \"\"\" \n",
    "CREATE CONSTRAINT target_type_title IF NOT EXISTS\n",
    "FOR (t:Target) REQUIRE t.title :: STRING\n",
    "\"\"\"\n",
    "\n",
    "## Indicator\n",
    "statement_indicator_code = \"\"\" \n",
    "CREATE CONSTRAINT indicator_type_code IF NOT EXISTS\n",
    "FOR (i:Indicator)  REQUIRE i.code :: STRING\n",
    "\"\"\"\n",
    "statement_indicator_desc = \"\"\" \n",
    "CREATE CONSTRAINT indicator_type_desc IF NOT EXISTS\n",
    "FOR (i:Indicator)  REQUIRE i.description :: STRING\n",
    "\"\"\"\n",
    "\n",
    "## Series\n",
    "statement_series_code = \"\"\" \n",
    "CREATE CONSTRAINT series_type_code IF NOT EXISTS\n",
    "FOR (s:Series) REQUIRE s.code :: STRING\n",
    "\"\"\"\n",
    "statement_series_desc = \"\"\" \n",
    "CREATE CONSTRAINT series_type_desc IF NOT EXISTS\n",
    "FOR (s:Series)  REQUIRE s.description :: STRING\n",
    "\"\"\"\n",
    "statement_series_provider = \"\"\" \n",
    "CREATE CONSTRAINT series_type_desc IF NOT EXISTS\n",
    "FOR (s:Series)  REQUIRE s.dataProviderURL :: STRING\n",
    "\"\"\"\n",
    "\n",
    "## SeriesMetadata\n",
    "\n",
    "statement_sm_atcode = \"\"\" \n",
    "CREATE CONSTRAINT sm_type_attcode IF NOT EXISTS\n",
    "FOR (sm:SeriesMetadata) REQUIRE sm.attributesCode :: STRING\n",
    "\"\"\"\n",
    "\n",
    "statement_sm_dimcode = \"\"\" \n",
    "CREATE CONSTRAINT sm_type_dimcode IF NOT EXISTS\n",
    "FOR (sm:SeriesMetadata) REQUIRE sm.dimensionsCode :: STRING\n",
    "\"\"\"\n",
    "statement_sm_dimdesc= \"\"\" \n",
    "CREATE CONSTRAINT sm_type_dimdesc IF NOT EXISTS\n",
    "FOR (sm:SeriesMetadata) REQUIRE sm.dimensionsDescription :: STRING\n",
    "\"\"\"\n",
    "statement_sm_attdesc= \"\"\" \n",
    "CREATE CONSTRAINT sm_type_dimdesc IF NOT EXISTS\n",
    "FOR (sm:SeriesMetadata) REQUIRE sm.attributesDescription :: STRING\n",
    "\"\"\"\n",
    "statement_sm_seriesCode= \"\"\" \n",
    "CREATE CONSTRAINT sm_type_dimdesc IF NOT EXISTS\n",
    "FOR (sm:SeriesMetadata) REQUIRE sm.seriesCode :: STRING\n",
    "\"\"\"\n",
    "\n",
    "### Observation\n",
    "statement_obs_value = \"\"\" \n",
    "CREATE CONSTRAINT obs_type_value IF NOT EXISTS\n",
    "FOR (o:Observation) REQUIRE o.value :: FLOAT\n",
    "\"\"\"\n",
    "statement_obs_time = \"\"\" \n",
    "CREATE CONSTRAINT obs_type_date IF NOT EXISTS\n",
    "FOR (o:Observation) REQUIRE o.time :: DATE\n",
    "\"\"\"\n",
    "\n",
    "### Source\n",
    "statement_so_name = \"\"\" \n",
    "CREATE CONSTRAINT so_type_name IF NOT EXISTS\n",
    "FOR (so:Source) REQUIRE so.name :: STRING\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "statements = [statement_goal,statement_goal_code,statement_goal_desc,statement_goal_title,\n",
    "  statement_indicator,statement_indicator_code,statement_indicator_desc,\n",
    "  statement_obs_time,statement_obs_value,\n",
    "  statement_series,statement_series_code,statement_series_desc,statement_series_provider,\n",
    "  statement_sm,statement_sm_atcode,statement_sm_attdesc,statement_sm_dimcode,statement_sm_dimdesc,statement_sm_seriesCode,\n",
    "  statement_so,statement_so_name,\n",
    "  statement_target,statement_target_code,statement_target_desc,statement_target_title,statement_has_obs]\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    for statement in statements:\n",
    "        session.execute_write(create_constraint, statement)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cypher_run(tx,statement):\n",
    "    tx.run(statement)\n",
    "\n",
    "def cypher_run_params(tx,statement, params):\n",
    "    tx.run(statement,parameters={\"parameters\":params})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Goals, Targets, Series, Indicators were retrieved from the United Nations SDG API and with the help of the APOC Neo4j’s standard library were introduced into the SustainGraph.\n",
    "\n",
    "The final graph schema is provided below:\n",
    "![Alt text](wiki/SustainGraph-Indicators.png)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Goals"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_goals = \"\"\"\n",
    "    CALL apoc.load.json(\"https://unstats.un.org/SDGAPI/v1/sdg/Goal/List?includechildren=false\")\n",
    "    YIELD value\n",
    "    UNWIND value AS goal\n",
    "    MERGE (g:Goal {code: toString(goal.code)})\n",
    "    SET g.title = toString(goal.title)\n",
    "    SET g.description = toString(goal.description)\n",
    "    RETURN COUNT(DISTINCT g)\n",
    "\"\"\"\n",
    "with driver.session(database=database_name) as session:\n",
    "    session.execute_write(cypher_run, statement = statement_goals)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Targets per Goal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_targets = \"\"\"\n",
    "    MATCH (g:Goal)\n",
    "    CALL apoc.load.json(\"https://unstats.un.org/SDGAPI/v1/sdg/Goal/\"+g.code+\"/Target/List?includechildren=true\")\n",
    "    YIELD value\n",
    "    UNWIND value.targets AS target\n",
    "    MERGE (t:Target {code: toString(target.code)})\n",
    "    SET t.title = toString(target.title)\n",
    "    SET t.description = toString(target.description)\n",
    "    MERGE (t)<-[:HAS_TARGET]-(g)\n",
    "\"\"\"\n",
    "with driver.session(database=database_name) as session:\n",
    "    session.execute_write(cypher_run, statement = statement_targets)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Indicators per Target"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_ind = \"\"\"\n",
    "    MATCH (t:Target) \n",
    "    CALL apoc.load.json(\"https://unstats.un.org/SDGAPI/v1/sdg/Target/\"+t.code+\"/Indicator/List?includechildren=true\")\n",
    "    YIELD value\n",
    "    UNWIND value.indicators AS indicator\n",
    "    MERGE (i:Indicator {code: toString(indicator.code)})\n",
    "    SET i.description = toString(indicator.description)\n",
    "    MERGE (s:Source{name:'UN_SDG'})\n",
    "    MERGE (t)-[:HAS_INDICATOR]->(i)-[:COMES_FROM]->(s)\n",
    "\"\"\"\n",
    "with driver.session(database=database_name) as session:\n",
    "    session.execute_write(cypher_run, statement = statement_ind)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Series per Indicator"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_series = \"\"\"\n",
    "    MATCH (i:Indicator)-[:COMES_FROM]-(:Source{name:'UN_SDG'})\n",
    "    CALL apoc.load.json(\"https://unstats.un.org/SDGAPI/v1/sdg/Indicator/\"+i.code+\"/Series/List\")\n",
    "    YIELD value\n",
    "    UNWIND value.series AS series\n",
    "    MERGE (s:Series {code: toString(series.code)})\n",
    "    SET s.description = toString(series.description)\n",
    "    SET s.dataProviderURL = 'https://unstats.un.org/sdgapi/swagger/'\n",
    "    MERGE (i)-[:HAS_SERIES]->(s)\n",
    "\"\"\"\n",
    "with driver.session(database=database_name) as session:\n",
    "    session.execute_write(cypher_run, statement = statement_series)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17 Goals in 14 ms, expected: 17\n",
      "169 Targets in 16 ms, expected: 169\n",
      "251 UN Indicators in 49 ms, expected: 251\n",
      "708 UN Series in 60 ms, expected: 708\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (n:Goal) RETURN count(distinct n) as goals\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "nodes_created=records[0]['goals']\n",
    "expected=len(requests.get(\"https://unstats.un.org/SDGAPI/v1/sdg/Goal/List?includechildren=false\").json())\n",
    "print(\"{nodes_created} Goals in {time} ms, expected: {expected}\".format(\n",
    "    nodes_created=nodes_created,\n",
    "    time=summary.result_available_after,\n",
    "    expected=expected\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (n:Target) RETURN count(distinct n) as targets\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{nodes_created} Targets in {time} ms, expected: {expected}\".format(\n",
    "    nodes_created=records[0]['targets'],\n",
    "    time=summary.result_available_after,\n",
    "    expected=sum(\n",
    "        len(group.get(\"targets\", [])) \n",
    "        for goal in requests.get(\"https://unstats.un.org/SDGAPI/v1/sdg/Goal/List?includechildren=false\").json()\n",
    "        for group in requests.get(f\"https://unstats.un.org/SDGAPI/v1/sdg/Goal/{goal['code']}/Target/List?includechildren=true\").json()\n",
    "    )\n",
    "))\n",
    "\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (n:Source {name: \"UN_SDG\"})--(i:Indicator) RETURN COUNT(i) as ind\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{nodes_created} UN Indicators in {time} ms, expected: {expected}\".format(\n",
    "    nodes_created=records[0]['ind'],\n",
    "    time=summary.result_available_after,\n",
    "    expected=sum(\n",
    "        len(group.get(\"indicators\", []))\n",
    "        for target in requests.get(\"https://unstats.un.org/SDGAPI/v1/sdg/Target/List?includechildren=true\").json()\n",
    "        for group in requests.get(f\"https://unstats.un.org/SDGAPI/v1/sdg/Target/{target['code']}/Indicator/List?includechildren=true\").json()\n",
    "    )\n",
    "))\n",
    "\n",
    "expected_series = {\n",
    "    series[\"code\"]\n",
    "    for indicator in requests.get(\"https://unstats.un.org/SDGAPI/v1/sdg/Indicator/List\").json()\n",
    "    for group in requests.get(f\"https://unstats.un.org/SDGAPI/v1/sdg/Indicator/{indicator['code']}/Series/List\").json()\n",
    "    for series in group.get(\"series\", [])\n",
    "}\n",
    "len_expected_series = len(expected_series)\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "    MATCH (n:Source {name: \"UN_SDG\"})--(i:Indicator)--(s:Series) RETURN count(distinct s) as series\n",
    "\"\"\", routing_=\"r\", database_=database_name)\n",
    "print(\"{nodes_created} UN Series in {time} ms, expected: {expected}\".format(\n",
    "    nodes_created=records[0]['series'],\n",
    "    time=summary.result_available_after,\n",
    "    expected=len_expected_series\n",
    "))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Observations per Series"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Each UN Series code has multiple observations for each GeoArea, for different time periods and also for different attributes and dimensions "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def goal_series(tx,statement, goal):\n",
    "    result = tx.run(statement,goal=goal)\n",
    "    return result.data()[0]['s_codes']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get all series per goal and store them in a dictionary\n",
    "series_per_goal ={}\n",
    "statement = \"\"\"\n",
    "    MATCH (:Goal{code:$goal})-[:HAS_TARGET]->(:Target)-[:HAS_INDICATOR]->(:Indicator)-[:HAS_SERIES]->(s:Series)\n",
    "    WITH COLLECT(DISTINCT s.code) as s_codes\n",
    "    RETURN s_codes\n",
    "    \"\"\"\n",
    "with driver.session(database=database_name) as session:\n",
    "    for i in range(1,18):\n",
    "        series_per_goal[str(i)] = session.execute_read(goal_series, statement = statement, goal = str(i))\n",
    "\n",
    "# Function for mapping the code of an attribute or a dimension with its description (We dont consider NaN values)\n",
    "def metadata_mapping(metadata) :\n",
    "    mapping = {}\n",
    "    for m in metadata:\n",
    "        for  c in m[\"codes\"]:\n",
    "            mapping[c[\"code\"]] = c[\"description\"]\n",
    "    return mapping"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Collect data (observation per Series) only for European countries and countries of the European Union. <p>\n",
    "Note: Cyprus belongs to the European Union, but does not belong geographically to Europe."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def areas_codes(tx,statement):\n",
    "    result = tx.run(statement)\n",
    "    return result.data()[0]['geocodes']\n",
    "\n",
    "# Collect the available GeoArea codes of Europe in the SustainGraph\n",
    "statement_areas = \"\"\"\n",
    "    MATCH (r:Region{name:'Europe'})-[:HAS_SUBREGION]->(sr:SubRegion)-[:HAS_AREA]->(a:Area)\n",
    "    MATCH (eu:EuropeanUnion)<-[:BELONGS_TO]-(eua:Area)\n",
    "    WITH COLLECT(DISTINCT a.M49code)+COLLECT(DISTINCT eua.M49code) as geocodes\n",
    "    UNWIND geocodes as codes\n",
    "    RETURN COLLECT(DISTINCT codes) as geocodes\n",
    "    \"\"\"\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    geocodes = session.execute_read(areas_codes,statement_areas)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_params(series_code, geoAreas):\n",
    "    return {\n",
    "        'seriesCode':series_code,\n",
    "        'areaCode': geoAreas # list of geoarea codes in M49\n",
    "    }\n",
    "def create_params_pages(series_code, geoAreas, pageSize):\n",
    "    return {\n",
    "        'seriesCode':series_code,\n",
    "        'areaCode': geoAreas, #list of integers M49 codes\n",
    "        'pageSize': pageSize\n",
    "    }\n",
    "\n",
    "#Function to collect the data per series code from the API\n",
    "async def get_observations(session,series_code, geoAreas):\n",
    "    async with session.get(\"https://unstats.un.org/sdgapi/v1/sdg/Series/Data\", \n",
    "                           params = create_params(series_code,geoAreas)) as response:\n",
    "        result = await response.json()\n",
    "        print('Total elements of %s: %s in %s pages'%(series_code,result['totalElements'], result['totalPages']))\n",
    "        exceptions = 0 \n",
    "        obs = 0 \n",
    "        params = []\n",
    "        \n",
    "        async with session.get(\"https://unstats.un.org/sdgapi/v1/sdg/Series/Data\",\n",
    "                                params = create_params_pages(series_code,geoAreas,str(result['totalElements']))) as response:\n",
    "            result = await response.json()\n",
    "            attributes = metadata_mapping( result['attributes'])\n",
    "            dimensions = metadata_mapping( result['dimensions'])\n",
    "            data = result['data']\n",
    "            for observation in data :\n",
    "                if (observation['value']!='NaN'):\n",
    "                    obs +=1\n",
    "                    attributes_code_string = '|'.join(list( observation['attributes'].values()))\n",
    "                    attr_description = []\n",
    "                    for a in list( observation['attributes'].values()):\n",
    "                        attr_description.append(attributes[a])\n",
    "                    attributes_description_string = '|'.join(attr_description)\n",
    "\n",
    "                    dimension_code_string = '|'.join(list( observation['dimensions'].values()))\n",
    "                    dim_description = []\n",
    "                    for d in list( observation['dimensions'].values()):\n",
    "                        dim_description.append(dimensions[d])\n",
    "                    dimension_description_string = '|'.join(dim_description)\n",
    "                    \n",
    "                    if (observation['valueType'] != \"Float\"):\n",
    "                        #print (\"Series: %s value\" %observation[\"series\"] )\n",
    "                        #print(observation['value'])\n",
    "                        exceptions +=1\n",
    "                        if observation['value'][0] != '<' and observation['value'][0] != '>' :\n",
    "                            print (\"Series: %s value\" %observation[\"series\"] )\n",
    "                            print(observation['value'])\n",
    "                            continue\n",
    "                        else:\n",
    "                            value = observation['value'][1:]\n",
    "                    else:\n",
    "                        value = observation['value']\n",
    "                        \n",
    "\n",
    "                    params_dict={\n",
    "                            'geo':str(observation['geoAreaCode']),\n",
    "                            'year':str(int(observation['timePeriodStart'])),\n",
    "                            'value':float(value),\n",
    "                            'att_desc': attributes_description_string,\n",
    "                            'att_codes': attributes_code_string,\n",
    "                            'dim_desc': dimension_description_string,\n",
    "                            'dim_codes': dimension_code_string,\n",
    "                            's_code':observation['series']\n",
    "                        }\n",
    "                    params.append(params_dict)  \n",
    "        print(\"Observations  %s %d\" %(series_code,obs))\n",
    "        if (exceptions>0):\n",
    "            print(\"Exceptions %s %d\" %(series_code,exceptions))\n",
    "        \n",
    "        return params #list of dictionaries per series code"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Collect the data from the API"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Collect all the data from the API per goal (defining the parameter \"goal\") and store them in a json file under the folder \"Data/2.UN_observations\".\n",
    "We make asynchronous requests for each goal, to collect the data of all its series. Due to the size of the datasets, the asynchronous requests are made in batches of 5 to prevent server request timeout."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "def indicators_for_goal(tx, statement, goal):\n",
    "    result = tx.run(statement, goal=goal)\n",
    "    return result.data()[0]['i_codes']\n",
    "\n",
    "def series_for_indicator(tx, statement, indicator):\n",
    "    result = tx.run(statement, indicator=indicator)\n",
    "    return result.data()[0]['s_codes']\n",
    "\n",
    "# store list of indicators per goal so Series data can be passed later\n",
    "indicators_per_goal = {}\n",
    "statement_goal = \"\"\"\n",
    "    MATCH (:Goal {code:$goal})-[:HAS_TARGET]->(:Target)-[:HAS_INDICATOR]->(i:Indicator)\n",
    "    WITH COLLECT(DISTINCT i.code) as i_codes\n",
    "    RETURN i_codes\n",
    "\"\"\"\n",
    "# store list of series per indicator\n",
    "series_per_indicator = {}\n",
    "statement_indicator = \"\"\"\n",
    "    MATCH (:Indicator {code:$indicator})-[:HAS_SERIES]->(s:Series)\n",
    "    WITH COLLECT(DISTINCT s.code) as s_codes\n",
    "    RETURN s_codes\n",
    "\"\"\"\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    # build mapping: goal -> indicators\n",
    "    for i in range(1, 18):\n",
    "        indicators_per_goal[str(i)] = session.execute_read(\n",
    "            indicators_for_goal, \n",
    "            statement=statement_goal, \n",
    "            goal=str(i)\n",
    "        )\n",
    "\n",
    "    # build mapping: indicator -> series\n",
    "    for goal, indicators in indicators_per_goal.items():\n",
    "        for indicator in indicators:\n",
    "            series_per_indicator[indicator] = session.execute_read(\n",
    "                series_for_indicator,\n",
    "                statement=statement_indicator,\n",
    "                indicator=indicator\n",
    "            )\n",
    "\n",
    "# invert series_per_indicator\n",
    "series_to_indicator = {}\n",
    "for indicator, series_list in series_per_indicator.items():\n",
    "    for s_code in series_list:\n",
    "        series_to_indicator[s_code] = indicator\n",
    "\n",
    "def metadata_mapping(metadata) :\n",
    "    mapping = {}\n",
    "    for m in metadata:\n",
    "        for  c in m[\"codes\"]:\n",
    "            mapping[c[\"code\"]] = c[\"description\"]\n",
    "    return mapping"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Goal 1\n",
      "Total elements of SI_COV_DISAB: 587 in 24 pages\n",
      "Total elements of SI_COV_MATNL: 135 in 6 pages\n",
      "Total elements of SI_COV_SOCINS: 160 in 7 pages\n",
      "Total elements of SI_COV_CHLD: 277 in 12 pages\n",
      "Total elements of SI_COV_WKINJRY: 152 in 7 pages\n",
      "Observations  SI_COV_MATNL 135\n",
      "Observations  SI_COV_WKINJRY 152\n",
      "Observations  SI_COV_SOCINS 160\n",
      "Observations  SI_COV_CHLD 277\n",
      "Observations  SI_COV_DISAB 587\n",
      "Total elements of SI_COV_LMKT: 96 in 4 pages\n",
      "Total elements of SI_COV_SOCAST: 158 in 7 pages\n",
      "Total elements of SI_COV_UEMP: 595 in 24 pages\n",
      "Total elements of SI_COV_POOR: 59 in 3 pages\n",
      "Total elements of SI_COV_PENSN: 518 in 21 pages\n",
      "Observations  SI_COV_LMKT 96\n",
      "Observations  SI_COV_POOR 59\n",
      "Observations  SI_COV_SOCAST 158\n",
      "Observations  SI_COV_PENSN 518\n",
      "Observations  SI_COV_UEMP 595\n",
      "Total elements of DC_ODA_POVG: 0 in 0 pages\n",
      "Total elements of DC_ODA_POVDLG: 529 in 22 pages\n",
      "Total elements of DC_ODA_POVLG: 190 in 8 pages\n",
      "Total elements of SI_COV_BENFTS: 178 in 8 pages\n",
      "Total elements of SI_COV_VULN: 146 in 6 pages\n",
      "Observations  DC_ODA_POVG 0\n",
      "Observations  SI_COV_VULN 146\n",
      "Observations  SI_COV_BENFTS 178\n",
      "Observations  DC_ODA_POVLG 190\n",
      "Observations  DC_ODA_POVDLG 529\n",
      "Total elements of SG_XPD_HLTH: 821 in 33 pages\n",
      "Total elements of SG_XPD_PROT: 821 in 33 pages\n",
      "Total elements of SG_XPD_ESSRV: 821 in 33 pages\n",
      "Total elements of SG_XPD_EDUC: 821 in 33 pages\n",
      "Total elements of SD_XPD_ESED: 55 in 3 pages\n",
      "Observations  SD_XPD_ESED 55\n",
      "Observations  SG_XPD_ESSRV 821\n",
      "Observations  SG_XPD_PROT 821\n",
      "Observations  SG_XPD_EDUC 821\n",
      "Observations  SG_XPD_HLTH 821\n",
      "Total elements of SP_LGL_LNDSEC: 14 in 1 pages\n",
      "Total elements of SP_LGL_LNDDOC: 25 in 1 pages\n",
      "Total elements of SP_LGL_LNDSTR: 242 in 10 pages\n",
      "Total elements of SP_ACS_BSRVSAN: 2918 in 117 pages\n",
      "Total elements of SP_ACS_BSRVH2O: 2854 in 115 pages\n",
      "Observations  SP_LGL_LNDSEC 14\n",
      "Observations  SP_LGL_LNDDOC 25\n",
      "Observations  SP_LGL_LNDSTR 242\n",
      "Observations  SP_ACS_BSRVH2O 2854\n",
      "Observations  SP_ACS_BSRVSAN 2918\n",
      "Total elements of SG_XPD_PR_HLTH: 5 in 1 pages\n",
      "Total elements of SG_XPD_PR_EDUC: 7 in 1 pages\n",
      "Total elements of SG_XPD_PR_SOC: 60 in 3 pages\n",
      "Total elements of SD_MDP_MUHHC: 0 in 0 pages\n",
      "Total elements of SG_XPD_PR: 61 in 3 pages\n",
      "Observations  SG_XPD_PR_HLTH 5\n",
      "Observations  SG_XPD_PR_EDUC 7\n",
      "Observations  SD_MDP_MUHHC 0\n",
      "Observations  SG_XPD_PR_SOC 60\n",
      "Observations  SG_XPD_PR 61\n",
      "Total elements of SD_MDP_ANDI: 0 in 0 pages\n",
      "Total elements of SD_MDP_ANDIHH: 0 in 0 pages\n",
      "Total elements of SD_MDP_CSMP: 0 in 0 pages\n",
      "Total elements of SI_POV_NAHC: 489 in 20 pages\n",
      "Total elements of SD_MDP_MUHC: 2311 in 93 pages\n",
      "Observations  SD_MDP_ANDI 0\n",
      "Observations  SD_MDP_ANDIHH 0\n",
      "Observations  SD_MDP_CSMP 0\n",
      "Observations  SI_POV_NAHC 489\n",
      "Observations  SD_MDP_MUHC 2311\n",
      "Total elements of VC_DSR_LSGP: 530 in 22 pages\n",
      "Total elements of VC_DSR_AGLH: 322 in 13 pages\n",
      "Total elements of VC_DSR_DDPA: 306 in 13 pages\n",
      "Total elements of VC_DSR_CHLN: 262 in 11 pages\n",
      "Total elements of VC_DSR_GDPLS: 530 in 22 pages\n",
      "Observations  VC_DSR_CHLN 262\n",
      "Observations  VC_DSR_AGLH 322\n",
      "Observations  VC_DSR_DDPA 306\n",
      "Observations  VC_DSR_GDPLS 530\n",
      "Observations  VC_DSR_LSGP 530\n",
      "Total elements of SG_DSR_SFDRR: 0 in 0 pages\n",
      "Total elements of VC_DSR_AFFCT: 987 in 40 pages\n",
      "Total elements of SG_DSR_LGRGSR: 510 in 21 pages\n",
      "Total elements of VC_DSR_CILN: 374 in 15 pages\n",
      "Total elements of VC_DSR_HOLH: 498 in 20 pages\n",
      "Observations  SG_DSR_SFDRR 0\n",
      "Observations  VC_DSR_CILN 374\n",
      "Observations  VC_DSR_HOLH 498\n",
      "Observations  SG_DSR_LGRGSR 510\n",
      "Observations  VC_DSR_AFFCT 987\n",
      "Total elements of VC_DSR_DAFF: 987 in 40 pages\n",
      "Total elements of VC_DSR_MISS: 576 in 24 pages\n",
      "Total elements of VC_DSR_PDYN: 621 in 25 pages\n",
      "Total elements of VC_DSR_MTMP: 1176 in 48 pages\n",
      "Total elements of VC_DSR_MMHN: 1176 in 48 pages\n",
      "Observations  VC_DSR_MISS 576\n",
      "Observations  VC_DSR_PDYN 621\n",
      "Observations  VC_DSR_DAFF 987\n",
      "Observations  VC_DSR_MTMP 1176\n",
      "Observations  VC_DSR_MMHN 1176\n",
      "Total elements of VC_DSR_PDLN: 543 in 22 pages\n",
      "Total elements of VC_DSR_MORT: 1167 in 47 pages\n",
      "Total elements of SG_DSR_SILN: 537 in 22 pages\n",
      "Total elements of VC_DSR_IJILN: 912 in 37 pages\n",
      "Total elements of VC_DSR_PDAN: 762 in 31 pages\n",
      "Observations  SG_DSR_SILN 537\n",
      "Observations  VC_DSR_PDLN 543\n",
      "Observations  VC_DSR_PDAN 762\n",
      "Observations  VC_DSR_IJILN 912\n",
      "Observations  VC_DSR_MORT 1167\n",
      "Total elements of SG_DSR_SILS: 528 in 22 pages\n",
      "Total elements of SG_GOV_LOGV: 561 in 23 pages\n",
      "Total elements of SI_POV_EMP1: 1287 in 52 pages\n",
      "Total elements of SI_POV_DAY1: 4864 in 195 pages\n",
      "Observations  SG_DSR_SILS 528\n",
      "Observations  SG_GOV_LOGV 561\n",
      "Observations  SI_POV_EMP1 1287\n",
      "Observations  SI_POV_DAY1 4864\n",
      "Collect data : 0.8619334816932678 minutes\n",
      "Data/2.UN_observations/observations1.json created\n",
      "Goal 2\n",
      "Total elements of AG_FPA_HMFP: 0 in 0 pages\n",
      "Total elements of AG_FPA_COMM: 300 in 12 pages\n",
      "Total elements of AG_FPA_CFPI: 602 in 25 pages\n",
      "Total elements of PD_AGR_SSFP: 1458 in 59 pages\n",
      "Total elements of PD_AGR_LSFP: 1377 in 56 pages\n",
      "Observations  AG_FPA_HMFP 0\n",
      "Observations  AG_FPA_COMM 275\n",
      "Observations  AG_FPA_CFPI 602\n",
      "Observations  PD_AGR_LSFP 324\n",
      "Observations  PD_AGR_SSFP 322\n",
      "Total elements of AG_LND_LNDSTR: 144 in 6 pages\n",
      "Total elements of AG_LND_PSTCDSMG: 56 in 3 pages\n",
      "Total elements of SI_AGR_SSFP: 180 in 8 pages\n",
      "Total elements of SI_AGR_LSFP: 180 in 8 pages\n",
      "Total elements of AG_LND_FIES: 84 in 4 pages\n",
      "Observations  AG_LND_PSTCDSMG 34\n",
      "Observations  AG_LND_FIES 46\n",
      "Observations  AG_LND_LNDSTR 60\n",
      "Observations  SI_AGR_SSFP 9\n",
      "Observations  SI_AGR_LSFP 9\n",
      "Total elements of AG_LND_SUST: 12 in 1 pages\n",
      "Total elements of AG_LND_SUST_PRXCSS: 369 in 15 pages\n",
      "Total elements of AG_LND_FERTMG: 77 in 4 pages\n",
      "Total elements of AG_LND_NFI: 105 in 5 pages\n",
      "Total elements of AG_LND_RMM: 120 in 5 pages\n",
      "Observations  AG_LND_SUST 8\n",
      "Observations  AG_LND_FERTMG 42\n",
      "Observations  AG_LND_NFI 57\n",
      "Observations  AG_LND_RMM 61\n",
      "Observations  AG_LND_SUST_PRXCSS 342\n",
      "Total elements of AG_LND_AGRBIO: 80 in 4 pages\n",
      "Total elements of AG_LND_FOVH: 136 in 6 pages\n",
      "Total elements of AG_LND_SUST_PRXTS: 369 in 15 pages\n",
      "Total elements of AG_LND_AGRWAG: 112 in 5 pages\n",
      "Total elements of AG_LND_H2OAVAIL: 70 in 3 pages\n",
      "Observations  AG_LND_AGRBIO 34\n",
      "Observations  AG_LND_H2OAVAIL 30\n",
      "Observations  AG_LND_FOVH 63\n",
      "Observations  AG_LND_AGRWAG 48\n",
      "Observations  AG_LND_SUST_PRXTS 342\n",
      "Total elements of AG_LND_SDGRD: 24 in 1 pages\n",
      "Total elements of SN_ITK_DEFCN: 960 in 39 pages\n",
      "Total elements of SN_ITK_DEFC: 960 in 39 pages\n",
      "Total elements of AG_PRD_FIESMS: 1200 in 48 pages\n",
      "Observations  AG_LND_SDGRD 15\n",
      "Total elements of AG_PRD_FIESS: 1200 in 48 pages\n",
      "Observations  SN_ITK_DEFCN 158\n",
      "Exceptions SN_ITK_DEFCN 38\n",
      "Observations  SN_ITK_DEFC 920\n",
      "Exceptions SN_ITK_DEFC 762\n",
      "Observations  AG_PRD_FIESMS 1014\n",
      "Observations  AG_PRD_FIESS 1014\n",
      "Exceptions AG_PRD_FIESS 79\n",
      "Total elements of AG_XPD_AGSGB: 920 in 37 pages\n",
      "Total elements of AG_PRD_ORTIND: 920 in 37 pages\n",
      "Total elements of AG_PRD_FIESMSN: 1200 in 48 pages\n",
      "Total elements of DC_TOF_AGRL: 190 in 8 pages\n",
      "Total elements of AG_PRD_FIESSN: 1200 in 48 pages\n",
      "Observations  DC_TOF_AGRL 190\n",
      "Observations  AG_XPD_AGSGB 909\n",
      "Observations  AG_PRD_ORTIND 909\n",
      "Observations  AG_PRD_FIESSN 935\n",
      "Exceptions AG_PRD_FIESSN 563\n",
      "Observations  AG_PRD_FIESMSN 1014\n",
      "Exceptions AG_PRD_FIESMSN 203\n",
      "Total elements of AG_PRD_XSUBDY: 147 in 6 pages\n",
      "Total elements of ER_GRF_PLNTSTOR: 494 in 20 pages\n",
      "Total elements of ER_GRF_ANIMRCNTN_TRB: 725 in 29 pages\n",
      "Total elements of ER_GRF_ANIMKPT: 1025 in 41 pages\n",
      "Total elements of AG_PRD_AGVAS: 920 in 37 pages\n",
      "Observations  AG_PRD_XSUBDY 147\n",
      "Observations  ER_GRF_PLNTSTOR 494\n",
      "Observations  AG_PRD_AGVAS 909\n",
      "Observations  ER_GRF_ANIMRCNTN_TRB 306\n",
      "Observations  ER_GRF_ANIMKPT 1013\n",
      "Total elements of ER_GRF_ANIMRCNTN: 775 in 31 pages\n",
      "Total elements of ER_NOEX_LBREDN: 1025 in 41 pages\n",
      "Total elements of ER_RSK_TRBBREDS: 1000 in 40 pages\n",
      "Total elements of ER_UNK_TRBBREDN: 1025 in 41 pages\n",
      "Total elements of ER_GRF_ANIMKPT_TRB: 1025 in 41 pages\n",
      "Observations  ER_GRF_ANIMRCNTN 425\n",
      "Observations  ER_NOEX_LBREDN 1013\n",
      "Observations  ER_UNK_TRBBREDN 1013\n",
      "Observations  ER_GRF_ANIMKPT_TRB 1013\n",
      "Observations  ER_RSK_TRBBREDS 883\n",
      "Total elements of ER_RSK_LBREDS: 1025 in 41 pages\n",
      "Total elements of SH_STA_ANEM_NPRG: 1032 in 42 pages\n",
      "Total elements of ER_UNK_LBREDN: 1025 in 41 pages\n",
      "Total elements of ER_NOEX_TRBBREDN: 1025 in 41 pages\n",
      "Total elements of SH_STA_ANEM_PREG: 1032 in 42 pages\n",
      "Observations  ER_UNK_LBREDN 1013\n",
      "Observations  ER_RSK_LBREDS 898\n",
      "Observations  ER_NOEX_TRBBREDN 1013\n",
      "Observations  SH_STA_ANEM_PREG 1032\n",
      "Observations  SH_STA_ANEM_NPRG 1032\n",
      "Total elements of SH_STA_ANEM: 1032 in 42 pages\n",
      "Total elements of SN_STA_OVWGTN: 1875 in 75 pages\n",
      "Total elements of SH_STA_WASTN: 76 in 4 pages\n",
      "Total elements of SN_STA_OVWGT: 1875 in 75 pages\n",
      "Total elements of SH_STA_WAST: 76 in 4 pages\n",
      "Observations  SH_STA_WAST 76\n",
      "Observations  SH_STA_WASTN 76\n",
      "Observations  SH_STA_ANEM 1032\n",
      "Observations  SN_STA_OVWGT 1875\n",
      "Observations  SN_STA_OVWGTN 1875\n",
      "Total elements of SH_MDD_WMN_NPRG: 0 in 0 pages\n",
      "Total elements of SH_MDD_CHLD: 0 in 0 pages\n",
      "Total elements of SH_STA_STNT: 1800 in 72 pages\n",
      "Total elements of SH_STA_STNTN: 1800 in 72 pages\n",
      "Observations  SH_MDD_CHLD 0\n",
      "Observations  SH_MDD_WMN_NPRG 0\n",
      "Observations  SH_STA_STNT 1800\n",
      "Observations  SH_STA_STNTN 1800\n",
      "Collect data : 0.7468451301256815 minutes\n",
      "Data/2.UN_observations/observations2.json created\n",
      "Goal 3\n",
      "Total elements of SH_AAP_ASMORT: 43 in 2 pages\n",
      "Total elements of SH_STA_ASAIRP: 43 in 2 pages\n",
      "Total elements of SH_HAP_ASMORT: 42 in 2 pages\n",
      "Total elements of SH_STA_WASHARI: 40 in 2 pages\n",
      "Total elements of SH_STA_POISN: 840 in 34 pages\n",
      "Observations  SH_HAP_ASMORT 39\n",
      "Observations  SH_AAP_ASMORT 40\n",
      "Observations  SH_STA_ASAIRP 40\n",
      "Observations  SH_STA_WASHARI 40\n",
      "Observations  SH_STA_POISN 840\n",
      "Total elements of SH_ACS_PCV3: 688 in 28 pages\n",
      "Total elements of SH_ACS_HPV: 602 in 25 pages\n",
      "Total elements of SH_HLF_EMED: 2 in 1 pages\n",
      "Total elements of SH_ACS_MCV2: 1026 in 42 pages\n",
      "Total elements of SH_ACS_DTP3: 1026 in 42 pages\n",
      "Observations  SH_HLF_EMED 2\n",
      "Observations  SH_ACS_HPV 359\n",
      "Observations  SH_ACS_PCV3 391\n",
      "Observations  SH_ACS_MCV2 882\n",
      "Observations  SH_ACS_DTP3 1026\n",
      "Total elements of DC_TOF_HLTHNT: 113 in 5 pages\n",
      "Total elements of DC_TOF_HLTHL: 187 in 8 pages\n",
      "Total elements of SH_FPL_MTMM: 28 in 2 pages\n",
      "Total elements of SP_DYN_ADKL: 1978 in 80 pages\n",
      "Total elements of SH_ALC_CONSPT: 943 in 38 pages\n",
      "Observations  SH_FPL_MTMM 28\n",
      "Observations  DC_TOF_HLTHNT 113\n",
      "Observations  DC_TOF_HLTHL 187\n",
      "Observations  SH_ALC_CONSPT 943\n",
      "Observations  SP_DYN_ADKL 1978\n",
      "Total elements of SH_STA_SCIDE: 840 in 34 pages\n",
      "Total elements of SH_STA_BRTC: 662 in 27 pages\n",
      "Total elements of SH_DTH_NCOM: 840 in 34 pages\n",
      "Total elements of SH_SUD_TREAT: 938 in 38 pages\n",
      "Total elements of SH_SUD_ALCOL: 123 in 5 pages\n",
      "Observations  SH_SUD_ALCOL 123\n",
      "Observations  SH_STA_BRTC 662\n",
      "Observations  SH_STA_SCIDE 840\n",
      "Observations  SH_DTH_NCOM 840\n",
      "Observations  SH_SUD_TREAT 938\n",
      "Total elements of SH_DYN_MORTN: 3096 in 124 pages\n",
      "Total elements of SH_DYN_NMRTN: 1032 in 42 pages\n",
      "Total elements of SH_DYN_NMRT: 1032 in 42 pages\n",
      "Total elements of SH_PRV_SMOK: 720 in 29 pages\n",
      "Total elements of SH_STA_MORT: 1032 in 42 pages\n",
      "Observations  SH_PRV_SMOK 720\n",
      "Observations  SH_DYN_NMRTN 1032\n",
      "Observations  SH_DYN_NMRT 1032\n",
      "Observations  SH_STA_MORT 1032\n",
      "Observations  SH_DYN_MORTN 3096\n",
      "Total elements of SH_BLD_MRSA: 160 in 7 pages\n",
      "Total elements of SH_DYN_IMRT: 3096 in 124 pages\n",
      "Total elements of SH_DYN_IMRTN: 3096 in 124 pages\n",
      "Total elements of SH_DYN_MORT: 3096 in 124 pages\n",
      "Total elements of SH_IHR_CAPS: 6825 in 273 pages\n",
      "Observations  SH_BLD_MRSA 160\n",
      "Observations  SH_DYN_IMRT 3096\n",
      "Observations  SH_DYN_IMRTN 3096\n",
      "Observations  SH_DYN_MORT 3096\n",
      "Observations  SH_IHR_CAPS 6825\n",
      "Total elements of SH_MED_HWRKDIS: 2002 in 81 pages\n",
      "Total elements of SH_MED_DEN: 3662 in 147 pages\n",
      "Total elements of SH_STA_TRAFN: 43 in 2 pages\n",
      "Total elements of SH_BLD_ECOLI: 156 in 7 pages\n",
      "Total elements of SH_STA_TRAF: 43 in 2 pages\n",
      "Observations  SH_STA_TRAFN 43\n",
      "Observations  SH_STA_TRAF 43\n",
      "Observations  SH_BLD_ECOLI 156\n",
      "Observations  SH_MED_HWRKDIS 2002\n",
      "Observations  SH_MED_DEN 3662\n",
      "Total elements of SH_STA_MALR: 0 in 0 pages\n",
      "Total elements of SH_XPD_EARN25: 332 in 14 pages\n",
      "Total elements of SH_XPD_EARN10: 332 in 14 pages\n",
      "Total elements of SH_ACS_UNHC: 301 in 13 pages\n",
      "Observations  SH_STA_MALR 0\n",
      "Total elements of SH_TBS_INCD: 1022 in 41 pages\n",
      "Observations  SH_ACS_UNHC 301\n",
      "Observations  SH_XPD_EARN10 332\n",
      "Observations  SH_XPD_EARN25 332\n",
      "Observations  SH_TBS_INCD 1022\n",
      "Total elements of SH_TRP_INTVN: 602 in 25 pages\n",
      "Total elements of SH_HAP_HBSAG: 43 in 2 pages\n",
      "Total elements of SH_HIV_INCD: 12480 in 500 pages\n",
      "Observations  SH_HAP_HBSAG 43\n",
      "Observations  SH_TRP_INTVN 602\n",
      "Observations  SH_HIV_INCD 8062\n",
      "Collect data : 2.3184816002845765 minutes\n",
      "Data/2.UN_observations/observations3.json created\n",
      "Goal 4\n",
      "Total elements of SE_GCEDESD_CUR: 81 in 4 pages\n",
      "Total elements of SE_GCEDESD_SAS: 81 in 4 pages\n",
      "Total elements of SE_GCEDESD_TED: 81 in 4 pages\n",
      "Total elements of SE_TOT_PRFL: 2110 in 85 pages\n",
      "Observations  SE_GCEDESD_SAS 81\n",
      "Observations  SE_GCEDESD_CUR 81\n",
      "Observations  SE_GCEDESD_TED 81\n",
      "Total elements of SE_TOT_CPLR: 13120 in 525 pages\n",
      "Observations  SE_TOT_PRFL 2110\n",
      "Observations  SE_TOT_CPLR 13120\n",
      "Total elements of SE_GCEDESD_NEP: 90 in 4 pages\n",
      "Total elements of SE_DEV_ONTRKWB: 0 in 0 pages\n",
      "Total elements of SE_DEV_ONTRK: 21 in 1 pages\n",
      "Total elements of SE_PRE_PARTN: 2414 in 97 pages\n",
      "Observations  SE_GCEDESD_NEP 90\n",
      "Observations  SE_DEV_ONTRKWB 0\n",
      "Total elements of SE_TRA_GRDL: 1825 in 73 pages\n",
      "Observations  SE_DEV_ONTRK 21\n",
      "Observations  SE_TRA_GRDL 1825\n",
      "Observations  SE_PRE_PARTN 2414\n",
      "Total elements of SE_INF_DSBL: 322 in 13 pages\n",
      "Total elements of SE_ACS_CMPTR: 1481 in 60 pages\n",
      "Total elements of SE_ACS_ELECT: 1218 in 49 pages\n",
      "Total elements of SE_ADT_ACTS: 67930 in 2718 pages\n",
      "Total elements of SE_ADT_FUNS: 138 in 6 pages\n",
      "Observations  SE_ADT_FUNS 138\n",
      "Observations  SE_INF_DSBL 322\n",
      "Observations  SE_ACS_ELECT 1218\n",
      "Observations  SE_ACS_CMPTR 1481\n",
      "Observations  SE_ADT_ACTS 67930\n",
      "Total elements of SE_ACC_HNDWSH: 1205 in 49 pages\n",
      "Total elements of SE_ACS_H2O: 1187 in 48 pages\n",
      "Total elements of SE_ACS_INTNT: 1391 in 56 pages\n",
      "Total elements of DC_TOF_SCHIPSL: 149 in 6 pages\n",
      "Total elements of SE_ACS_SANIT: 1115 in 45 pages\n",
      "Observations  DC_TOF_SCHIPSL 149\n",
      "Observations  SE_ACS_SANIT 1115\n",
      "Observations  SE_ACC_HNDWSH 1205\n",
      "Observations  SE_ACS_H2O 1187\n",
      "Observations  SE_ACS_INTNT 1391\n",
      "Total elements of SE_IMP_FPOF: 44 in 2 pages\n",
      "Total elements of SE_TOT_GPI_FS: 46 in 2 pages\n",
      "Total elements of SE_TOT_RUPI: 488 in 20 pages\n",
      "Total elements of SE_ADT_EDUCTRN: 8716 in 349 pages\n",
      "Total elements of SE_GPI_TCAQ: 573 in 23 pages\n",
      "Observations  SE_IMP_FPOF 44\n",
      "Observations  SE_TOT_GPI_FS 46\n",
      "Observations  SE_TOT_RUPI 488\n",
      "Observations  SE_GPI_TCAQ 573\n",
      "Observations  SE_ADT_EDUCTRN 8716\n",
      "Total elements of SE_GPI_ICTS: 5946 in 238 pages\n",
      "Total elements of SE_NAP_ACHI: 573 in 23 pages\n",
      "Total elements of SE_TOT_SESPI_FS: 46 in 2 pages\n",
      "Total elements of SE_GPI_PART: 2849 in 114 pages\n",
      "Total elements of SE_TOT_GPI: 670 in 27 pages\n",
      "Observations  SE_TOT_SESPI_FS 46\n",
      "Observations  SE_NAP_ACHI 573\n",
      "Observations  SE_TOT_GPI 670\n",
      "Observations  SE_GPI_PART 2849\n",
      "Observations  SE_GPI_ICTS 5946\n",
      "Total elements of SE_TOT_SESPI: 651 in 27 pages\n",
      "Total elements of SE_LGP_ACHI: 654 in 27 pages\n",
      "Total elements of SE_GPI_PTNPRE: 798 in 32 pages\n",
      "Total elements of SE_AGP_CPRA: 2024 in 81 pages\n",
      "Total elements of SE_ALP_CPLR: 1961 in 79 pages\n",
      "Observations  SE_LGP_ACHI 654\n",
      "Observations  SE_TOT_SESPI 651\n",
      "Observations  SE_GPI_PTNPRE 798\n",
      "Observations  SE_ALP_CPLR 1961\n",
      "Observations  SE_AGP_CPRA 2024\n",
      "Total elements of SE_AWP_CPRA: 474 in 19 pages\n",
      "Observations  SE_AWP_CPRA 474\n",
      "Collect data : 6.512226474285126 minutes\n",
      "Data/2.UN_observations/observations4.json created\n",
      "Goal 5\n",
      "Total elements of IC_GEN_MGTN: 828 in 34 pages\n",
      "Total elements of IC_GEN_MGTN_19ICLS: 301 in 13 pages\n",
      "Total elements of IC_GEN_MGTL_19ICLS: 331 in 14 pages\n",
      "Total elements of SG_GEN_LOCGELS: 152 in 7 pages\n",
      "Total elements of IC_GEN_MGTL: 922 in 37 pages\n",
      "Observations  IC_GEN_MGTN_19ICLS 301\n",
      "Observations  IC_GEN_MGTL_19ICLS 331\n",
      "Observations  SG_GEN_LOCGELS 151\n",
      "Observations  IC_GEN_MGTN 828\n",
      "Observations  IC_GEN_MGTL 922\n",
      "Total elements of SG_GEN_EQPWN: 0 in 0 pages\n",
      "Total elements of SG_GEN_EQPWNN: 28 in 2 pages\n",
      "Total elements of SG_GEN_PARLNT: 220 in 9 pages\n",
      "Observations  SG_GEN_EQPWN 0\n",
      "Total elements of SG_GEN_PARL: 1130 in 46 pages\n",
      "Total elements of SG_GEN_PARLN: 1130 in 46 pages\n",
      "Observations  SG_GEN_EQPWNN 28\n",
      "Observations  SG_GEN_PARLNT 220\n",
      "Observations  SG_GEN_PARL 1130\n",
      "Observations  SG_GEN_PARLN 1130\n",
      "Total elements of SG_LGL_GENEQLFP: 130 in 6 pages\n",
      "Total elements of SL_DOM_TSPDDC: 1158 in 47 pages\n",
      "Total elements of SL_DOM_TSPDCW: 1118 in 45 pages\n",
      "Total elements of VC_VAW_MARR: 76 in 4 pages\n",
      "Total elements of SL_DOM_TSPD: 1163 in 47 pages\n",
      "Observations  SG_LGL_GENEQLFP 130\n",
      "Observations  VC_VAW_MARR 76\n",
      "Observations  SL_DOM_TSPDCW 1118\n",
      "Observations  SL_DOM_TSPDDC 1158\n",
      "Observations  SL_DOM_TSPD 1163\n",
      "Total elements of SG_LGL_GENEQEMP: 130 in 6 pages\n",
      "Total elements of SP_DYN_MRBF15: 13 in 1 pages\n",
      "Total elements of SG_LGL_GENEQVAW: 130 in 6 pages\n",
      "Total elements of SG_LGL_GENEQMAR: 130 in 6 pages\n",
      "Total elements of IT_MOB_OWN: 406 in 17 pages\n",
      "Observations  SP_DYN_MRBF15 13\n",
      "Observations  SG_LGL_GENEQMAR 130\n",
      "Observations  SG_LGL_GENEQEMP 130\n",
      "Observations  SG_LGL_GENEQVAW 130\n",
      "Observations  IT_MOB_OWN 406\n",
      "Total elements of SH_STA_FGMS: 0 in 0 pages\n",
      "Total elements of SH_LGR_ACSRHEC12: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC1: 34 in 2 pages\n",
      "Total elements of SP_DYN_MRBF18: 16 in 1 pages\n",
      "Total elements of SH_LGR_ACSRHEC13: 34 in 2 pages\n",
      "Observations  SH_STA_FGMS 0\n",
      "Observations  SH_LGR_ACSRHEC1 33\n",
      "Observations  SH_LGR_ACSRHEC12 34\n",
      "Observations  SP_DYN_MRBF18 16\n",
      "Observations  SH_LGR_ACSRHEC13 34\n",
      "Total elements of SH_LGR_ACSRHEC11: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHES4: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC5: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHES3: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHES1: 34 in 2 pages\n",
      "Observations  SH_LGR_ACSRHES3 31\n",
      "Observations  SH_LGR_ACSRHES1 30\n",
      "Observations  SH_LGR_ACSRHEC11 34\n",
      "Observations  SH_LGR_ACSRHES4 34\n",
      "Observations  SH_LGR_ACSRHEC5 34\n",
      "Total elements of SH_LGR_ACSRHEC6: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHE: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC2: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC3: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC10: 34 in 2 pages\n",
      "Observations  SH_LGR_ACSRHEC10 34\n",
      "Observations  SH_LGR_ACSRHEC6 34\n",
      "Observations  SH_LGR_ACSRHEC3 31\n",
      "Observations  SH_LGR_ACSRHE 28\n",
      "Observations  SH_LGR_ACSRHEC2 33\n",
      "Total elements of SH_LGR_ACSRHEC4: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC9: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHES2: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC8: 34 in 2 pages\n",
      "Total elements of SH_LGR_ACSRHEC7: 34 in 2 pages\n",
      "Observations  SH_LGR_ACSRHEC7 32\n",
      "Observations  SH_LGR_ACSRHEC8 33\n",
      "Observations  SH_LGR_ACSRHEC4 34\n",
      "Observations  SH_LGR_ACSRHEC9 32\n",
      "Observations  SH_LGR_ACSRHES2 32\n",
      "Total elements of SH_FPL_INFMCU: 11 in 1 pages\n",
      "Total elements of SG_LGL_LNDFEMOD: 108 in 5 pages\n",
      "Total elements of SH_FPL_INFMSR: 11 in 1 pages\n",
      "Total elements of SH_FPL_INFMRH: 11 in 1 pages\n",
      "Total elements of SH_FPL_INFM: 11 in 1 pages\n",
      "Observations  SH_FPL_INFMRH 11\n",
      "Observations  SH_FPL_INFMSR 11\n",
      "Observations  SH_FPL_INFM 11\n",
      "Observations  SH_FPL_INFMCU 11\n",
      "Observations  SG_LGL_LNDFEMOD 18\n",
      "Total elements of SP_GNP_WNOWNS: 15 in 1 pages\n",
      "Total elements of SP_LGL_LNDAGSEC: 45 in 2 pages\n",
      "Observations  SP_GNP_WNOWNS 1\n",
      "Observations  SP_LGL_LNDAGSEC 3\n",
      "Collect data : 0.3512820482254028 minutes\n",
      "Data/2.UN_observations/observations5.json created\n",
      "Goal 6\n",
      "Total elements of EN_WWT_WWDS: 134 in 6 pages\n",
      "Total elements of EN_WWT_TREATR: 56 in 3 pages\n",
      "Total elements of EN_WWT_TREAT: 62 in 3 pages\n",
      "Total elements of EN_WWT_TREAT_SF: 62 in 3 pages\n",
      "Total elements of EN_WWT_TREATR_SF: 30 in 2 pages\n",
      "Observations  EN_WWT_TREATR_SF 23\n",
      "Observations  EN_WWT_TREATR 39\n",
      "Observations  EN_WWT_TREAT 44\n",
      "Observations  EN_WWT_TREAT_SF 25\n",
      "Observations  EN_WWT_WWDS 134\n",
      "Total elements of EN_H2O_OPAMBQ: 85 in 4 pages\n",
      "Total elements of EN_H2O_GRAMBQ: 92 in 4 pages\n",
      "Total elements of EN_H2O_WBAMBQ: 112 in 5 pages\n",
      "Total elements of EN_H2O_RVAMBQ: 107 in 5 pages\n",
      "Total elements of EN_WWT_GEN: 385 in 16 pages\n",
      "Observations  EN_H2O_OPAMBQ 85\n",
      "Observations  EN_H2O_RVAMBQ 107\n",
      "Observations  EN_H2O_GRAMBQ 92\n",
      "Observations  EN_H2O_WBAMBQ 112\n",
      "Observations  EN_WWT_GEN 252\n",
      "Total elements of EN_WBE_INWTL: 30 in 2 pages\n",
      "Total elements of EN_RSRV_MNWAC: 805 in 33 pages\n",
      "Total elements of EN_LKRV_SWAC: 846 in 34 pages\n",
      "Total elements of EN_RSRV_MXWAP: 1035 in 42 pages\n",
      "Total elements of EN_LKRV_PWAN: 1127 in 46 pages\n",
      "Observations  EN_WBE_INWTL 30\n",
      "Observations  EN_RSRV_MNWAC 805\n",
      "Observations  EN_RSRV_MXWAP 1035\n",
      "Observations  EN_LKRV_SWAC 846\n",
      "Observations  EN_LKRV_PWAN 1127\n",
      "Total elements of EN_WBE_MANGN: 0 in 0 pages\n",
      "Total elements of EN_LKRV_PWAP: 1012 in 41 pages\n",
      "Total elements of EN_RSRV_MXWAN: 1127 in 46 pages\n",
      "Total elements of EN_WBE_WTLN: 49 in 2 pages\n",
      "Total elements of EN_LKRV_PWAC: 846 in 34 pages\n",
      "Observations  EN_WBE_MANGN 0\n",
      "Observations  EN_WBE_WTLN 49\n",
      "Observations  EN_LKRV_PWAC 846\n",
      "Observations  EN_RSRV_MXWAN 1127\n",
      "Observations  EN_LKRV_PWAP 1012\n",
      "Total elements of EN_RVR_MXRVFLC: 980 in 40 pages\n",
      "Total elements of EN_WBE_NDQTGRW: 12 in 1 pages\n",
      "Total elements of EN_WBE_WTLP: 46 in 2 pages\n",
      "Total elements of EN_LKRV_SWAN: 1127 in 46 pages\n",
      "Total elements of EN_LKW_QLTRB: 640 in 26 pages\n",
      "Observations  EN_WBE_NDQTGRW 3\n",
      "Observations  EN_WBE_WTLP 46\n",
      "Observations  EN_LKW_QLTRB 640\n",
      "Observations  EN_RVR_MXRVFLC 980\n",
      "Observations  EN_LKRV_SWAN 1127\n",
      "Total elements of EN_RVR_MNRVFLC: 980 in 40 pages\n",
      "Total elements of EN_WBE_NDQTRVR: 12 in 1 pages\n",
      "Total elements of EN_LKW_QLTRST: 640 in 26 pages\n",
      "Total elements of EN_RSRV_MNWAP: 1035 in 42 pages\n",
      "Total elements of EN_RSRV_MNWAN: 1127 in 46 pages\n",
      "Observations  EN_WBE_NDQTRVR 8\n",
      "Observations  EN_LKW_QLTRST 640\n",
      "Observations  EN_RSRV_MNWAN 1127\n",
      "Observations  EN_RVR_MNRVFLC 980\n",
      "Observations  EN_RSRV_MNWAP 1035\n",
      "Total elements of EN_WBE_MANGC: 0 in 0 pages\n",
      "Total elements of EN_WBE_HMWTL: 10 in 1 pages\n",
      "Total elements of EN_LKRV_SWAP: 1012 in 41 pages\n",
      "Total elements of EN_RVR_MXRVFLN: 980 in 40 pages\n",
      "Total elements of EN_RVR_MNRVFLN: 980 in 40 pages\n",
      "Observations  EN_WBE_MANGC 0\n",
      "Observations  EN_WBE_HMWTL 10\n",
      "Observations  EN_RVR_MXRVFLN 980\n",
      "Observations  EN_RVR_MNRVFLN 980\n",
      "Observations  EN_LKRV_SWAP 1012\n",
      "Total elements of DC_TOF_WASHL: 191 in 8 pages\n",
      "Total elements of SH_SAN_DEFECT: 2918 in 117 pages\n",
      "Total elements of SH_SAN_SAFE: 2067 in 83 pages\n",
      "Total elements of ER_WAT_PART: 38 in 2 pages\n",
      "Total elements of SH_SAN_HNDWSH: 177 in 8 pages\n",
      "Observations  ER_WAT_PART 38\n",
      "Observations  SH_SAN_HNDWSH 177\n",
      "Observations  DC_TOF_WASHL 191\n",
      "Observations  SH_SAN_SAFE 2067\n",
      "Observations  SH_SAN_DEFECT 2918\n",
      "Total elements of ER_WAT_PROCED: 0 in 0 pages\n",
      "Total elements of ER_WAT_PARTIC: 0 in 0 pages\n",
      "Total elements of ER_H2O_RURP: 45 in 2 pages\n",
      "Total elements of ER_WAT_PRDU: 38 in 2 pages\n",
      "Total elements of ER_H2O_PRDU: 45 in 2 pages\n",
      "Observations  ER_WAT_PROCED 0\n",
      "Observations  ER_WAT_PARTIC 0\n",
      "Observations  ER_WAT_PRDU 38\n",
      "Observations  ER_H2O_RURP 45\n",
      "Observations  ER_H2O_PRDU 45\n",
      "Total elements of ER_H2O_PROCED: 0 in 0 pages\n",
      "Total elements of ER_H2O_PARTIC: 0 in 0 pages\n",
      "Total elements of EG_TBA_H2CO: 156 in 7 pages\n",
      "Total elements of EG_TBA_H2COAQ: 156 in 7 pages\n",
      "Total elements of EG_TBA_H2CORL: 156 in 7 pages\n",
      "Observations  ER_H2O_PROCED 0\n",
      "Observations  ER_H2O_PARTIC 0\n",
      "Observations  EG_TBA_H2CO 103\n",
      "Observations  EG_TBA_H2CORL 112\n",
      "Observations  EG_TBA_H2COAQ 92\n",
      "Total elements of ER_H2O_IWRMD_MI: 131 in 6 pages\n",
      "Total elements of ER_H2O_IWRMD: 131 in 6 pages\n",
      "Total elements of ER_H2O_IWRMD_EE: 131 in 6 pages\n",
      "Total elements of ER_H2O_IWRMD_IP: 131 in 6 pages\n",
      "Total elements of ER_H2O_IWRMD_FI: 130 in 6 pages\n",
      "Observations  ER_H2O_IWRMD_FI 130\n",
      "Observations  ER_H2O_IWRMD_IP 131\n",
      "Observations  ER_H2O_IWRMD_MI 131\n",
      "Observations  ER_H2O_IWRMD 131\n",
      "Observations  ER_H2O_IWRMD_EE 131\n",
      "Total elements of ER_H2O_IWRMP: 0 in 0 pages\n",
      "Total elements of ER_H2O_WUEYST: 3680 in 148 pages\n",
      "Total elements of SH_H2O_SAFE: 1646 in 66 pages\n",
      "Total elements of ER_H2O_STRESS: 3519 in 141 pages\n",
      "Observations  ER_H2O_IWRMP 0\n",
      "Observations  SH_H2O_SAFE 1646\n",
      "Observations  ER_H2O_STRESS 3445\n",
      "Observations  ER_H2O_WUEYST 3327\n",
      "Collect data : 0.8352775136629741 minutes\n",
      "Data/2.UN_observations/observations6.json created\n",
      "Goal 7\n",
      "Total elements of EG_FEC_RNEW: 1081 in 44 pages\n",
      "Total elements of EG_ACS_ELEC: 3384 in 136 pages\n",
      "Total elements of EG_EGY_CLEAN: 3048 in 122 pages\n",
      "Total elements of EG_IFF_RANDN: 1536 in 62 pages\n",
      "Total elements of EG_EGY_RNEW: 14112 in 565 pages\n",
      "Observations  EG_FEC_RNEW 1074\n",
      "Observations  EG_IFF_RANDN 1536\n",
      "Observations  EG_ACS_ELEC 3371\n",
      "Observations  EG_EGY_CLEAN 3024\n",
      "Observations  EG_EGY_RNEW 14112\n",
      "Total elements of EG_EGY_PRIM: 1081 in 44 pages\n",
      "Observations  EG_EGY_PRIM 961\n",
      "Collect data : 0.8199737111727396 minutes\n",
      "Data/2.UN_observations/observations7.json created\n",
      "Goal 8\n",
      "Total elements of EN_MAT_FTPRTN: 0 in 0 pages\n",
      "Total elements of EN_MAT_FTPRPG: 0 in 0 pages\n",
      "Total elements of EN_MAT_FTPRPC: 0 in 0 pages\n",
      "Observations  EN_MAT_FTPRTN 0\n",
      "Observations  EN_MAT_FTPRPG 0\n",
      "Observations  EN_MAT_FTPRPC 0\n",
      "Total elements of EN_MAT_DOMCMPC: 34716 in 1389 pages\n",
      "Total elements of EN_MAT_DOMCMPG: 33196 in 1328 pages\n",
      "Observations  EN_MAT_DOMCMPG 33196\n",
      "Observations  EN_MAT_DOMCMPC 34716\n",
      "Total elements of EN_MAT_DOMCMPT: 35212 in 1409 pages\n",
      "Total elements of FB_CBK_BRCH: 777 in 32 pages\n",
      "Total elements of FB_BNK_ACCSS: 1372 in 55 pages\n",
      "Total elements of FB_BNK_ACCSS_OLF: 149 in 6 pages\n",
      "Total elements of FB_BNK_ACCSS_ILF: 149 in 6 pages\n",
      "Observations  FB_BNK_ACCSS_OLF 149\n",
      "Observations  FB_BNK_ACCSS_ILF 149\n",
      "Observations  FB_CBK_BRCH 777\n",
      "Observations  FB_BNK_ACCSS 1372\n",
      "Observations  EN_MAT_DOMCMPT 35212\n",
      "Total elements of FB_ATM_TOTL: 784 in 32 pages\n",
      "Total elements of DC_TOF_TRDDBMDL: 442 in 18 pages\n",
      "Total elements of DC_TOF_TRDCMDL: 442 in 18 pages\n",
      "Total elements of SL_ISV_IFEM_19ICLS: 2335 in 94 pages\n",
      "Total elements of SL_ISV_IFEM: 4570 in 183 pages\n",
      "Observations  DC_TOF_TRDDBMDL 442\n",
      "Observations  DC_TOF_TRDCMDL 442\n",
      "Observations  FB_ATM_TOTL 784\n",
      "Observations  SL_ISV_IFEM_19ICLS 2335\n",
      "Observations  SL_ISV_IFEM 4570\n",
      "Total elements of DC_TOF_TRDCML: 149 in 6 pages\n",
      "Total elements of DC_TOF_TRDDBML: 149 in 6 pages\n",
      "Total elements of SL_LBR_NTLCPL: 369 in 15 pages\n",
      "Total elements of SL_EMP_FTLINJUR: 1709 in 69 pages\n",
      "Total elements of SL_EMP_INJUR: 1695 in 68 pages\n",
      "Observations  DC_TOF_TRDDBML 149\n",
      "Observations  DC_TOF_TRDCML 149\n",
      "Observations  SL_LBR_NTLCPL 369\n",
      "Observations  SL_EMP_INJUR 1695\n",
      "Observations  SL_EMP_FTLINJUR 1709\n",
      "Total elements of NY_GDP_PCAP: 1056 in 43 pages\n",
      "Total elements of SL_EMP_PCAP: 997 in 40 pages\n",
      "Total elements of SL_CPA_YEMP: 158 in 7 pages\n",
      "Total elements of SL_TLF_UEMDIS_19ICLS: 2607 in 105 pages\n",
      "Total elements of SL_TLF_UEMDIS: 5275 in 211 pages\n",
      "Observations  SL_CPA_YEMP 158\n",
      "Observations  NY_GDP_PCAP 1056\n",
      "Observations  SL_EMP_PCAP 997\n",
      "Observations  SL_TLF_UEMDIS_19ICLS 2607\n",
      "Observations  SL_TLF_UEMDIS 5275\n",
      "Total elements of SL_TLF_UEM: 8331 in 334 pages\n",
      "Total elements of SL_TLF_UEM_19ICLS: 2984 in 120 pages\n",
      "Total elements of SL_TLF_NEET_19ICLS: 975 in 39 pages\n",
      "Total elements of SL_TLF_NEET: 2577 in 104 pages\n",
      "Total elements of SL_EMP_EARN: 8329 in 334 pages\n",
      "Observations  SL_TLF_NEET_19ICLS 975\n",
      "Observations  SL_TLF_NEET 2577\n",
      "Observations  SL_TLF_UEM_19ICLS 2984\n",
      "Observations  SL_EMP_EARN 8329\n",
      "Observations  SL_TLF_UEM 8331\n",
      "Total elements of ST_GDP_ZS: 337 in 14 pages\n",
      "Total elements of ST_EMP_TRSMN: 451 in 19 pages\n",
      "Total elements of SL_TLF_CHLDEC: 18 in 1 pages\n",
      "Total elements of SL_TLF_CHLDEA: 18 in 1 pages\n",
      "Observations  SL_TLF_CHLDEA 18\n",
      "Observations  SL_TLF_CHLDEC 18\n",
      "Observations  ST_GDP_ZS 337\n",
      "Observations  ST_EMP_TRSMN 451\n",
      "Collect data : 4.506284002463023 minutes\n",
      "Data/2.UN_observations/observations8.json created\n",
      "Goal 9\n",
      "Total elements of IT_MOB_5GNTWK: 1176 in 48 pages\n",
      "Total elements of IT_MOB_2GNTWK: 976 in 40 pages\n",
      "Total elements of IT_MOB_4GNTWK: 521 in 21 pages\n",
      "Total elements of EN_ATM_CO2GDP: 920 in 37 pages\n",
      "Total elements of IT_MOB_3GNTWK: 667 in 27 pages\n",
      "Observations  IT_MOB_4GNTWK 521\n",
      "Observations  IT_MOB_3GNTWK 667\n",
      "Observations  EN_ATM_CO2GDP 915\n",
      "Observations  IT_MOB_2GNTWK 976\n",
      "Observations  IT_MOB_5GNTWK 146\n",
      "Total elements of IS_RDP_LULFRG: 0 in 0 pages\n",
      "Total elements of IS_RDP_PFVOL: 224 in 9 pages\n",
      "Total elements of EN_ATM_CO2MVA: 915 in 37 pages\n",
      "Total elements of IS_RDP_PORFVOL: 400 in 16 pages\n",
      "Total elements of EN_ATM_CO2: 1886 in 76 pages\n",
      "Observations  IS_RDP_LULFRG 0\n",
      "Observations  IS_RDP_PFVOL 224\n",
      "Observations  IS_RDP_PORFVOL 400\n",
      "Observations  EN_ATM_CO2MVA 915\n",
      "Observations  EN_ATM_CO2 1875\n",
      "Total elements of SP_ROD_R2KM: 0 in 0 pages\n",
      "Total elements of DC_TOF_INFRAL: 194 in 8 pages\n",
      "Total elements of GB_XPD_RSDV: 863 in 35 pages\n",
      "Total elements of IS_RDP_FRGVOL: 214 in 9 pages\n",
      "Total elements of GB_POP_SCIERD: 798 in 32 pages\n",
      "Observations  SP_ROD_R2KM 0\n",
      "Observations  IS_RDP_FRGVOL 214\n",
      "Observations  DC_TOF_INFRAL 194\n",
      "Observations  GB_XPD_RSDV 863\n",
      "Observations  GB_POP_SCIERD 798\n",
      "Total elements of NV_IND_MANFPC: 1100 in 44 pages\n",
      "Total elements of NV_IND_TECH: 842 in 34 pages\n",
      "Total elements of NV_IND_MANF_CD: 1056 in 43 pages\n",
      "Total elements of SL_TLF_MANF_19ICLS: 329 in 14 pages\n",
      "Total elements of NV_IND_MANF: 1100 in 44 pages\n",
      "Observations  SL_TLF_MANF_19ICLS 329\n",
      "Observations  NV_IND_TECH 842\n",
      "Observations  NV_IND_MANFPC 1100\n",
      "Observations  NV_IND_MANF_CD 1056\n",
      "Observations  NV_IND_MANF 1100\n",
      "Total elements of NV_IND_SSIS: 695 in 28 pages\n",
      "Total elements of FC_ACC_SSID: 93 in 4 pages\n",
      "Total elements of NV_IND_SSIS_NC: 580 in 24 pages\n",
      "Total elements of SL_TLF_MANF: 937 in 38 pages\n",
      "Observations  FC_ACC_SSID 93\n",
      "Observations  NV_IND_SSIS_NC 580\n",
      "Observations  NV_IND_SSIS 695\n",
      "Observations  SL_TLF_MANF 937\n",
      "Collect data : 0.39581472873687745 minutes\n",
      "Data/2.UN_observations/observations9.json created\n",
      "Goal 10\n",
      "Total elements of SI_HEI_TOTL: 76 in 4 pages\n",
      "Total elements of SL_EMP_GTOTL: 714 in 29 pages\n",
      "Total elements of TM_TRF_ZERO: 3235 in 130 pages\n",
      "Total elements of SI_DST_FISP: 753 in 31 pages\n",
      "Total elements of SI_RMT_COST_SC: 1213 in 49 pages\n",
      "Observations  SI_HEI_TOTL 76\n",
      "Observations  SL_EMP_GTOTL 714\n",
      "Observations  SI_DST_FISP 518\n",
      "Observations  SI_RMT_COST_SC 1155\n",
      "Observations  TM_TRF_ZERO 3235\n",
      "Total elements of SI_RMT_COST_SND: 126 in 6 pages\n",
      "Total elements of SI_RMT_COST: 132 in 6 pages\n",
      "Total elements of SI_POV_50MI: 1000 in 40 pages\n",
      "Total elements of SI_RMT_COST_BC: 1213 in 49 pages\n",
      "Total elements of VC_VOV_GDSD: 3412 in 137 pages\n",
      "Observations  SI_RMT_COST 126\n",
      "Observations  SI_RMT_COST_SND 119\n",
      "Observations  SI_POV_50MI 1000\n",
      "Observations  SI_RMT_COST_BC 1187\n",
      "Observations  VC_VOV_GDSD 3412\n",
      "Total elements of SG_CPA_MIGRP: 0 in 0 pages\n",
      "Total elements of SM_DTH_MIGR: 175 in 7 pages\n",
      "Total elements of SM_POP_REFG_OR: 1150 in 46 pages\n",
      "Total elements of SG_CPA_MIGRS: 483 in 20 pages\n",
      "Total elements of SL_EMP_RCOST_MO: 0 in 0 pages\n",
      "Observations  SG_CPA_MIGRP 0\n",
      "Observations  SL_EMP_RCOST_MO 0\n",
      "Observations  SM_DTH_MIGR 175\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Series: SG_CPA_MIGRS value\n",
      "N\n",
      "Observations  SG_CPA_MIGRS 483\n",
      "Exceptions SG_CPA_MIGRS 49\n",
      "Observations  SM_POP_REFG_OR 1150\n",
      "Total elements of FI_FSI_FSERA: 653 in 27 pages\n",
      "Total elements of FI_FSI_FSKNL: 592 in 24 pages\n",
      "Total elements of FI_FSI_FSSNO: 499 in 20 pages\n",
      "Total elements of FI_FSI_FSKRTC: 659 in 27 pages\n",
      "Total elements of FI_FSI_FSANL: 630 in 26 pages\n",
      "Observations  FI_FSI_FSSNO 499\n",
      "Observations  FI_FSI_FSKNL 592\n",
      "Observations  FI_FSI_FSERA 653\n",
      "Observations  FI_FSI_FSKRTC 659\n",
      "Observations  FI_FSI_FSANL 630\n",
      "Total elements of DC_TRF_TFDV: 0 in 0 pages\n",
      "Total elements of FI_FSI_FSLS: 589 in 24 pages\n",
      "Total elements of DC_TRF_TOTL: 196 in 8 pages\n",
      "Total elements of FI_FSI_FSKA: 623 in 25 pages\n",
      "Total elements of DC_TRF_TOTDL: 750 in 30 pages\n",
      "Observations  DC_TRF_TFDV 0\n",
      "Observations  DC_TRF_TOTL 196\n",
      "Observations  FI_FSI_FSLS 589\n",
      "Observations  FI_FSI_FSKA 623\n",
      "Observations  DC_TRF_TOTDL 750\n",
      "Total elements of SG_INT_MBRDEV: 6566 in 263 pages\n",
      "Total elements of SG_INT_VRTDEV: 6566 in 263 pages\n",
      "Observations  SG_INT_VRTDEV 6566\n",
      "Observations  SG_INT_MBRDEV 6566\n",
      "Collect data : 0.9052310109138488 minutes\n",
      "Data/2.UN_observations/observations10.json created\n",
      "Goal 11\n",
      "Total elements of VC_DSR_PDAN: 762 in 31 pages\n",
      "Total elements of VC_DSR_PDLN: 543 in 22 pages\n",
      "Total elements of VC_DSR_MTMP: 1176 in 48 pages\n",
      "Total elements of VC_DSR_AFFCT: 987 in 40 pages\n",
      "Total elements of VC_DSR_DAFF: 987 in 40 pages\n",
      "Observations  VC_DSR_PDLN 543\n",
      "Observations  VC_DSR_PDAN 762\n",
      "Observations  VC_DSR_AFFCT 987\n",
      "Observations  VC_DSR_MTMP 1176\n",
      "Observations  VC_DSR_DAFF 987\n",
      "Total elements of VC_DSR_MORT: 1167 in 47 pages\n",
      "Total elements of VC_DSR_MISS: 576 in 24 pages\n",
      "Total elements of VC_DSR_PDYN: 621 in 25 pages\n",
      "Total elements of VC_DSR_MMHN: 1176 in 48 pages\n",
      "Total elements of VC_DSR_IJILN: 912 in 37 pages\n",
      "Observations  VC_DSR_MISS 576\n",
      "Observations  VC_DSR_PDYN 621\n",
      "Observations  VC_DSR_MMHN 1176\n",
      "Observations  VC_DSR_MORT 1167\n",
      "Observations  VC_DSR_IJILN 912\n",
      "Total elements of VC_DSR_BSDN: 132 in 6 pages\n",
      "Total elements of VC_DSR_ESDN: 112 in 5 pages\n",
      "Total elements of VC_DSR_EFDN: 130 in 6 pages\n",
      "Total elements of VC_DSR_HFDN: 125 in 5 pages\n",
      "Total elements of VC_DSR_CDAN: 140 in 6 pages\n",
      "Observations  VC_DSR_ESDN 112\n",
      "Observations  VC_DSR_EFDN 130\n",
      "Observations  VC_DSR_BSDN 132\n",
      "Observations  VC_DSR_HFDN 125\n",
      "Observations  VC_DSR_CDAN 140\n",
      "Total elements of VC_DSR_CDYN: 99 in 4 pages\n",
      "Total elements of VC_DSR_HSDN: 111 in 5 pages\n",
      "Total elements of VC_DSR_OBDN: 101 in 5 pages\n",
      "Total elements of VC_DSR_CHLN: 262 in 11 pages\n",
      "Total elements of VC_DSR_AGLH: 322 in 13 pages\n",
      "Observations  VC_DSR_OBDN 101\n",
      "Observations  VC_DSR_HSDN 111\n",
      "Observations  VC_DSR_CDYN 99\n",
      "Observations  VC_DSR_CHLN 262\n",
      "Observations  VC_DSR_AGLH 322\n",
      "Total elements of VC_DSR_DDPA: 306 in 13 pages\n",
      "Total elements of VC_DSR_CILN: 374 in 15 pages\n",
      "Total elements of VC_DSR_GDPLS: 530 in 22 pages\n",
      "Total elements of VC_DSR_HOLH: 498 in 20 pages\n",
      "Total elements of VC_DSR_LSGP: 530 in 22 pages\n",
      "Observations  VC_DSR_DDPA 306\n",
      "Observations  VC_DSR_CILN 374\n",
      "Observations  VC_DSR_GDPLS 530\n",
      "Observations  VC_DSR_HOLH 498\n",
      "Observations  VC_DSR_LSGP 530\n",
      "Total elements of VC_VOH_SXPH: 16 in 1 pages\n",
      "Total elements of SG_URB_CSPART: 255 in 11 pages\n",
      "Observations  VC_VOH_SXPH 16\n",
      "Total elements of EN_LND_CNSPOP: 1292 in 52 pages\n",
      "Total elements of EN_URB_OPENSP: 1051 in 43 pages\n",
      "Total elements of EN_ACS_URB_OPENSP: 254 in 11 pages\n",
      "Observations  SG_URB_CSPART 255\n",
      "Observations  EN_ACS_URB_OPENSP 254\n",
      "Observations  EN_URB_OPENSP 1051\n",
      "Observations  EN_LND_CNSPOP 1292\n",
      "Total elements of SG_DSR_SFDRR: 0 in 0 pages\n",
      "Total elements of SG_DSR_LGRGSR: 510 in 21 pages\n",
      "Total elements of SG_GOV_LOGV: 561 in 23 pages\n",
      "Total elements of SG_DSR_SILN: 537 in 22 pages\n",
      "Total elements of SG_DSR_SILS: 528 in 22 pages\n",
      "Observations  SG_DSR_SFDRR 0\n",
      "Observations  SG_DSR_LGRGSR 510\n",
      "Observations  SG_GOV_LOGV 561\n",
      "Observations  SG_DSR_SILN 537\n",
      "Observations  SG_DSR_SILS 528\n",
      "Total elements of SD_CPA_UPRDP: 104 in 5 pages\n",
      "Total elements of GB_XPD_CULNAT_PBPV: 67 in 3 pages\n",
      "Total elements of GB_XPD_CUL_PBPV: 58 in 3 pages\n",
      "Total elements of EN_LND_SLUM: 479 in 20 pages\n",
      "Total elements of EN_LND_INDQTHSNG: 1888 in 76 pages\n",
      "Observations  GB_XPD_CULNAT_PBPV 67\n",
      "Observations  GB_XPD_CUL_PBPV 58\n",
      "Observations  SD_CPA_UPRDP 104\n",
      "Observations  EN_LND_SLUM 479\n",
      "Observations  EN_LND_INDQTHSNG 1888\n",
      "Total elements of GB_XPD_CULNAT_PB: 311 in 13 pages\n",
      "Total elements of GB_XPD_NAT_PBPV: 49 in 2 pages\n",
      "Total elements of GB_XPD_CULNAT_PV: 71 in 3 pages\n",
      "Total elements of EN_ATM_PM25: 2330 in 94 pages\n",
      "Observations  GB_XPD_NAT_PBPV 49\n",
      "Observations  GB_XPD_CULNAT_PV 71\n",
      "Total elements of EN_REF_WASCOL: 636 in 26 pages\n",
      "Observations  GB_XPD_CULNAT_PB 311\n",
      "Observations  EN_REF_WASCOL 636\n",
      "Observations  EN_ATM_PM25 2330\n",
      "Total elements of SP_TRN_PUBL: 908 in 37 pages\n",
      "Observations  SP_TRN_PUBL 908\n",
      "Collect data : 0.7091745535532633 minutes\n",
      "Data/2.UN_observations/observations11.json created\n",
      "Goal 12\n",
      "Total elements of EN_MAT_FTPRTN: 0 in 0 pages\n",
      "Total elements of EN_MAT_FTPRPG: 0 in 0 pages\n",
      "Total elements of EN_MAT_DOMCMPC: 34716 in 1389 pages\n",
      "Total elements of EN_MAT_DOMCMPT: 35212 in 1409 pages\n",
      "Observations  EN_MAT_FTPRPG 0\n",
      "Observations  EN_MAT_FTPRTN 0\n",
      "Total elements of EN_MAT_DOMCMPG: 33196 in 1328 pages\n",
      "Observations  EN_MAT_DOMCMPT 35212\n",
      "Observations  EN_MAT_DOMCMPG 33196\n",
      "Observations  EN_MAT_DOMCMPC 34716\n",
      "Total elements of EN_MAT_FTPRPC: 0 in 0 pages\n",
      "Total elements of SG_SCP_TOTLN: 22 in 1 pages\n",
      "Total elements of SG_SCP_POLINS: 52 in 3 pages\n",
      "Observations  EN_MAT_FTPRPC 0\n",
      "Observations  SG_SCP_TOTLN 22\n",
      "Observations  SG_SCP_POLINS 52\n",
      "Total elements of SG_SCP_CNTRY: 22 in 1 pages\n",
      "Total elements of EG_EGY_RNEW: 14112 in 565 pages\n",
      "Observations  SG_SCP_CNTRY 22\n",
      "Observations  EG_EGY_RNEW 14112\n",
      "Total elements of SE_GCEDESD_SAS: 81 in 4 pages\n",
      "Total elements of SG_SCP_PROCN_HS: 13 in 1 pages\n",
      "Total elements of SE_GCEDESD_NEP: 90 in 4 pages\n",
      "Total elements of SE_GCEDESD_TED: 81 in 4 pages\n",
      "Total elements of SE_GCEDESD_CUR: 81 in 4 pages\n",
      "Observations  SE_GCEDESD_SAS 81\n",
      "Observations  SG_SCP_PROCN_HS 13\n",
      "Observations  SE_GCEDESD_NEP 90\n",
      "Observations  SE_GCEDESD_TED 81\n",
      "Observations  SE_GCEDESD_CUR 81\n",
      "Total elements of AG_FLS_INDEX: 0 in 0 pages\n",
      "Total elements of SG_SCP_PROCN_LS: 6 in 1 pages\n",
      "Total elements of SG_SCP_PROCN: 44 in 2 pages\n",
      "Total elements of AG_FOOD_WST: 603 in 25 pages\n",
      "Total elements of AG_FOOD_WST_PC: 603 in 25 pages\n",
      "Observations  AG_FLS_INDEX 0\n",
      "Observations  SG_SCP_PROCN_LS 6\n",
      "Observations  SG_SCP_PROCN 44\n",
      "Observations  AG_FOOD_WST_PC 603\n",
      "Observations  AG_FOOD_WST 603\n",
      "Total elements of AG_FLS_PCT: 0 in 0 pages\n",
      "Total elements of SG_HAZ_CMRBASEL: 130 in 6 pages\n",
      "Total elements of SG_HAZ_CMRMNMT: 68 in 3 pages\n",
      "Total elements of SG_HAZ_CMRROTDAM: 118 in 5 pages\n",
      "Total elements of SG_HAZ_CMRMNTRL: 135 in 6 pages\n",
      "Observations  AG_FLS_PCT 0\n",
      "Observations  SG_HAZ_CMRMNMT 68\n",
      "Observations  SG_HAZ_CMRBASEL 130\n",
      "Observations  SG_HAZ_CMRROTDAM 118\n",
      "Observations  SG_HAZ_CMRMNTRL 135\n",
      "Total elements of SG_HAZ_CMRSTHOLM: 125 in 5 pages\n",
      "Total elements of EN_MWT_COLLV: 895 in 36 pages\n",
      "Total elements of EN_EWT_COLLV: 518 in 21 pages\n",
      "Total elements of EN_MWT_TREATR: 2949 in 118 pages\n",
      "Total elements of EN_HAZ_TREATV: 1877 in 76 pages\n",
      "Observations  SG_HAZ_CMRSTHOLM 125\n",
      "Observations  EN_EWT_COLLV 518\n",
      "Observations  EN_MWT_COLLV 895\n",
      "Observations  EN_HAZ_TREATV 1877\n",
      "Observations  EN_MWT_TREATR 2949\n",
      "Total elements of EN_EWT_GENV: 48 in 2 pages\n",
      "Total elements of EN_MWT_GENV: 833 in 34 pages\n",
      "Total elements of EN_EWT_COLLPCAP: 544 in 22 pages\n",
      "Total elements of EN_MWT_IMP: 93 in 4 pages\n",
      "Total elements of EN_MWT_TREATV: 4347 in 174 pages\n",
      "Observations  EN_EWT_GENV 48\n",
      "Observations  EN_MWT_IMP 93\n",
      "Observations  EN_EWT_COLLPCAP 544\n",
      "Observations  EN_MWT_GENV 833\n",
      "Observations  EN_MWT_TREATV 4347\n",
      "Total elements of EN_EWT_COLLR: 136 in 6 pages\n",
      "Total elements of EN_EWT_GENPCAP: 49 in 2 pages\n",
      "Total elements of EN_MWT_EXP: 94 in 4 pages\n",
      "Total elements of EN_HAZ_IMP: 468 in 19 pages\n",
      "Total elements of EN_HAZ_GENV: 453 in 19 pages\n",
      "Observations  EN_EWT_GENPCAP 49\n",
      "Observations  EN_MWT_EXP 94\n",
      "Observations  EN_EWT_COLLR 136\n",
      "Observations  EN_HAZ_GENV 453\n",
      "Observations  EN_HAZ_IMP 468\n",
      "Total elements of EN_HAZ_TRTDISR: 401 in 17 pages\n",
      "Total elements of EN_HAZ_PCAP: 452 in 19 pages\n",
      "Total elements of EN_HAZ_EXP: 487 in 20 pages\n",
      "Total elements of EN_HAZ_TRTDISV: 424 in 17 pages\n",
      "Total elements of EN_HAZ_GENGDP: 453 in 19 pages\n",
      "Observations  EN_HAZ_GENGDP 453\n",
      "Observations  EN_HAZ_TRTDISR 401\n",
      "Observations  EN_HAZ_TRTDISV 424\n",
      "Observations  EN_HAZ_PCAP 452\n",
      "Observations  EN_HAZ_EXP 487\n",
      "Total elements of ST_EEV_STDACCT: 651 in 27 pages\n",
      "Total elements of ER_FFS_CMPT_CD: 377 in 16 pages\n",
      "Total elements of ER_FFS_CMPT_PC_CD: 377 in 16 pages\n",
      "Total elements of ER_FFS_CMPT_GDP: 376 in 16 pages\n",
      "Total elements of EN_TWT_GENV: 3338 in 134 pages\n",
      "Observations  ER_FFS_CMPT_CD 377\n",
      "Observations  ER_FFS_CMPT_PC_CD 377\n",
      "Observations  ER_FFS_CMPT_GDP 376\n",
      "Observations  ST_EEV_STDACCT 651\n",
      "Observations  EN_TWT_GENV 3338\n",
      "Total elements of EN_MWT_RCYV: 839 in 34 pages\n",
      "Total elements of ST_EEV_ACCTSA: 641 in 26 pages\n",
      "Total elements of ST_EEV_ACCSEEA: 632 in 26 pages\n",
      "Total elements of EN_EWT_RCYPCAP: 540 in 22 pages\n",
      "Total elements of EN_EWT_RCYV: 540 in 22 pages\n",
      "Observations  EN_EWT_RCYPCAP 540\n",
      "Observations  EN_EWT_RCYV 540\n",
      "Observations  ST_EEV_ACCSEEA 632\n",
      "Observations  ST_EEV_ACCTSA 641\n",
      "Observations  EN_MWT_RCYV 839\n",
      "Total elements of EN_MWT_RCYR: 818 in 33 pages\n",
      "Total elements of EN_EWT_RCYR: 385 in 16 pages\n",
      "Total elements of EN_SCP_FRMN: 2220 in 89 pages\n",
      "Observations  EN_EWT_RCYR 385\n",
      "Observations  EN_MWT_RCYR 818\n",
      "Observations  EN_SCP_FRMN 2220\n",
      "Collect data : 3.470733924706777 minutes\n",
      "Data/2.UN_observations/observations12.json created\n",
      "Goal 13\n",
      "Total elements of VC_DSR_MISS: 576 in 24 pages\n",
      "Total elements of VC_DSR_MORT: 1167 in 47 pages\n",
      "Total elements of VC_DSR_AFFCT: 987 in 40 pages\n",
      "Total elements of VC_DSR_PDYN: 621 in 25 pages\n",
      "Total elements of VC_DSR_MMHN: 1176 in 48 pages\n",
      "Observations  VC_DSR_MISS 576\n",
      "Observations  VC_DSR_PDYN 621\n",
      "Observations  VC_DSR_MMHN 1176\n",
      "Observations  VC_DSR_AFFCT 987\n",
      "Observations  VC_DSR_MORT 1167\n",
      "Total elements of VC_DSR_IJILN: 912 in 37 pages\n",
      "Total elements of VC_DSR_PDLN: 543 in 22 pages\n",
      "Total elements of VC_DSR_PDAN: 762 in 31 pages\n",
      "Total elements of VC_DSR_DAFF: 987 in 40 pages\n",
      "Total elements of VC_DSR_MTMP: 1176 in 48 pages\n",
      "Observations  VC_DSR_PDLN 543\n",
      "Observations  VC_DSR_PDAN 762\n",
      "Observations  VC_DSR_IJILN 912\n",
      "Observations  VC_DSR_DAFF 987\n",
      "Observations  VC_DSR_MTMP 1176\n",
      "Total elements of SG_DSR_SFDRR: 0 in 0 pages\n",
      "Total elements of SG_DSR_LGRGSR: 510 in 21 pages\n",
      "Total elements of SG_DSR_SILS: 528 in 22 pages\n",
      "Total elements of SG_DSR_SILN: 537 in 22 pages\n",
      "Total elements of SG_GOV_LOGV: 561 in 23 pages\n",
      "Observations  SG_DSR_SFDRR 0\n",
      "Observations  SG_GOV_LOGV 561\n",
      "Observations  SG_DSR_SILN 537\n",
      "Observations  SG_DSR_LGRGSR 510\n",
      "Observations  SG_DSR_SILS 528\n",
      "Total elements of EN_BIUREP_NAIP_DV: 0 in 0 pages\n",
      "Total elements of SE_GCEDESD_TED: 81 in 4 pages\n",
      "Total elements of SE_GCEDESD_NEP: 90 in 4 pages\n",
      "Total elements of SE_GCEDESD_CUR: 81 in 4 pages\n",
      "Total elements of SE_GCEDESD_SAS: 81 in 4 pages\n",
      "Observations  EN_BIUREP_NAIP_DV 0\n",
      "Observations  SE_GCEDESD_NEP 90\n",
      "Observations  SE_GCEDESD_TED 81\n",
      "Observations  SE_GCEDESD_SAS 81\n",
      "Observations  SE_GCEDESD_CUR 81\n",
      "Total elements of EN_NAA_PLAN_DV: 0 in 0 pages\n",
      "Total elements of EN_NACOM_NAIP_DV: 0 in 0 pages\n",
      "Total elements of EN_ADAP_COM_DV: 0 in 0 pages\n",
      "Total elements of EN_NAD_CONTR_DV: 0 in 0 pages\n",
      "Total elements of EN_ATM_GHGT_AIP: 792 in 32 pages\n",
      "Observations  EN_NAA_PLAN_DV 0\n",
      "Observations  EN_ADAP_COM_DV 0\n",
      "Observations  EN_NACOM_NAIP_DV 0\n",
      "Observations  EN_NAD_CONTR_DV 0\n",
      "Observations  EN_ATM_GHGT_AIP 792\n",
      "Total elements of EN_NAA_PLAN: 0 in 0 pages\n",
      "Total elements of EN_BIUREP_NAIP: 0 in 0 pages\n",
      "Total elements of EN_NAD_CONTR: 0 in 0 pages\n",
      "Total elements of EN_NACOM_AIP: 0 in 0 pages\n",
      "Total elements of EN_ATM_GHGT_NAIP: 126 in 6 pages\n",
      "Observations  EN_NAA_PLAN 0\n",
      "Observations  EN_BIUREP_NAIP 0\n",
      "Observations  EN_NAD_CONTR 0\n",
      "Observations  EN_NACOM_AIP 0\n",
      "Observations  EN_ATM_GHGT_NAIP 126\n",
      "Total elements of DC_FIN_CLIMT: 0 in 0 pages\n",
      "Total elements of EN_ADAP_COM: 0 in 0 pages\n",
      "Total elements of EN_NACOM_NAIP: 0 in 0 pages\n",
      "Total elements of EN_BIUREP_AIP: 0 in 0 pages\n",
      "Total elements of DC_FIN_CLIMB: 0 in 0 pages\n",
      "Observations  DC_FIN_CLIMT 0\n",
      "Observations  EN_NACOM_NAIP 0\n",
      "Observations  EN_ADAP_COM 0\n",
      "Observations  EN_BIUREP_AIP 0\n",
      "Observations  DC_FIN_CLIMB 0\n",
      "Total elements of DC_FIN_TOT: 0 in 0 pages\n",
      "Total elements of DC_FIN_CLIMM: 0 in 0 pages\n",
      "Total elements of DC_FIN_GEN: 0 in 0 pages\n",
      "Observations  DC_FIN_TOT 0\n",
      "Observations  DC_FIN_GEN 0\n",
      "Observations  DC_FIN_CLIMM 0\n",
      "Collect data : 0.3020585497220357 minutes\n",
      "Data/2.UN_observations/observations13.json created\n",
      "Goal 14\n",
      "Total elements of ER_UNCLOS_IMPLE: 27 in 2 pages\n",
      "Total elements of ER_UNCLOS_RATACC: 27 in 2 pages\n",
      "Total elements of ER_H2O_FWTL: 312 in 13 pages\n",
      "Total elements of EN_MAR_BEALIT_EXP: 174 in 7 pages\n",
      "Total elements of EN_MAR_TP_MML: 1900 in 76 pages\n",
      "Observations  ER_UNCLOS_IMPLE 26\n",
      "Observations  ER_UNCLOS_RATACC 27\n",
      "Observations  EN_MAR_BEALIT_EXP 174\n",
      "Observations  ER_H2O_FWTL 40\n",
      "Observations  EN_MAR_TP_MML 1900\n",
      "Total elements of EN_MAR_TN: 0 in 0 pages\n",
      "Total elements of EN_MAR_BEALIT_PUSA: 246 in 10 pages\n",
      "Total elements of EN_MAR_BEALIT_OP: 145 in 6 pages\n",
      "Total elements of EN_MAR_CHLDEV: 602 in 25 pages\n",
      "Total elements of EN_MAR_TN_MML: 1885 in 76 pages\n",
      "Observations  EN_MAR_TN 0\n",
      "Observations  EN_MAR_BEALIT_OP 145\n",
      "Observations  EN_MAR_BEALIT_PUSA 246\n",
      "Observations  EN_MAR_CHLDEV 602\n",
      "Observations  EN_MAR_TN_MML 1885\n",
      "Total elements of EN_MAR_TP: 0 in 0 pages\n",
      "Total elements of EN_MAR_PLASDD: 10 in 1 pages\n",
      "Total elements of EN_MAR_COEUPO: 0 in 0 pages\n",
      "Total elements of EN_MAR_DSI_MML: 9 in 1 pages\n",
      "Total elements of EN_MAR_CHLCONC: 12 in 1 pages\n",
      "Observations  EN_MAR_TP 0\n",
      "Observations  EN_MAR_PLASDD 10\n",
      "Observations  EN_MAR_COEUPO 0\n",
      "Observations  EN_MAR_DSI_MML 9\n",
      "Observations  EN_MAR_CHLCONC 12\n",
      "Total elements of EN_MAR_DSI: 0 in 0 pages\n",
      "Total elements of EN_MAR_BEALIT_OV: 145 in 6 pages\n",
      "Total elements of EN_MAR_BEALIT_BP: 145 in 6 pages\n",
      "Total elements of EN_MAR_CHLANM: 507 in 21 pages\n",
      "Total elements of EN_MAR_BEALIT_BV: 3012 in 121 pages\n",
      "Observations  EN_MAR_DSI 0\n",
      "Observations  EN_MAR_BEALIT_OV 145\n",
      "Observations  EN_MAR_BEALIT_BP 145\n",
      "Observations  EN_MAR_CHLANM 507\n",
      "Observations  EN_MAR_BEALIT_BV 3012\n",
      "Total elements of ER_RDE_OSEX: 65 in 3 pages\n",
      "Total elements of ER_REG_SSFRAR: 168 in 7 pages\n",
      "Total elements of ER_REG_UNFCIM: 168 in 7 pages\n",
      "Total elements of EN_SCP_FSHGDP: 189 in 8 pages\n",
      "Total elements of ER_OAW_MNACD: 857 in 35 pages\n",
      "Observations  ER_RDE_OSEX 65\n",
      "Observations  ER_REG_UNFCIM 131\n",
      "Observations  ER_REG_SSFRAR 128\n",
      "Observations  EN_SCP_FSHGDP 151\n",
      "Observations  ER_OAW_MNACD 857\n",
      "Total elements of ER_MRN_MPA: 1200 in 48 pages\n",
      "Total elements of EN_SCP_ECSYBA: 81 in 4 pages\n",
      "Observations  EN_SCP_ECSYBA 81\n",
      "Observations  ER_MRN_MPA 875\n",
      "Collect data : 0.5879722038904825 minutes\n",
      "Data/2.UN_observations/observations14.json created\n",
      "Goal 15\n",
      "Total elements of ER_IAS_NBSAPP: 0 in 0 pages\n",
      "Total elements of ER_IAS_GLOFUNP: 0 in 0 pages\n",
      "Observations  ER_IAS_NBSAPP 0\n",
      "Observations  ER_IAS_GLOFUNP 0\n",
      "Total elements of ER_IAS_NATBUD: 93 in 4 pages\n",
      "Total elements of ER_IAS_NBSAP: 132 in 6 pages\n",
      "Total elements of ER_IAS_LEGIS: 176 in 8 pages\n",
      "Observations  ER_IAS_NATBUD 91\n",
      "Observations  ER_IAS_NBSAP 132\n",
      "Observations  ER_IAS_LEGIS 176\n",
      "Total elements of ER_IAS_NATBUDP: 0 in 0 pages\n",
      "Total elements of DC_ODA_BDVL: 340 in 14 pages\n",
      "Total elements of DC_ODA_BDVDL: 878 in 36 pages\n",
      "Total elements of ER_IAS_GLOFUN: 93 in 4 pages\n",
      "Total elements of ER_WLD_TRPOACH: 712 in 29 pages\n",
      "Observations  ER_IAS_NATBUDP 0\n",
      "Observations  ER_IAS_GLOFUN 90\n",
      "Observations  DC_ODA_BDVL 340\n",
      "Observations  ER_WLD_TRPOACH 712\n",
      "Observations  DC_ODA_BDVDL 878\n",
      "Total elements of ER_CBD_ABSCLRHS: 207 in 9 pages\n",
      "Total elements of ER_CBD_NAGOYA: 179 in 8 pages\n",
      "Total elements of ER_CBD_ORSPGRFA: 468 in 19 pages\n",
      "Total elements of ER_CBD_SMTA: 676 in 28 pages\n",
      "Total elements of ER_RSK_LST: 1664 in 67 pages\n",
      "Observations  ER_CBD_ABSCLRHS 207\n",
      "Observations  ER_CBD_NAGOYA 179\n",
      "Observations  ER_CBD_ORSPGRFA 468\n",
      "Observations  ER_CBD_SMTA 676\n",
      "Observations  ER_RSK_LST 1664\n",
      "Total elements of AG_LND_DGRD: 56 in 3 pages\n",
      "Total elements of ER_CBD_PTYPGRFA: 676 in 28 pages\n",
      "Total elements of AG_LND_FRSTCHG: 102 in 5 pages\n",
      "Total elements of AG_LND_FRSTMGT: 336 in 14 pages\n",
      "Total elements of AG_LND_FRSTBIOPHA: 360 in 15 pages\n",
      "Observations  AG_LND_DGRD 39\n",
      "Observations  AG_LND_FRSTCHG 94\n",
      "Observations  AG_LND_FRSTMGT 255\n",
      "Observations  AG_LND_FRSTBIOPHA 360\n",
      "Observations  ER_CBD_PTYPGRFA 676\n",
      "Total elements of AG_LND_FRSTCERT: 624 in 25 pages\n",
      "Total elements of AG_LND_FRSTPRCT: 352 in 15 pages\n",
      "Total elements of ER_MTN_DGRDA: 514 in 21 pages\n",
      "Total elements of ER_MTN_TOTL: 1542 in 62 pages\n",
      "Total elements of ER_MTN_GRNCOV: 16962 in 679 pages\n",
      "Observations  AG_LND_FRSTPRCT 272\n",
      "Observations  ER_MTN_DGRDA 234\n",
      "Observations  AG_LND_FRSTCERT 624\n",
      "Observations  ER_MTN_TOTL 702\n",
      "Observations  ER_MTN_GRNCOV 7722\n",
      "Total elements of ER_MTN_GRNCVI: 16962 in 679 pages\n",
      "Total elements of AG_LND_FRSTN: 408 in 17 pages\n",
      "Total elements of AG_LND_FRST: 408 in 17 pages\n",
      "Total elements of ER_MTN_DGRDP: 514 in 21 pages\n",
      "Total elements of ER_PTD_MTN: 1200 in 48 pages\n",
      "Observations  AG_LND_FRSTN 408\n",
      "Observations  AG_LND_FRST 408\n",
      "Observations  ER_MTN_DGRDP 234\n",
      "Observations  ER_PTD_MTN 925\n",
      "Observations  ER_MTN_GRNCVI 7722\n",
      "Total elements of AG_LND_TOTL: 416 in 17 pages\n",
      "Total elements of ER_BDY_ABT2NP: 88 in 4 pages\n",
      "Total elements of ER_BDY_SEEA: 78 in 4 pages\n",
      "Total elements of ER_PTD_TERR: 1200 in 48 pages\n",
      "Total elements of ER_PTD_FRHWTR: 1200 in 48 pages\n",
      "Observations  ER_BDY_SEEA 78\n",
      "Observations  ER_BDY_ABT2NP 88\n",
      "Observations  AG_LND_TOTL 416\n",
      "Observations  ER_PTD_TERR 1200\n",
      "Observations  ER_PTD_FRHWTR 1000\n",
      "Collect data : 2.1757370829582214 minutes\n",
      "Data/2.UN_observations/observations15.json created\n",
      "Goal 16\n",
      "Total elements of SP_DISP_RESOL: 0 in 0 pages\n",
      "Total elements of VC_PRR_PSYCHV: 3 in 1 pages\n",
      "Total elements of VC_PRR_PHY_VIO: 18 in 1 pages\n",
      "Total elements of VC_PRR_ROBB: 78 in 4 pages\n",
      "Total elements of VC_PRR_SEXV: 55 in 3 pages\n",
      "Observations  VC_PRR_PSYCHV 3\n",
      "Observations  SP_DISP_RESOL 0\n",
      "Observations  VC_PRR_PHY_VIO 18\n",
      "Observations  VC_PRR_SEXV 55\n",
      "Observations  VC_PRR_ROBB 78\n",
      "Total elements of DI_ILL_IN: 0 in 0 pages\n",
      "Total elements of VC_PRR_SEX_VIO: 13 in 1 pages\n",
      "Total elements of VC_PRR_PHYV: 90 in 4 pages\n",
      "Total elements of VC_PRS_UNSNT: 1538 in 62 pages\n",
      "Observations  DI_ILL_IN 0\n",
      "Observations  VC_PRR_SEX_VIO 13\n",
      "Total elements of VC_VOV_GDSD: 3412 in 137 pages\n",
      "Observations  VC_PRR_PHYV 90\n",
      "Observations  VC_PRS_UNSNT 1538\n",
      "Observations  VC_VOV_GDSD 3412\n",
      "Total elements of DI_ILL_OUT: 0 in 0 pages\n",
      "Total elements of VC_ARM_SZTRACE: 49 in 2 pages\n",
      "Total elements of SG_DMK_PARLYN_UC: 82 in 4 pages\n",
      "Total elements of SG_DMK_PARLSP_UC: 86 in 4 pages\n",
      "Total elements of SG_DMK_PARLYR_UC: 79 in 4 pages\n",
      "Observations  DI_ILL_OUT 0\n",
      "Observations  VC_ARM_SZTRACE 49\n",
      "Observations  SG_DMK_PARLSP_UC 85\n",
      "Observations  SG_DMK_PARLYN_UC 82\n",
      "Observations  SG_DMK_PARLYR_UC 79\n",
      "Total elements of SG_DMK_PARLYR_LC: 201 in 9 pages\n",
      "Total elements of SG_DMK_PARLCC_LC: 1054 in 43 pages\n",
      "Total elements of SG_DMK_JDC_LWR: 642 in 26 pages\n",
      "Total elements of SG_DMK_JDC_HGR: 606 in 25 pages\n",
      "Total elements of SG_DMK_JDC: 755 in 31 pages\n",
      "Observations  SG_DMK_PARLYR_LC 201\n",
      "Observations  SG_DMK_JDC_HGR 606\n",
      "Observations  SG_DMK_JDC_LWR 642\n",
      "Observations  SG_DMK_JDC 755\n",
      "Observations  SG_DMK_PARLCC_LC 1054\n",
      "Total elements of SG_DMK_PARLYP_LC: 213 in 9 pages\n",
      "Total elements of SG_DMK_PARLYP_UC: 82 in 4 pages\n",
      "Total elements of SG_DMK_PARLCC_JC: 33 in 2 pages\n",
      "Total elements of SG_DMK_PARLCC_UC: 358 in 15 pages\n",
      "Total elements of SG_DMK_JDC_CNS: 554 in 23 pages\n",
      "Observations  SG_DMK_PARLCC_JC 33\n",
      "Observations  SG_DMK_PARLYP_UC 82\n",
      "Observations  SG_DMK_PARLYP_LC 213\n",
      "Observations  SG_DMK_PARLCC_UC 358\n",
      "Observations  SG_DMK_JDC_CNS 554\n",
      "Total elements of SG_DMK_PARLMP_UC: 81 in 4 pages\n",
      "Total elements of SG_DMK_PARLMP_LC: 207 in 9 pages\n",
      "Total elements of SG_DMK_PARLYN_LC: 213 in 9 pages\n",
      "Total elements of SG_DMK_PARLSP_LC: 227 in 10 pages\n",
      "Total elements of SG_DMK_PSRVC: 1171 in 47 pages\n",
      "Observations  SG_DMK_PARLMP_UC 81\n",
      "Observations  SG_DMK_PARLMP_LC 207\n",
      "Observations  SG_DMK_PARLYN_LC 213\n",
      "Observations  SG_DMK_PARLSP_LC 227\n",
      "Observations  SG_DMK_PSRVC 1171\n",
      "Total elements of SG_INT_VRTDEV: 6566 in 263 pages\n",
      "Total elements of SG_INT_MBRDEV: 6566 in 263 pages\n",
      "Total elements of IU_DMK_INCL: 221 in 9 pages\n",
      "Total elements of IU_DMK_RESP: 89 in 4 pages\n",
      "Total elements of IU_DMK_ICRS: 38 in 2 pages\n",
      "Observations  IU_DMK_ICRS 38\n",
      "Observations  IU_DMK_RESP 89\n",
      "Observations  IU_DMK_INCL 221\n",
      "Observations  SG_INT_VRTDEV 6566\n",
      "Observations  SG_INT_MBRDEV 6566\n",
      "Total elements of VC_DTH_TONCVN: 0 in 0 pages\n",
      "Total elements of VC_SNS_WALN_DRK: 207 in 9 pages\n",
      "Observations  VC_DTH_TONCVN 0\n",
      "Total elements of VC_DTH_TOUNN: 0 in 0 pages\n",
      "Total elements of VC_DTH_TOTPT: 0 in 0 pages\n",
      "Total elements of VC_DTH_TOTN: 190 in 8 pages\n",
      "Observations  VC_DTH_TOUNN 0\n",
      "Observations  VC_DTH_TOTPT 0\n",
      "Observations  VC_SNS_WALN_DRK 207\n",
      "Observations  VC_DTH_TOTN 190\n",
      "Total elements of VC_VOV_SEXL: 61 in 3 pages\n",
      "Total elements of VC_DTH_TOCVN: 10 in 1 pages\n",
      "Total elements of VC_IHR_PSRCN: 3530 in 142 pages\n",
      "Total elements of VC_DTH_TOTR: 10 in 1 pages\n",
      "Total elements of VC_IHR_PSRC: 2716 in 109 pages\n",
      "Observations  VC_DTH_TOCVN 10\n",
      "Observations  VC_DTH_TOTR 10\n",
      "Observations  VC_VOV_SEXL 61\n",
      "Observations  VC_IHR_PSRC 2716\n",
      "Observations  VC_IHR_PSRCN 3530\n",
      "Total elements of VC_VOV_PHYL: 59 in 3 pages\n",
      "Total elements of VC_VOV_PHY_ASLT: 190 in 8 pages\n",
      "Total elements of VC_VOV_ROBB: 245 in 10 pages\n",
      "Total elements of VC_VOV_PSYCHL: 52 in 3 pages\n",
      "Total elements of VC_VOV_SEX_ASLT: 210 in 9 pages\n",
      "Observations  VC_VOV_PHYL 59\n",
      "Observations  VC_VOV_PSYCHL 52\n",
      "Observations  VC_VOV_PHY_ASLT 190\n",
      "Observations  VC_VOV_SEX_ASLT 210\n",
      "Observations  VC_VOV_ROBB 245\n",
      "Total elements of VC_VAW_PHYPYV: 8 in 1 pages\n",
      "Total elements of VC_VAW_SXVLN: 9 in 1 pages\n",
      "Total elements of VC_HTF_DETVSXR: 1981 in 80 pages\n",
      "Total elements of VC_HTF_DETVFLR: 1826 in 74 pages\n",
      "Total elements of VC_HTF_DETV: 5311 in 213 pages\n",
      "Observations  VC_VAW_PHYPYV 8\n",
      "Observations  VC_VAW_SXVLN 9\n",
      "Observations  VC_HTF_DETVFLR 849\n",
      "Observations  VC_HTF_DETVSXR 1135\n",
      "Observations  VC_HTF_DETV 3629\n",
      "Total elements of VC_HTF_DETVFL: 1826 in 74 pages\n",
      "Total elements of VC_HTF_DETVOGR: 1107 in 45 pages\n",
      "Total elements of VC_HTF_DETVSX: 1981 in 80 pages\n",
      "Total elements of VC_HTF_DETVOPR: 1745 in 70 pages\n",
      "Total elements of VC_HTF_DETVOP: 1745 in 70 pages\n",
      "Observations  VC_HTF_DETVOGR 18\n",
      "Observations  VC_HTF_DETVFL 852\n",
      "Observations  VC_HTF_DETVOP 678\n",
      "Observations  VC_HTF_DETVOPR 676\n",
      "Observations  VC_HTF_DETVSX 1146\n",
      "Total elements of SG_REG_BRTH: 79 in 4 pages\n",
      "Total elements of SG_NHR_CMPLNC: 572 in 23 pages\n",
      "Total elements of SG_NHR_IMPL: 572 in 23 pages\n",
      "Total elements of VC_HTF_DETVOG: 1107 in 45 pages\n",
      "Total elements of VC_HTF_DETVR: 5311 in 213 pages\n",
      "Observations  SG_REG_BRTH 79\n",
      "Observations  SG_NHR_IMPL 572\n",
      "Observations  SG_NHR_CMPLNC 572\n",
      "Observations  VC_HTF_DETVOG 18\n",
      "Observations  VC_HTF_DETVR 3604\n",
      "Total elements of SG_INF_ACCSS: 44 in 2 pages\n",
      "Total elements of VC_VOC_ENFDIS: 0 in 0 pages\n",
      "Total elements of VC_VAW_MTUHRA: 0 in 0 pages\n",
      "Total elements of VC_VOC_ENFDISN: 88 in 4 pages\n",
      "Total elements of VC_VAW_MTUHRAN: 88 in 4 pages\n",
      "Observations  VC_VOC_ENFDIS 0\n",
      "Observations  VC_VAW_MTUHRA 0\n",
      "Observations  SG_INF_ACCSS 44\n",
      "Observations  VC_VOC_ENFDISN 41\n",
      "Observations  VC_VAW_MTUHRAN 42\n",
      "Total elements of IU_COR_BRIB: 115 in 5 pages\n",
      "Total elements of IC_FRM_BRIB: 93 in 4 pages\n",
      "Total elements of GF_XPD_GBPC: 492 in 20 pages\n",
      "Total elements of SP_PSR_SATIS_HLTH: 25 in 1 pages\n",
      "Total elements of SP_PSR_SATIS_PRM: 30 in 2 pages\n",
      "Observations  IC_FRM_BRIB 93\n",
      "Observations  IU_COR_BRIB 115\n",
      "Observations  SP_PSR_SATIS_HLTH 25\n",
      "Observations  SP_PSR_SATIS_PRM 30\n",
      "Observations  GF_XPD_GBPC 492\n",
      "Total elements of SP_PSR_OSATIS_GOV: 141 in 6 pages\n",
      "Total elements of SP_PSR_OSATIS_PRM: 25 in 1 pages\n",
      "Total elements of SP_PSR_OSATIS_SEC: 125 in 5 pages\n",
      "Total elements of SP_PSR_SATIS_SEC: 30 in 2 pages\n",
      "Total elements of SP_PSR_SATIS_GOV: 293 in 12 pages\n",
      "Observations  SP_PSR_OSATIS_PRM 25\n",
      "Observations  SP_PSR_SATIS_SEC 30\n",
      "Observations  SP_PSR_OSATIS_GOV 141\n",
      "Observations  SP_PSR_OSATIS_SEC 125\n",
      "Observations  SP_PSR_SATIS_GOV 293\n",
      "Total elements of SP_PSR_OSATIS_HLTH: 326 in 14 pages\n",
      "Observations  SP_PSR_OSATIS_HLTH 326\n",
      "Collect data : 1.7623663385709127 minutes\n",
      "Data/2.UN_observations/observations16.json created\n",
      "Goal 17\n",
      "Total elements of DT_TDS_DECT: 178 in 8 pages\n",
      "Total elements of TX_IMP_GBMRCH: 1016 in 41 pages\n",
      "Total elements of TX_IMP_GBSVR: 963 in 39 pages\n",
      "Total elements of TX_EXP_GBMRCH: 1016 in 41 pages\n",
      "Total elements of IT_USE_ii99: 2529 in 102 pages\n",
      "Observations  DT_TDS_DECT 178\n",
      "Observations  TX_IMP_GBSVR 963\n",
      "Observations  TX_EXP_GBMRCH 1016\n",
      "Observations  TX_IMP_GBMRCH 1016\n",
      "Observations  IT_USE_ii99 2529\n",
      "Total elements of SG_PLN_MSTKSDG_R: 7 in 1 pages\n",
      "Total elements of SG_PLN_MSTKSDG_P: 23 in 1 pages\n",
      "Total elements of TX_EXP_GBSVR: 960 in 39 pages\n",
      "Total elements of SG_STT_NSDSFDDNR: 312 in 13 pages\n",
      "Total elements of SG_STT_NSDSFND: 312 in 13 pages\n",
      "Observations  SG_PLN_MSTKSDG_R 7\n",
      "Observations  SG_PLN_MSTKSDG_P 23\n",
      "Observations  SG_STT_NSDSFDDNR 42\n",
      "Observations  SG_STT_NSDSFND 237\n",
      "Observations  TX_EXP_GBSVR 960\n",
      "Total elements of SG_STT_NSDSIMPL: 312 in 13 pages\n",
      "Total elements of SG_STT_NSDSFDOTHR: 312 in 13 pages\n",
      "Total elements of SG_STT_FPOS: 312 in 13 pages\n",
      "Total elements of SG_STT_NSDSFDGVT: 312 in 13 pages\n",
      "Total elements of IQ_SPI_PIL4: 376 in 16 pages\n",
      "Observations  IQ_SPI_PIL4 322\n",
      "Observations  SG_STT_NSDSFDGVT 222\n",
      "Observations  SG_STT_FPOS 254\n",
      "Observations  SG_STT_NSDSIMPL 246\n",
      "Observations  SG_STT_NSDSFDOTHR 44\n",
      "Total elements of SG_STT_ODIN: 86 in 4 pages\n",
      "Total elements of IQ_SPI_PIL5: 376 in 16 pages\n",
      "Total elements of BX_TRF_PWKR: 1011 in 41 pages\n",
      "Total elements of SG_CPA_SDEVP: 23 in 1 pages\n",
      "Total elements of DC_OSSD_MPF: 60 in 3 pages\n",
      "Observations  SG_CPA_SDEVP 23\n",
      "Observations  DC_OSSD_MPF 60\n",
      "Observations  SG_STT_ODIN 86\n",
      "Observations  IQ_SPI_PIL5 331\n",
      "Observations  BX_TRF_PWKR 1011\n",
      "Total elements of DC_OSSD_PRVGRT: 46 in 2 pages\n",
      "Total elements of DC_OSSD_OFFNL: 40 in 2 pages\n",
      "Total elements of DC_OSSD_OFFCL: 40 in 2 pages\n",
      "Total elements of DC_OSSD_GRT: 40 in 2 pages\n",
      "Total elements of GF_FRN_FDI: 1286 in 52 pages\n",
      "Observations  DC_OSSD_PRVGRT 46\n",
      "Observations  DC_OSSD_OFFNL 40\n",
      "Observations  DC_OSSD_OFFCL 40\n",
      "Observations  DC_OSSD_GRT 40\n",
      "Observations  GF_FRN_FDI 1286\n",
      "Total elements of SG_PLN_RECNDI: 9 in 1 pages\n",
      "Total elements of SG_PLN_RECRIMON: 9 in 1 pages\n",
      "Total elements of SG_PLN_PRVNDI: 42 in 2 pages\n",
      "Total elements of DC_FTA_TOTAL: 197 in 8 pages\n",
      "Total elements of SG_PLN_PRVRIMON: 42 in 2 pages\n",
      "Observations  SG_PLN_RECNDI 9\n",
      "Observations  SG_PLN_RECRIMON 9\n",
      "Observations  SG_PLN_PRVNDI 42\n",
      "Observations  SG_PLN_PRVRIMON 42\n",
      "Observations  DC_FTA_TOTAL 197\n",
      "Total elements of SG_PLN_RECRICTRY: 9 in 1 pages\n",
      "Total elements of SG_PLN_REPOLRES: 9 in 1 pages\n",
      "Total elements of SG_PLN_PRPOLRES: 42 in 2 pages\n",
      "Total elements of SG_PLN_PRVRICTRY: 42 in 2 pages\n",
      "Total elements of GC_GOB_TAXD: 905 in 37 pages\n",
      "Observations  SG_PLN_RECRICTRY 9\n",
      "Observations  SG_PLN_REPOLRES 9\n",
      "Observations  SG_PLN_PRPOLRES 42\n",
      "Observations  SG_PLN_PRVRICTRY 42\n",
      "Observations  GC_GOB_TAXD 905\n",
      "Total elements of GF_COM_PPPI_KD: 225 in 9 pages\n",
      "Total elements of GF_COM_PPPI: 230 in 10 pages\n",
      "Total elements of FB_BNK_CAPA_ZS: 602 in 25 pages\n",
      "Total elements of GR_G14_GDP: 916 in 37 pages\n",
      "Total elements of GR_G14_XDC: 916 in 37 pages\n",
      "Observations  GF_COM_PPPI 230\n",
      "Observations  GF_COM_PPPI_KD 225\n",
      "Observations  FB_BNK_CAPA_ZS 602\n",
      "Observations  GR_G14_XDC 916\n",
      "Observations  GR_G14_GDP 916\n",
      "Total elements of FM_LBL_BMNY_ZG: 463 in 19 pages\n",
      "Total elements of NE_CON_GOVT_KD_ZG: 958 in 39 pages\n",
      "Total elements of GC_TAX_TOTL_GD_ZS: 883 in 36 pages\n",
      "Total elements of NE_GDI_TOTL_KD_ZG: 958 in 39 pages\n",
      "Total elements of NY_GDP_MKTP_KD_ZG: 1078 in 44 pages\n",
      "Observations  FM_LBL_BMNY_ZG 463\n",
      "Observations  NY_GDP_MKTP_KD_ZG 1078\n",
      "Observations  GC_TAX_TOTL_GD_ZS 883\n",
      "Observations  NE_CON_GOVT_KD_ZG 958\n",
      "Observations  NE_GDI_TOTL_KD_ZG 958\n",
      "Total elements of GC_BAL_CASH_GD_ZS: 880 in 36 pages\n",
      "Total elements of BN_CAB_XOKA_GD_ZS: 956 in 39 pages\n",
      "Total elements of BX_KLT_DINV_WD_GD_ZS: 963 in 39 pages\n",
      "Total elements of DP_DOD_DLD2_CR_CG_Z1: 726 in 30 pages\n",
      "Total elements of FM_LBL_BMNY_IR_ZS: 454 in 19 pages\n",
      "Observations  FM_LBL_BMNY_IR_ZS 454\n",
      "Observations  GC_BAL_CASH_GD_ZS 880\n",
      "Observations  DP_DOD_DLD2_CR_CG_Z1 726\n",
      "Observations  BN_CAB_XOKA_GD_ZS 956\n",
      "Observations  BX_KLT_DINV_WD_GD_ZS 963\n",
      "Total elements of BN_KLT_PTXL_CD: 938 in 38 pages\n",
      "Total elements of FP_CPI_TOTL_ZG: 960 in 39 pages\n",
      "Total elements of NE_IMP_GNFS_KD_ZG: 957 in 39 pages\n",
      "Total elements of NE_EXP_GNFS_KD_ZG: 957 in 39 pages\n",
      "Total elements of PA_NUS_ATLS: 1103 in 45 pages\n",
      "Observations  NE_EXP_GNFS_KD_ZG 957\n",
      "Observations  BN_KLT_PTXL_CD 938\n",
      "Observations  FP_CPI_TOTL_ZG 960\n",
      "Observations  PA_NUS_ATLS 1103\n",
      "Observations  NE_IMP_GNFS_KD_ZG 957\n",
      "Total elements of DT_DOD_DECT_GN_ZS: 186 in 8 pages\n",
      "Total elements of NE_CON_PRVT_KD_ZG: 958 in 39 pages\n",
      "Total elements of FI_RES_TOTL_MO: 940 in 38 pages\n",
      "Total elements of TG_VAL_TOTL_GD_ZS: 975 in 39 pages\n",
      "Total elements of TM_TAX_DPRF: 4448 in 178 pages\n",
      "Observations  DT_DOD_DECT_GN_ZS 186\n",
      "Observations  NE_CON_PRVT_KD_ZG 958\n",
      "Observations  FI_RES_TOTL_MO 940\n",
      "Observations  TG_VAL_TOTL_GD_ZS 975\n",
      "Observations  TM_TAX_DPRF 4448\n",
      "Total elements of DC_ENVTECH_TT: 438 in 18 pages\n",
      "Total elements of TM_TAX_DMFN: 4448 in 178 pages\n",
      "Total elements of SG_CPA_OFDI: 180 in 8 pages\n",
      "Total elements of TM_TAX_WMPS: 834 in 34 pages\n",
      "Total elements of TM_TAX_WMFN: 834 in 34 pages\n",
      "Observations  SG_CPA_OFDI 180\n",
      "Observations  DC_ENVTECH_TT 438\n",
      "Observations  TM_TAX_WMFN 834\n",
      "Observations  TM_TAX_WMPS 834\n",
      "Observations  TM_TAX_DMFN 4448\n",
      "Total elements of DC_ENVTECH_REXP: 55 in 3 pages\n",
      "Total elements of DC_ENVTECH_EXP: 438 in 18 pages\n",
      "Total elements of DC_ENVTECH_RIMP: 107 in 5 pages\n",
      "Total elements of DC_ENVTECH_IMP: 438 in 18 pages\n",
      "Total elements of DC_ENVTECH_INV: 162 in 7 pages\n",
      "Observations  DC_ENVTECH_REXP 55\n",
      "Observations  DC_ENVTECH_RIMP 107\n",
      "Observations  DC_ENVTECH_INV 162\n",
      "Observations  DC_ENVTECH_EXP 438\n",
      "Observations  DC_ENVTECH_IMP 438\n",
      "Total elements of DC_ODA_SIDSG: 689 in 28 pages\n",
      "Total elements of DC_ODA_TOTLGE: 230 in 10 pages\n",
      "Total elements of DC_ODA_TOTG: 511 in 21 pages\n",
      "Total elements of IT_NET_BBNDN: 2904 in 117 pages\n",
      "Total elements of IT_NET_BBND: 2904 in 117 pages\n",
      "Observations  DC_ODA_TOTLGE 230\n",
      "Observations  DC_ODA_TOTG 511\n",
      "Observations  DC_ODA_SIDSG 689\n",
      "Observations  IT_NET_BBND 2904\n",
      "Observations  IT_NET_BBNDN 2904\n",
      "Total elements of DC_ODA_LLDCG: 692 in 28 pages\n",
      "Total elements of DC_ODA_LDCG: 692 in 28 pages\n",
      "Total elements of DC_ODA_TOTGGE: 222 in 9 pages\n",
      "Total elements of DC_ODA_LLDC: 746 in 30 pages\n",
      "Total elements of DC_ODA_LDCS: 746 in 30 pages\n",
      "Observations  DC_ODA_TOTGGE 222\n",
      "Observations  DC_ODA_LDCG 692\n",
      "Observations  DC_ODA_LLDCG 692\n",
      "Observations  DC_ODA_LDCS 746\n",
      "Observations  DC_ODA_LLDC 746\n",
      "Total elements of SG_REG_CENSUS: 0 in 0 pages\n",
      "Total elements of SG_STT_CAPTY: 117 in 5 pages\n",
      "Total elements of SG_REG_CENSUSN: 49 in 2 pages\n",
      "Total elements of DC_ODA_TOTL: 750 in 30 pages\n",
      "Total elements of DC_ODA_SIDS: 743 in 30 pages\n",
      "Observations  SG_REG_CENSUS 0\n",
      "Observations  SG_REG_CENSUSN 49\n",
      "Observations  SG_STT_CAPTY 103\n",
      "Observations  DC_ODA_TOTL 750\n",
      "Observations  DC_ODA_SIDS 743\n",
      "Total elements of SG_REG_BRTH90: 0 in 0 pages\n",
      "Total elements of SG_REG_DETH75: 0 in 0 pages\n",
      "Total elements of SG_REG_DETH75N: 358 in 15 pages\n",
      "Total elements of SG_REG_BRTH90N: 358 in 15 pages\n",
      "Observations  SG_REG_BRTH90 0\n",
      "Observations  SG_REG_DETH75 0\n",
      "Observations  SG_REG_DETH75N 358\n",
      "Observations  SG_REG_BRTH90N 358\n",
      "Collect data : 1.2887897650400797 minutes\n",
      "Data/2.UN_observations/observations17.json created\n"
     ]
    }
   ],
   "source": [
    "for goal in range(1,18):\n",
    "    st = time.time()\n",
    "    print(\"Goal\", str(goal))\n",
    "    params = []\n",
    "    batch_size = 5  # can be changed\n",
    "    series_codes = series_per_goal[str(goal)]\n",
    "\n",
    "    async with aiohttp.ClientSession() as session: \n",
    "        for i in range(0, len(series_codes), batch_size):\n",
    "            batch = series_codes[i:i + batch_size]\n",
    "            tasks = []\n",
    "\n",
    "            for code in batch:\n",
    "                indicator_code = series_to_indicator.get(code)\n",
    "                \n",
    "                async def fetch_with_indicator(s_code=code, i_code=indicator_code):\n",
    "                    obs_list = await get_observations(session, s_code, geocodes)\n",
    "                    for obs in obs_list:\n",
    "                        obs['indicator'] = i_code\n",
    "                    return obs_list\n",
    "\n",
    "                tasks.append(asyncio.ensure_future(fetch_with_indicator()))\n",
    "\n",
    "            batch_result = await asyncio.gather(*tasks)\n",
    "            params.extend(batch_result)\n",
    "\n",
    "    et = time.time()\n",
    "    elapsed_time = et - st  # get the execution time\n",
    "    print('Collect data :', elapsed_time/60, 'minutes')\n",
    "\n",
    "    filename = f\"Data/2.UN_observations/observations{goal}.json\"\n",
    "    with open(filename, \"w\") as outfile:\n",
    "        json.dump(params, outfile, indent=2)\n",
    "    print(filename, \"created\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "API was last accessed at: 2025-09-17 18:12:56.337272\n"
     ]
    }
   ],
   "source": [
    "now = datetime.now()\n",
    "print(\"API was last accessed at:\", now)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import data  to the SustainGraph using the json file per goal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_obs(tx,statement, params):\n",
    "    result = tx.run(statement,parameters={\"parameters\":params})\n",
    "    return result.data()[0]['total']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Goal  1\n",
      "Start importing to neo4j\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "<>:35: SyntaxWarning: invalid escape sequence '\\T'\n",
      "<>:35: SyntaxWarning: invalid escape sequence '\\T'\n",
      "C:\\Users\\Eleftheria\\AppData\\Local\\Temp\\ipykernel_10208\\2382416835.py:35: SyntaxWarning: invalid escape sequence '\\T'\n",
      "  print('\\Total import time: ', total_elapsed/60, 'minutes')\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Import data : 0.487278946240743 minutes\n",
      "Goal  2\n",
      "Start importing to neo4j\n",
      "Import data : 0.39811888535817463 minutes\n",
      "Goal  3\n",
      "Start importing to neo4j\n",
      "Import data : 0.6892135620117188 minutes\n",
      "Goal  4\n",
      "Start importing to neo4j\n",
      "Import data : 1.8750510255495707 minutes\n",
      "Goal  5\n",
      "Start importing to neo4j\n",
      "Import data : 0.16781112353007 minutes\n",
      "Goal  6\n",
      "Start importing to neo4j\n",
      "Import data : 0.4870819807052612 minutes\n",
      "Goal  7\n",
      "Start importing to neo4j\n",
      "Import data : 0.37057942946751915 minutes\n",
      "Goal  8\n",
      "Start importing to neo4j\n",
      "Import data : 2.437811227639516 minutes\n",
      "Goal  9\n",
      "Start importing to neo4j\n",
      "Import data : 0.24255380630493165 minutes\n",
      "Goal  10\n",
      "Start importing to neo4j\n",
      "Import data : 0.5163045287132263 minutes\n",
      "Goal  11\n",
      "Start importing to neo4j\n",
      "Import data : 0.4132896264394124 minutes\n",
      "Goal  12\n",
      "Start importing to neo4j\n",
      "Import data : 2.356424033641815 minutes\n",
      "Goal  13\n",
      "Start importing to neo4j\n",
      "Import data : 0.20491911172866822 minutes\n",
      "Goal  14\n",
      "Start importing to neo4j\n",
      "Import data : 0.201362939675649 minutes\n",
      "Goal  15\n",
      "Start importing to neo4j\n",
      "Import data : 0.5361886421839396 minutes\n",
      "Goal  16\n",
      "Start importing to neo4j\n",
      "Import data : 0.8667204658190409 minutes\n",
      "Goal  17\n",
      "Start importing to neo4j\n",
      "Import data : 1.0440929770469665 minutes\n",
      "\\Total import time:  13.35949825445811 minutes\n"
     ]
    }
   ],
   "source": [
    "statement = \"\"\" \n",
    "    UNWIND $parameters as row\n",
    "    MATCH (ga:GeoArea),(s:Series{code:row.s_code})\n",
    "    WHERE row.geo = ga.M49code\n",
    "    MATCH (src:Source{name:'UN_SDG'})-[:COMES_FROM]-(i:Indicator)-[:HAS_SERIES]->(s)\n",
    "    MERGE (s)-[:HAS_METADATA]->(sm:SeriesMetadata{attributesCode:row.att_codes,attributesDescription:row.att_desc,\n",
    "                            dimensionsCode:row.dim_codes,dimensionsDescription:row.dim_desc,seriesCode:row.s_code})\n",
    "    MERGE (sm)-[:HAS_OBSERVATION{attributesCode:row.att_codes,dimensionsCode:row.dim_codes,\n",
    "                                seriesCode:row.s_code,time:date(row.year),\n",
    "                                geoCode:row.geo}]->(o:Observation{time:date(row.year)})\n",
    "    SET o.value = toFloat(row.value)\n",
    "    MERGE (o)-[:REFERS_TO_AREA]->(ga)\n",
    "    MERGE (i) -[:HAS_OBSERVATIONS]->(ga)\n",
    "    RETURN COUNT(DISTINCT o) as total\n",
    "\"\"\"\n",
    "\n",
    "total_start = time.time()\n",
    "\n",
    "for goal in range(1,18):\n",
    "    print(\"Goal \", goal)\n",
    "    f = open(os.getcwd()+'\\\\Data\\\\2.UN_observations\\\\observations'+str(goal)+'.json')\n",
    "    dataToImport = json.load(f)\n",
    "    print(\"Start importing to neo4j\")\n",
    "    st = time.time()\n",
    "    with driver.session(database=database_name) as session:\n",
    "        for p in dataToImport:\n",
    "            results = session.execute_write(write_obs,statement, p)\n",
    "            et = time.time()\n",
    "\n",
    "    elapsed_time = et - st\n",
    "    print('Import data :', elapsed_time/60, 'minutes')\n",
    "\n",
    "total_end = time.time()\n",
    "total_elapsed = total_end - total_start\n",
    "print('Total import time: ', total_elapsed/60, 'minutes')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Checking for observations that weren't imported properly to the graph ('mismatches' between graph and json files from UN database)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement = \"\"\"\n",
    "UNWIND $parameters AS row\n",
    "MATCH (sm:SeriesMetadata {\n",
    "    attributesCode: row.att_codes,\n",
    "    dimensionsCode: row.dim_codes,\n",
    "    seriesCode: row.s_code\n",
    "})-[:HAS_OBSERVATION {\n",
    "    attributesCode: row.att_codes,\n",
    "    dimensionsCode: row.dim_codes,\n",
    "    seriesCode: row.s_code,\n",
    "    geoCode: row.geo,\n",
    "    time: date(row.year)\n",
    "}]->(o:Observation)\n",
    "RETURN count((o)) AS total\n",
    "\"\"\"\n",
    "\n",
    "check_data_un = []\n",
    "\n",
    "for goal in range(1, 18):\n",
    "    with open(os.path.join(os.getcwd()+'\\\\Data\\\\2.UN_observations\\\\observations'+str(goal)+'.json')) as f:\n",
    "        dataToImport = json.load(f)\n",
    "\n",
    "    with driver.session(database=database_name) as session:\n",
    "        for p in dataToImport:\n",
    "            expected_count = len(p)\n",
    "            results = session.execute_write(write_obs, statement, p)\n",
    "\n",
    "            if (len(p)!=0): #not empty observations\n",
    "                first_entry = p[0]\n",
    "                s_code = first_entry['s_code']\n",
    "                att_code = first_entry['att_codes']\n",
    "                dim_code = first_entry['dim_codes']\n",
    "                indicator_code = first_entry[\"indicator\"]\n",
    "\n",
    "                check_data_un.append({\n",
    "                    \"indicator\": indicator_code,\n",
    "                    \"series\": s_code,\n",
    "                    \"dim_code\": dim_code,\n",
    "                    \"att_code\": att_code,\n",
    "                    \"seriesmetadata\": f\"{dim_code}|{att_code}\",\n",
    "                    \"to_import\": expected_count,\n",
    "                    \"imported\": results\n",
    "                })\n",
    "\n",
    "check_df_un = pd.DataFrame(check_data_un)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>indicator</th>\n",
       "      <th>series</th>\n",
       "      <th>dim_code</th>\n",
       "      <th>att_code</th>\n",
       "      <th>seriesmetadata</th>\n",
       "      <th>to_import</th>\n",
       "      <th>imported</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1.3.1</td>\n",
       "      <td>SI_COV_WKINJRY</td>\n",
       "      <td>15+|BOTHSEX|G</td>\n",
       "      <td>E|PERCENT|A</td>\n",
       "      <td>15+|BOTHSEX|G|E|PERCENT|A</td>\n",
       "      <td>152</td>\n",
       "      <td>152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1.3.1</td>\n",
       "      <td>SI_COV_CHLD</td>\n",
       "      <td>&lt;15Y|BOTHSEX|G</td>\n",
       "      <td>E|PERCENT|A</td>\n",
       "      <td>&lt;15Y|BOTHSEX|G|E|PERCENT|A</td>\n",
       "      <td>277</td>\n",
       "      <td>277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1.3.1</td>\n",
       "      <td>SI_COV_MATNL</td>\n",
       "      <td>15-49|FEMALE|G</td>\n",
       "      <td>E|PERCENT|A</td>\n",
       "      <td>15-49|FEMALE|G|E|PERCENT|A</td>\n",
       "      <td>135</td>\n",
       "      <td>135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1.3.1</td>\n",
       "      <td>SI_COV_SOCINS</td>\n",
       "      <td>G|_T</td>\n",
       "      <td>CA|PERCENT</td>\n",
       "      <td>G|_T|CA|PERCENT</td>\n",
       "      <td>160</td>\n",
       "      <td>160</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1.3.1</td>\n",
       "      <td>SI_COV_DISAB</td>\n",
       "      <td>BOTHSEX|G</td>\n",
       "      <td>E|PERCENT|A</td>\n",
       "      <td>BOTHSEX|G|E|PERCENT|A</td>\n",
       "      <td>587</td>\n",
       "      <td>587</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>688</th>\n",
       "      <td>17.2.1</td>\n",
       "      <td>DC_ODA_SIDS</td>\n",
       "      <td>G</td>\n",
       "      <td>C|CON_USD_M</td>\n",
       "      <td>G|C|CON_USD_M</td>\n",
       "      <td>743</td>\n",
       "      <td>743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>689</th>\n",
       "      <td>17.19.1</td>\n",
       "      <td>SG_STT_CAPTY</td>\n",
       "      <td>G</td>\n",
       "      <td>G|CU_USD</td>\n",
       "      <td>G|G|CU_USD</td>\n",
       "      <td>103</td>\n",
       "      <td>103</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>690</th>\n",
       "      <td>17.19.2</td>\n",
       "      <td>SG_REG_CENSUSN</td>\n",
       "      <td>G</td>\n",
       "      <td>C|NUMBER</td>\n",
       "      <td>G|C|NUMBER</td>\n",
       "      <td>49</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>691</th>\n",
       "      <td>17.19.2</td>\n",
       "      <td>SG_REG_DETH75N</td>\n",
       "      <td>G</td>\n",
       "      <td>C|NUMBER</td>\n",
       "      <td>G|C|NUMBER</td>\n",
       "      <td>358</td>\n",
       "      <td>358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>692</th>\n",
       "      <td>17.19.2</td>\n",
       "      <td>SG_REG_BRTH90N</td>\n",
       "      <td>G</td>\n",
       "      <td>C|NUMBER</td>\n",
       "      <td>G|C|NUMBER</td>\n",
       "      <td>358</td>\n",
       "      <td>358</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>693 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    indicator          series        dim_code     att_code  \\\n",
       "0       1.3.1  SI_COV_WKINJRY   15+|BOTHSEX|G  E|PERCENT|A   \n",
       "1       1.3.1     SI_COV_CHLD  <15Y|BOTHSEX|G  E|PERCENT|A   \n",
       "2       1.3.1    SI_COV_MATNL  15-49|FEMALE|G  E|PERCENT|A   \n",
       "3       1.3.1   SI_COV_SOCINS            G|_T   CA|PERCENT   \n",
       "4       1.3.1    SI_COV_DISAB       BOTHSEX|G  E|PERCENT|A   \n",
       "..        ...             ...             ...          ...   \n",
       "688    17.2.1     DC_ODA_SIDS               G  C|CON_USD_M   \n",
       "689   17.19.1    SG_STT_CAPTY               G     G|CU_USD   \n",
       "690   17.19.2  SG_REG_CENSUSN               G     C|NUMBER   \n",
       "691   17.19.2  SG_REG_DETH75N               G     C|NUMBER   \n",
       "692   17.19.2  SG_REG_BRTH90N               G     C|NUMBER   \n",
       "\n",
       "                 seriesmetadata  to_import  imported  \n",
       "0     15+|BOTHSEX|G|E|PERCENT|A        152       152  \n",
       "1    <15Y|BOTHSEX|G|E|PERCENT|A        277       277  \n",
       "2    15-49|FEMALE|G|E|PERCENT|A        135       135  \n",
       "3               G|_T|CA|PERCENT        160       160  \n",
       "4         BOTHSEX|G|E|PERCENT|A        587       587  \n",
       "..                          ...        ...       ...  \n",
       "688               G|C|CON_USD_M        743       743  \n",
       "689                  G|G|CU_USD        103       103  \n",
       "690                  G|C|NUMBER         49        49  \n",
       "691                  G|C|NUMBER        358       358  \n",
       "692                  G|C|NUMBER        358       358  \n",
       "\n",
       "[693 rows x 7 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "check_df_un"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total UN SDG observations imported in SustainGraph  834104 , expected: 834104\n",
      "Mismatches: 0\n"
     ]
    }
   ],
   "source": [
    "total_observations_imported = check_df_un['imported'].sum()\n",
    "total_observations_to_import = check_df_un['to_import'].sum()\n",
    "print(\"Total UN SDG observations imported in SustainGraph\", total_observations_imported, \", expected:\",total_observations_to_import)\n",
    "\n",
    "mismatches = check_df_un[check_df_un['to_import'] != check_df_un['imported']]\n",
    "if len(mismatches)==0:\n",
    "    print(\"Mismatches: 0\")\n",
    "else:\n",
    "    print(\"\\nMismatches:\\n\", mismatches)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
