{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "# print(sys.executable)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import eurostat\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "import neo4j\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import time\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path\n",
    "from functions import preprocessing_eurostat_data,import_sm_obs\n",
    "from PyPDF2 import PdfReader\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to neo4j\n"
     ]
    }
   ],
   "source": [
    "#load the environment variables\n",
    "dotenv_path = Path('~/.env')\n",
    "load_dotenv(dotenv_path=dotenv_path)  # This line brings all environment variables from .env into os.environ\n",
    "\n",
    "# Get variables\n",
    "SUSTAINGRAPH_URI = os.getenv('SUSTAINGRAPH_URI')\n",
    "SUSTAINGRAPH_USER = os.getenv('SUSTAINGRAPH_USER')\n",
    "SUSTAINGRAPH_PASSWORD = os.getenv('SUSTAINGRAPH_PASSWORD')\n",
    "database_name = os.getenv('DATABASE_NAME')\n",
    "\n",
    "# Connect to database\n",
    "driver = GraphDatabase.driver(SUSTAINGRAPH_URI, auth=(SUSTAINGRAPH_USER, SUSTAINGRAPH_PASSWORD))\n",
    "\n",
    "# Verify connectivity\n",
    "with driver.session(database=database_name) as session:\n",
    "    print(session.run(\"RETURN 'Connected to ' + $db\", db=database_name).single()[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Add the year\n",
    "year='2025'\n",
    "\n",
    "df_eu = pd.read_excel('Data/3.EU_SDGs/3.EU_Indicator_MPI_PolicyTarget.xlsx', sheet_name='eu_sdg')\n",
    "df_pt = pd.read_excel('Data/3.EU_SDGs/3.EU_Indicator_MPI_PolicyTarget.xlsx',sheet_name ='policy_target')\n",
    "df_eu_un = pd.read_excel('Data/3.EU_SDGs/3.EU_Indicator_MPI_PolicyTarget.xlsx',sheet_name ='eu_un')\n",
    "df_mpi = pd.read_excel('Data/3.EU_SDGs/3.EU_Indicator_MPI_PolicyTarget.xlsx',sheet_name ='mpi')\n",
    "\n",
    "\n",
    "# Get all the codes in the Eurostat database\n",
    "toc_df = eurostat.get_toc_df()\n",
    "toc_df = toc_df.map(lambda x: str(x).lower())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_eu_indicators(tx,statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)\n",
    "\n",
    "def write_batch(tx,statement, params_list):\n",
    "    tx.run(statement, parameters={\"parameters\": params_list})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Eurostat](https://ec.europa.eu/eurostat/web/sdi) is called to regularly monitor progress towards the SDGs in an EU context. For this purpose it coordinated the development of the EU SDG indicator set and keeps it up to date. It also produces regular monitoring reports on progress towards the SDGs in an EU context."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Create EU_SDG Source node\n",
    "\n",
    "Before importing the Eurostat data, the Source node with property name: \"EU_SDG\" is created and all the European SDG indicators will be connected with this node through the relationship 'COMES_FROM'."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created 1 nodes in 17 ms.\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "        MERGE (s:Source{name:'EU_SDG'})\n",
    "        RETURN count(s) as Source_Data\n",
    "        \"\"\",\n",
    "        database_=database_name)\n",
    "print(\"Created {nodes_created} nodes in {time} ms.\".format(\n",
    "    nodes_created=summary.counters.nodes_created,\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import EU_SDG indicators, series, policy targets, association with UN_SDG indicators\n",
    "\n",
    "At first, we create the EU_SDG Indicators with their respective series, policy targets and the association with the UN indicators. Then, we create the indicators coming from the European Union regarding the SDGs. There are EU_SDG indicators which are part of EU_SDG indicators.\n",
    "For this reason, we create the relationship (Indicator)-[:ASSOCIATED_WITH {relevance:'part of',dateOfReport:date($report_date)}]->(Indicator).Regarding the Series nodes, each EU_SDG Indicator has the one Series node with relavant properties with the Indicator node, in aligment with the schema of the SustainGraph."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Details regarding EU SDG Indicators, Policy Targets, Multi-Purpose Indicators (MPIs) and the association between EU and UN goals can be found in the '3.EU_Indicator_MPI_PolicyTarget' excel file. \n",
    "\n",
    "Explanatory comments regarding the file:\n",
    "- *summary sheet*: explanatory comments\n",
    "- *policy target sheet*:\n",
    "    -  EU_ind: EU SDG Indicator code\n",
    "    -  Value: absolute value to which the policy target refers \n",
    "    -  Unit: unit of measurement to which the value refers (percent, million)\n",
    "    -  Operator: comparative/arithmetic operator to which the policy target refers (greater than or equal to, less than or equal to, reduce by)\n",
    "    -  Year: goal year to which the policy target refers\n",
    "    -  Reference: publication to which the policy target refers \n",
    "    -  Comments: relevant comments as published in the Eurostat database\n",
    "- *mpi sheet*:\n",
    "    -  eu_sdg: EU SDG Indicator code\n",
    "    -  goal_code: Goal to which the EU SDG Indicator code is a multi-purpose indicator\n",
    "    -  DateOfReport: date of the latest report\n",
    "    -  Comments: relevant comments (detailed explanation found in *summary* sheet)\n",
    "- *eu_un sheet*:\n",
    "    -  eu_sdg: EU SDG Indicator code\n",
    "    -  un_sdg: corresponding UN SDG Indicator code \n",
    "    -  association: type of association between the two indicator codes (identical to, similar to, part of, not available)\n",
    "- *eu_sdg sheet*:\n",
    "    -  Goal: EU SDG Goal\n",
    "    -  Indicator_Code: EU SDG Indicator code corresponding to each Goal\n",
    "    -  Part_of: whether the EU SDG Indicator is part of another EU SDG Indicator (relevance:'part of' in the ASSOCIATED_WITH) relationship\n",
    "    -  DateOfReport: date of the latest report\n",
    "    -  Comments: relevant comments (detailed explanation found in *summary* sheet)\n",
    "\n",
    "\n",
    "The final graph schema is provided below:\n",
    "![Alt text](wiki/SustainGraph-Indicators.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of EU SDG Indicators to be imported: 109\n"
     ]
    }
   ],
   "source": [
    "# Merge the two dataframes \n",
    "df = pd.merge(df_eu,toc_df, how='left', left_on='Indicator_Code', right_on='code')\n",
    "print(\"Number of EU SDG Indicators to be imported:\", len(df))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7 EU Indicators imported as part of the EU Indicators, expected: 7\n"
     ]
    }
   ],
   "source": [
    "parent_statement= \"\"\"\n",
    "    MATCH(pi:Indicator{code:$parent_ind}), (i:Indicator{code:$ind})\n",
    "    MERGE (i)-[:ASSOCIATED_WITH{relevance:'part of',dateOfReport:date($report_date)}]->(pi)\n",
    "\"\"\"\n",
    "statement_eu_ind = \"\"\"\n",
    "    MATCH (g:Goal{code:$goal}),(so:Source{name:'EU_SDG'})\n",
    "    MERGE (i:Indicator{code:$ind,description:$desc})\n",
    "    MERGE (s:Series{code:$ind,description:$desc,\n",
    "                    dataProviderURL:\"https://ec.europa.eu/eurostat/web/sdi/database\"})\n",
    "    MERGE (g)-[:HAS_INDICATOR]->(i)\n",
    "    MERGE (i)-[:HAS_SERIES]->(s)\n",
    "    MERGE (i)-[:COMES_FROM]->(so)    \n",
    "    RETURN *\n",
    "\"\"\"\n",
    "\n",
    "i = 0\n",
    "with driver.session(database=database_name) as session:\n",
    "    for index,row in df.iterrows(): \n",
    "        session.execute_write(write_eu_indicators, \n",
    "                            params_dict = {\n",
    "                                'goal': str(row.Goal), \n",
    "                                'desc': str(row.title),\n",
    "                                'ind': str(row.Indicator_Code),\n",
    "                                'parent_ind': row.Part_of\n",
    "                            },\n",
    "                            statement = statement_eu_ind)  \n",
    "        if (pd.notna(row.Part_of)):\n",
    "            i +=1\n",
    "            session.execute_write(write_eu_indicators, \n",
    "                            params_dict = { \n",
    "                                'ind': str(row.Indicator_Code),\n",
    "                                'parent_ind': row.Part_of,\n",
    "                                'report_date':str(row['DateOfReport'])\n",
    "                                },\n",
    "                            statement = parent_statement)\n",
    "expected = df_eu['Part_of'].notna().sum()\n",
    "print('{} EU Indicators imported as part of the EU Indicators,'.format(i), 'expected:', expected) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Policy Targets\n",
    "The Policy Targets are collected from the annual \"EU SDG Indicator set\" report  by Eurostat. Policy targets from earlier years are maintained in the SustainGraph, unless there are confilcts or refer to outdated indicators\n",
    "\n",
    "### MPI Indicators\n",
    "According to the EU Indicator Set, provided by the European Union each year, a set of indicators 33 of the 101 indicators are multipurpose, meaning they are used to monitor more than one SDG.\n",
    "\n",
    "### Association with UN\n",
    "The EU SDG indicator set is aligned where appropriate with the UN list of global indicators. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Constraints\n",
    "\n",
    "> Property types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_constraint(tx,statement):\n",
    "    tx.run(statement)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "statement_pt_value = \"\"\" \n",
    "CREATE CONSTRAINT pt_value IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.value :: FLOAT\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_unit = \"\"\" \n",
    "CREATE CONSTRAINT pt_unit IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.unit :: STRING\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_operator = \"\"\" \n",
    "CREATE CONSTRAINT pt_operator IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.operator :: STRING\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_year = \"\"\" \n",
    "CREATE CONSTRAINT pt_year IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.byYear :: INTEGER\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_ref = \"\"\" \n",
    "CREATE CONSTRAINT pt_ref IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.reference :: STRING\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_comment = \"\"\" \n",
    "CREATE CONSTRAINT pt_comment IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.comment :: STRING\n",
    "\"\"\"\n",
    "\n",
    "statement_pt_date = \"\"\" \n",
    "CREATE CONSTRAINT pt_date IF NOT EXISTS\n",
    "FOR (pt:EUPolicyTarget) REQUIRE pt.dateOfReport :: DATE\n",
    "\"\"\"\n",
    "\n",
    "statement_mpi=\"\"\"\n",
    "CREATE CONSTRAINT is_mpi IF NOT EXISTS\n",
    "FOR ()-[mpi:IS_MPI_TO]-() REQUIRE mpi.date IS TYPED DATE\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "statements = [statement_pt_comment,statement_pt_date,statement_pt_operator,statement_pt_unit,statement_pt_ref,\n",
    "              statement_pt_unit,statement_pt_value,statement_pt_year,statement_mpi]\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    for statement in statements:\n",
    "        session.execute_write(create_constraint, statement)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Import the data "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Policy Targets\n",
    "statement_eu_policy_target = \"\"\"\n",
    "        MATCH (i:Indicator{code:$ind_code})\n",
    "        MERGE (i)-[:HAS_POLICY_TARGET]->(pt:EUPolicyTarget{value:$val,unit:$un,operator:$oper,byYear:$year,\n",
    "        reference:$ref,comment:$comm,dateOfReport:date($report_date)})\n",
    "    \"\"\" \n",
    "\n",
    "## MPIs\n",
    "statement_mpi = \"\"\" \n",
    "            MATCH (g:Goal{code:$goal_code})\n",
    "            MATCH (i:Indicator{code:$ind_code})\n",
    "            MERGE (i)-[:IS_MPI_TO{dateOfReport:date($report_date)}]->(g)\n",
    "        \"\"\" \n",
    "\n",
    "## UN SDG Indicators\n",
    "statement_eu_un = \"\"\" \n",
    "            MATCH (i1:Indicator{code:$eu_code})\n",
    "            MATCH (i2:Indicator{code:$un_code})\n",
    "            MERGE (i1)-[:ASSOCIATED_WITH{relevance:$association,dateOfReport:date($report_date)}]->(i2)\n",
    "        \"\"\" \n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    # EU_PolicyTargets\n",
    "    for index, row in df_pt.iterrows():\n",
    "        session.execute_write(write_eu_indicators, \n",
    "                                params_dict = {\n",
    "                                    'ind_code':str(row['EU_ind']),\n",
    "                                    'val':float(row['Value']),\n",
    "                                    'un':str(row['Unit']),\n",
    "                                    'oper':str(row['Operator']),\n",
    "                                    'year':int(row['Year']),\n",
    "                                    'ref':str(row['Reference']),\n",
    "                                    'comm':str(row['Comments']),\n",
    "                                    'report_date':str(row['DateOfReport'])},\n",
    "                                statement = statement_eu_policy_target)  \n",
    "    ## MPI\n",
    "    for index, row in df_mpi.iterrows():\n",
    "        session.execute_write(write_eu_indicators, \n",
    "                                params_dict = {\n",
    "                                    'ind_code':str(row['eu_sdg']),\n",
    "                                    'goal_code':str(row['goal_code']),\n",
    "                                    'report_date':str(row['DateOfReport'])},\n",
    "                                statement = statement_mpi)  \n",
    "    ## UN-EU Association\n",
    "    for index, row in df_eu_un.iterrows():\n",
    "        session.execute_write(write_eu_indicators, \n",
    "                                params_dict = {\n",
    "                                    'eu_code':str(row['eu_sdg']),\n",
    "                                    'un_code':str(row['un_sdg']),\n",
    "                                    'association':str(row['association']),\n",
    "                                    'report_date':str(row['DateOfReport'])},\n",
    "                                statement = statement_eu_un)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# specifically for sdg_04_40 which is connected to a policy target\n",
    "# create new dimension code SCI_EF461_READ|A|T_A to average across the other three dimensions, for better aggregated visualisation\n",
    "merge_query = \"\"\"\n",
    "    MATCH (i:Indicator {code: $indicator_code})--(s:Series)\n",
    "    MERGE (newSm:SeriesMetadata {\n",
    "        attributesCode: \"PC\",\n",
    "        dimensionsCode: \"SCI_EF461_READ|A|T_A\",\n",
    "        attributesDescription: \"Percentage\",\n",
    "        dimensionsDescription: \"Science_Math_Reading|Annual|Total_Average\",\n",
    "        seriesCode: $indicator_code\n",
    "    })\n",
    "    MERGE (s)-[:HAS_METADATA]->(newSm)\n",
    "    WITH newSm, s, i\n",
    "    MATCH (s)-[:HAS_METADATA]->(sm:SeriesMetadata)\n",
    "    WHERE sm.dimensionsCode IN [\"SCI|A|T\", \"EF461|A|T\", \"READ|A|T\"]\n",
    "    MATCH (sm)-[r:HAS_OBSERVATION]->(o:Observation)-[:REFERS_TO_AREA]->(ga:GeoArea)\n",
    "    \n",
    "    WITH DISTINCT newSm, i, o.time as time, ga, r.geoCode as geoCode, s\n",
    "    \n",
    "    // average for specific geo-time combination for each observation\n",
    "    MATCH (s)-[:HAS_METADATA]->(sm2:SeriesMetadata)\n",
    "    WHERE sm2.dimensionsCode IN [\"SCI|A|T\", \"EF461|A|T\", \"READ|A|T\"]\n",
    "    MATCH (sm2)-[r2:HAS_OBSERVATION {time: time, geoCode: geoCode}]->(o2:Observation)\n",
    "    \n",
    "    WITH newSm, i, time, ga, geoCode, avg(o2.value) as avgValue\n",
    "    MERGE (newObs:Observation {time: time)\n",
    "    SET newObs.value = avgValue\n",
    "    \n",
    "    MERGE (newSm)-[:HAS_OBSERVATION {\n",
    "        attributesCode: \"PC\",\n",
    "        dimensionsCode: \"SCI_EF461_READ|A|T_A\",\n",
    "        seriesCode: $indicator_code,\n",
    "        time: time,\n",
    "        geoCode: geoCode\n",
    "    }]->(newObs)\n",
    "    MERGE (newObs)-[:REFERS_TO_AREA]->(ga)\n",
    "    MERGE (i)-[:HAS_OBSERVATIONS]->(ga)\n",
    "    \n",
    "    RETURN count(DISTINCT newObs) as mergedObservations\n",
    "    \"\"\"\n",
    "    \n",
    "with driver.session(database=database_name) as session:\n",
    "        result = session.run(merge_query, indicator_code=\"sdg_04_40\")\n",
    "        record = result.single()\n",
    "        merged_count = record[\"mergedObservations\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "109 EU Indicators (expected 109 as of Report 2025) in 1 ms.\n",
      "64 EU Indicators associated with UN indicators (expected 64 as of Report 2025) in 1 ms.\n",
      "35 EU MPIs (expected 35 as of Report 2025) in 1 ms.\n",
      "\n",
      "Total Indicators per goal:\n",
      "   goal  indicators\n",
      "0     1          11\n",
      "1    10          11\n",
      "2    11           9\n",
      "3    12           8\n",
      "4    13           8\n",
      "5    14           6\n",
      "6    15           9\n",
      "7    16           6\n",
      "8    17           6\n",
      "9     2           9\n",
      "10    3          11\n",
      "11    4           7\n",
      "12    5           8\n",
      "13    6           8\n",
      "14    7           7\n",
      "15    8          11\n",
      "16    9           9\n",
      "\n",
      "Total MPIs per goal:\n",
      "   goal  indicators\n",
      "0     1           3\n",
      "1    10           5\n",
      "2    11           3\n",
      "3    12           2\n",
      "4    13           1\n",
      "5    15           3\n",
      "6     2           3\n",
      "7     3           5\n",
      "8     5           2\n",
      "9     6           2\n",
      "10    8           3\n",
      "11    9           3\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)-[r:COMES_FROM]->(s{name:'EU_SDG'}) WHERE i.code CONTAINS \"sdg\" RETURN count(i) as i\n",
    "        \"\"\",routing_=\"r\", database_=database_name)\n",
    "print(\"{nodes_created} EU Indicators (expected {number} as of Report 2025) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['i'],\n",
    "    number=len(df),\n",
    "    time=summary.result_available_after\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (src:Source{name:'EU_SDG'})-[:COMES_FROM]-(eu_i:Indicator)-[a:ASSOCIATED_WITH]-(un_i:Indicator)-[:COMES_FROM]-(src1:Source{name:'UN_SDG'}) \n",
    "        return count(distinct eu_i.code) as i\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{nodes_created} EU Indicators associated with UN indicators (expected {number} as of Report 2025) in {time} ms.\".format(  \n",
    "    nodes_created=records[0]['i'],\n",
    "    number=df_eu_un['eu_sdg'].nunique(),\n",
    "    time=summary.result_available_after\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH(i:Indicator)-[m:IS_MPI_TO]-(g:Goal) return count(m) as i\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{nodes_created} EU MPIs (expected {number} as of Report 2025) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['i'],\n",
    "    number=len(df_mpi),\n",
    "    time=summary.result_available_after\n",
    "))\n",
    "\n",
    "records = driver.execute_query(\"\"\"\\\n",
    "       MATCH (g:Goal)--(i:Indicator)-[r:COMES_FROM]->(s{name:'EU_SDG'}) WHERE i.code CONTAINS \"sdg\" RETURN g.code as goal,count(i) as indicators\n",
    "        \"\"\",routing_=\"r\",database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "print(\"\\nTotal Indicators per goal:\")\n",
    "print(\"{records}\".format(\n",
    "    records=records,\n",
    "))\n",
    "\n",
    "records = driver.execute_query(\"\"\"\\\n",
    "       MATCH (g:Goal)<-[]-(i:Indicator)-[r:COMES_FROM]->(s{name:'EU_SDG'}) RETURN g.code as goal,count(i) as indicators\n",
    "        \"\"\",routing_=\"r\",database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "print(\"\\nTotal MPIs per goal:\")\n",
    "print(\"{records}\".format(\n",
    "    records=records,\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created 250 nodes, expected 250\n"
     ]
    }
   ],
   "source": [
    "# check for sdg_04_40's extra dimension code specifically\n",
    "records = driver.execute_query(\"\"\"\\\n",
    "    MATCH (s:Series)-[:HAS_METADATA]->(sm:SeriesMetadata)\n",
    "    WHERE sm.dimensionsCode IN [\"SCI|A|T\", \"EF461|A|T\", \"READ|A|T\"] AND sm.seriesCode = 'sdg_04_40' //counts the number of unique time-geoCode combinations\n",
    "    MATCH (sm)-[r:HAS_OBSERVATION]->(o:Observation)\n",
    "    WITH DISTINCT r.time as time, r.geoCode as geoCode\n",
    "    WITH count(*) as expectedCount\n",
    "    \n",
    "    MATCH (newSm:SeriesMetadata {dimensionsCode: \"SCI_EF461_READ|A|T_A\", seriesCode: \"sdg_04_40\"})\n",
    "    MATCH (newSm)-[r:HAS_OBSERVATION]->(o:Observation)\n",
    "    \n",
    "    RETURN expectedCount, count(o) as actualCount\n",
    "    \"\"\", routing_=\"r\", database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df\n",
    ")\n",
    "expected = records['expectedCount'].iloc[0]\n",
    "actual = records['actualCount'].iloc[0]\n",
    "\n",
    "print(f\"Created {actual} nodes, expected {expected}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import data from Eurostat Library\n",
    "\n",
    "After that, by using the **preprocessing_eurostat_data** function we read the datasets regarding the EU_SDG indicators and preprocess them in order to get the desired output dataframe, which will be used as input by the function **import_sm_obs** that imports the data in the SustainGraph. \n",
    "\n",
    "The **preprocessing_eurostat_data** function:\n",
    "- Drops NA values\n",
    "- Create new columns about the dimensions and the attributes of each un sdg indicator"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import National data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "        MATCH (r:Region{name:'Europe'})-[:HAS_SUBREGION]->(sr:SubRegion)-[:HAS_AREA]->(a:Area)\n",
    "        MATCH (eu:EuropeanUnion)<-[:BELONGS_TO]-(eua:Area)\n",
    "        WITH COLLECT(DISTINCT a.EUcode)+COLLECT(DISTINCT eua.EUcode) as geocodes\n",
    "        UNWIND geocodes as codes\n",
    "        RETURN COLLECT(DISTINCT codes) as geo\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "available_areas = list(map(str,records[0]['geo']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "codes = ['sdg_08_10','sdg_13_40','sdg_07_40','sdg_06_60','sdg_14_60','sdg_15_20','sdg_14_10']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_vi = df[df.Indicator_Code.isin(codes)].reset_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Indicator code:  sdg_06_60\n",
      "\n",
      "Length of df before removing NA values: 888\n",
      "Length of df after removing NA values: 887\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 816\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "816 observations: Done! (0.003565263748168945 minutes)\n",
      "Time: 0.004731237888336182 minutes\n",
      "\n",
      "Indicator code:  sdg_07_40\n",
      "\n",
      "Length of df before removing NA values: 3276\n",
      "Length of df after removing NA values: 3084\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 2892\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'nrg_bal', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'nrg_bal']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "2892 observations: Done! (0.008904147148132324 minutes)\n",
      "Time: 0.012747430801391601 minutes\n",
      "\n",
      "Indicator code:  sdg_08_10\n",
      "\n",
      "Length of df before removing NA values: 1925\n",
      "Length of df after removing NA values: 1898\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 1698\n",
      "\n",
      "Columns of df: ['unit', 'na_item', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'na_item']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "1698 observations: Done! (0.007029195626576741 minutes)\n",
      "Time: 0.014759365717569988 minutes\n",
      "\n",
      "Indicator code:  sdg_13_40\n",
      "\n",
      "Length of df before removing NA values: 7020\n",
      "Length of df after removing NA values: 4721\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 4360\n",
      "\n",
      "Columns of df: ['statinfo', 'unit', 'freq', 'geo', 'stk_flow', 'time', 'value']\n",
      "Dimension columns: ['freq', 'statinfo', 'stk_flow']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "4360 observations: Done! (0.01555338700612386 minutes)\n",
      "Time: 0.025073150793711346 minutes\n",
      "\n",
      "Indicator code:  sdg_14_10\n",
      "\n",
      "Length of df before removing NA values: 336\n",
      "Length of df after removing NA values: 276\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 264\n",
      "\n",
      "Columns of df: ['geo', 'freq', 'unit', 'areaprot', 'time', 'value']\n",
      "Dimension columns: ['areaprot', 'freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "264 observations: Done! (0.00166168212890625 minutes)\n",
      "Time: 0.003343820571899414 minutes\n",
      "\n",
      "Indicator code:  sdg_14_60\n",
      "\n",
      "Length of df before removing NA values: 1550\n",
      "Length of df after removing NA values: 1300\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 1250\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'indic_env', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'indic_env']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "1250 observations: Done! (0.0033692240715026854 minutes)\n",
      "Time: 0.005119971434275309 minutes\n",
      "\n",
      "Indicator code:  sdg_15_20\n",
      "\n",
      "Length of df before removing NA values: 728\n",
      "Length of df after removing NA values: 728\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 702\n",
      "\n",
      "Columns of df: ['geo', 'freq', 'unit', 'areaprot', 'time', 'value']\n",
      "Dimension columns: ['areaprot', 'freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "\n",
      "702 observations: Done! (0.0035199562708536783 minutes)\n",
      "Time: 0.005861024061838786 minutes\n",
      "Total execution time: 0.868543024857839 minutes\n"
     ]
    }
   ],
   "source": [
    "batch = 5000\n",
    "isNUTS = False\n",
    "\n",
    "# get the start time\n",
    "st1 = time.time()\n",
    "\n",
    "total_number_of_observations = 0\n",
    "observations_per_indicator = {} \n",
    "series_metadata_expected = []\n",
    "\n",
    "for index,row in df_vi.iterrows():   \n",
    "    # preprocess eusgd indicators data\n",
    "    df_eucode = preprocessing_eurostat_data(row.code,available_geoCodes = available_areas,is_local_level=isNUTS,filtering_params=None)\n",
    "\n",
    "    if df_eucode is not None: \n",
    "\n",
    "        obs_count = len(df_eucode)\n",
    "        total_number_of_observations += obs_count \n",
    "        observations_per_indicator[row.code] = obs_count \n",
    "\n",
    "        for _, r in df_eucode.iterrows():  \n",
    "            series_metadata_expected.append({\n",
    "                'indicator': row.code,\n",
    "                'dim_code': r['dim_codes'],\n",
    "                'att_code': r['att_codes']\n",
    "            })\n",
    "        \n",
    "        st = time.time()\n",
    "\n",
    "        print()\n",
    "        # import data in the SustainGraph\n",
    "        import_sm_obs(df_eucode,row.code,batch_size=batch,driver=driver,geoEUcode=True)\n",
    "\n",
    "        # get the end time\n",
    "        et = time.time()\n",
    "\n",
    "        # get the execution time\n",
    "        elapsed_time = et - st\n",
    "        print('Time:', elapsed_time/60, 'minutes')\n",
    "    \n",
    "    if df_eucode is None:\n",
    "        observations_per_indicator[row.code] = 0\n",
    "        \n",
    "# get the end time\n",
    "et1 = time.time()\n",
    "\n",
    "# get the execution time\n",
    "elapsed_time_total = et1 - st1\n",
    "print('Total execution time:', elapsed_time_total/60, 'minutes')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EU SDG Indicators by Eurostat: 109\n",
      "EU SDG Indicators with series information in the graph: 101\n",
      "EU SDG Indicators with no series information in the graph: 8 , listed:\n",
      "sdg_14_51\n",
      "sdg_13_70\n",
      "sdg_12_10\n",
      "sdg_10_20\n",
      "sdg_14_30\n",
      "sdg_15_60\n",
      "sdg_14_21\n",
      "sdg_15_61\n"
     ]
    }
   ],
   "source": [
    "records = driver.execute_query(\"\"\"\\\n",
    "       MATCH (so:Source{name:'EU_SDG'})<-[:COMES_FROM]-(i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:Area)\n",
    "       RETURN s.code as indicator, COUNT(DISTINCT o) as observations\n",
    "       order by indicator\n",
    "        \"\"\",routing_=\"r\",database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "records\n",
    "\n",
    "set_eu = set(df_eu['Indicator_Code'])\n",
    "set_graph = set(records['indicator'])\n",
    "exempt_from_graph = set_eu - set_graph \n",
    "\n",
    "print(\"EU SDG Indicators by Eurostat:\", len(df_eu))\n",
    "print(\"EU SDG Indicators with series information in the graph:\", len(records))\n",
    "print(\"EU SDG Indicators with no series information in the graph:\", len(exempt_from_graph), \", listed:\")\n",
    "for i in exempt_from_graph:\n",
    "    print(i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Checking for EU SDG Indicator observations that weren't imported properly to the graph ('mismatches' between graph and Eurostat database)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# checking for data that weren't imported correctly to the graph for each EU SDG Indicator per series metadata from Eurostat database, labeled 'mismatches'\n",
    "check_statement = \"\"\" \n",
    "UNWIND $parameters AS row\n",
    "MATCH (so:Source{name:'EU_SDG'})<-[:COMES_FROM]-(i:Indicator {code: row.code})\n",
    "      --(s:Series)--(sm:SeriesMetadata)--(o:Observation)\n",
    "WHERE i.code CONTAINS \"sdg\"\n",
    "RETURN i.code AS indicator, \n",
    "       s.code AS series_code,\n",
    "       sm.dimensionsCode AS dim_code, \n",
    "       sm.attributesCode AS att_code, \n",
    "       count(distinct o) AS imported\n",
    "\"\"\"\n",
    "\n",
    "check_results = []\n",
    "\n",
    "for indicator in df['code'].unique():\n",
    "    records, summary, keys = driver.execute_query(\n",
    "        check_statement,\n",
    "        parameters={\"code\": indicator},\n",
    "        database_=database_name,\n",
    "        routing_=\"r\"\n",
    "    )\n",
    "    for r in records: \n",
    "        check_results.append({\n",
    "            \"indicator\": r[\"indicator\"],\n",
    "            \"series\": r[\"series_code\"],\n",
    "            \"dim_code\": r[\"dim_code\"],\n",
    "            \"att_code\": r[\"att_code\"],\n",
    "            \"series metadata\": f\"{r['dim_code']}|{r['att_code']}\",\n",
    "            \"imported\": r[\"imported\"]\n",
    "        })\n",
    "\n",
    "expected_df = pd.DataFrame(series_metadata_expected)\n",
    "expected_grouped = expected_df.groupby( #group expected counts per (indicator), (dim_code, att_code)->series metadata\n",
    "    ['indicator', 'dim_code', 'att_code']\n",
    ").size().reset_index(name='to_import')\n",
    "\n",
    "actual_df = pd.DataFrame(check_results)\n",
    "actual_df['series metadata'] = actual_df['dim_code'] + \"|\" + actual_df['att_code']\n",
    "\n",
    "# merge dataframes\n",
    "check_final_df = pd.merge(\n",
    "    expected_grouped,\n",
    "    actual_df,\n",
    "    on=['indicator', 'dim_code', 'att_code'],\n",
    "    how='outer'\n",
    ").fillna(0)\n",
    "check_final_df = check_final_df[\n",
    "    [\"indicator\", \"series\", \"dim_code\", \"att_code\", \"series metadata\", \"to_import\", \"imported\"]\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "143932 observations imported in total to SustainGraph, expected: 143932\n"
     ]
    }
   ],
   "source": [
    "records = driver.execute_query(\"\"\"\\\n",
    "    MATCH (so:Source{name:'EU_SDG'})<-[:COMES_FROM]-(i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:Area)\n",
    "    WHERE i.code CONTAINS \"sdg\"\n",
    "    RETURN count(distinct o) as observations\n",
    "        \"\"\",routing_=\"r\",database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "print('{} observations imported in total to SustainGraph,'.format(records['observations'][0]), \"expected:\", total_number_of_observations) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Mismatches: 0\n"
     ]
    }
   ],
   "source": [
    "mismatches = check_final_df[check_final_df['to_import'] != check_final_df['imported']]\n",
    "if len(mismatches)==0:\n",
    "    print(\"Mismatches: 0\")\n",
    "else:\n",
    "    print(\"\\nMismatches:\\n\", mismatches)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>indicator</th>\n",
       "      <th>series</th>\n",
       "      <th>dim_code</th>\n",
       "      <th>att_code</th>\n",
       "      <th>series metadata</th>\n",
       "      <th>to_import</th>\n",
       "      <th>imported</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>TOTAL|A</td>\n",
       "      <td>PC</td>\n",
       "      <td>TOTAL|A|PC</td>\n",
       "      <td>320</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>TOTAL|A</td>\n",
       "      <td>THS_PER</td>\n",
       "      <td>TOTAL|A|THS_PER</td>\n",
       "      <td>320</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>Y_LT18|A</td>\n",
       "      <td>PC</td>\n",
       "      <td>Y_LT18|A|PC</td>\n",
       "      <td>320</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>Y_LT18|A</td>\n",
       "      <td>THS_PER</td>\n",
       "      <td>Y_LT18|A|THS_PER</td>\n",
       "      <td>320</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>sdg_01_10a</td>\n",
       "      <td>sdg_01_10a</td>\n",
       "      <td>DEG1|A</td>\n",
       "      <td>PC</td>\n",
       "      <td>DEG1|A|PC</td>\n",
       "      <td>322</td>\n",
       "      <td>322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>sdg_17_40</td>\n",
       "      <td>sdg_17_40</td>\n",
       "      <td>A|GD|S13</td>\n",
       "      <td>MIO_EUR</td>\n",
       "      <td>A|GD|S13|MIO_EUR</td>\n",
       "      <td>675</td>\n",
       "      <td>675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>266</th>\n",
       "      <td>sdg_17_40</td>\n",
       "      <td>sdg_17_40</td>\n",
       "      <td>A|GD|S13</td>\n",
       "      <td>PC_GDP</td>\n",
       "      <td>A|GD|S13|PC_GDP</td>\n",
       "      <td>675</td>\n",
       "      <td>675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>267</th>\n",
       "      <td>sdg_17_50</td>\n",
       "      <td>sdg_17_50</td>\n",
       "      <td>A|ENV</td>\n",
       "      <td>PC_TSCO_X_ISCO</td>\n",
       "      <td>A|ENV|PC_TSCO_X_ISCO</td>\n",
       "      <td>712</td>\n",
       "      <td>712</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>268</th>\n",
       "      <td>sdg_17_60</td>\n",
       "      <td>sdg_17_60</td>\n",
       "      <td>A|VHCN_FX|DEG3</td>\n",
       "      <td>PC_HH</td>\n",
       "      <td>A|VHCN_FX|DEG3|PC_HH</td>\n",
       "      <td>186</td>\n",
       "      <td>186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269</th>\n",
       "      <td>sdg_17_60</td>\n",
       "      <td>sdg_17_60</td>\n",
       "      <td>A|VHCN_FX|TOTAL</td>\n",
       "      <td>PC_HH</td>\n",
       "      <td>A|VHCN_FX|TOTAL|PC_HH</td>\n",
       "      <td>186</td>\n",
       "      <td>186</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>270 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      indicator      series         dim_code        att_code  \\\n",
       "0     sdg_01_10   sdg_01_10          TOTAL|A              PC   \n",
       "1     sdg_01_10   sdg_01_10          TOTAL|A         THS_PER   \n",
       "2     sdg_01_10   sdg_01_10         Y_LT18|A              PC   \n",
       "3     sdg_01_10   sdg_01_10         Y_LT18|A         THS_PER   \n",
       "4    sdg_01_10a  sdg_01_10a           DEG1|A              PC   \n",
       "..          ...         ...              ...             ...   \n",
       "265   sdg_17_40   sdg_17_40         A|GD|S13         MIO_EUR   \n",
       "266   sdg_17_40   sdg_17_40         A|GD|S13          PC_GDP   \n",
       "267   sdg_17_50   sdg_17_50            A|ENV  PC_TSCO_X_ISCO   \n",
       "268   sdg_17_60   sdg_17_60   A|VHCN_FX|DEG3           PC_HH   \n",
       "269   sdg_17_60   sdg_17_60  A|VHCN_FX|TOTAL           PC_HH   \n",
       "\n",
       "           series metadata  to_import  imported  \n",
       "0               TOTAL|A|PC        320       320  \n",
       "1          TOTAL|A|THS_PER        320       320  \n",
       "2              Y_LT18|A|PC        320       320  \n",
       "3         Y_LT18|A|THS_PER        320       320  \n",
       "4                DEG1|A|PC        322       322  \n",
       "..                     ...        ...       ...  \n",
       "265       A|GD|S13|MIO_EUR        675       675  \n",
       "266        A|GD|S13|PC_GDP        675       675  \n",
       "267   A|ENV|PC_TSCO_X_ISCO        712       712  \n",
       "268   A|VHCN_FX|DEG3|PC_HH        186       186  \n",
       "269  A|VHCN_FX|TOTAL|PC_HH        186       186  \n",
       "\n",
       "[270 rows x 7 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "check_final_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### NUTS data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Retrieve NUTS data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "        MATCH (r:Region{name:'Europe'})-[:HAS_SUBREGION]->(sr:SubRegion)-[:HAS_AREA]->(a:Area)\n",
    "        MATCH (eu:EuropeanUnion)<-[:BELONGS_TO]-(eua:Area)\n",
    "        WITH COLLECT(DISTINCT a.EUcode)+COLLECT(DISTINCT eua.EUcode) as geocodes\n",
    "        UNWIND geocodes as codes\n",
    "        WITH COLLECT(DISTINCT codes) as geo\n",
    "        MATCH (nuts3:NUTS3)<-[:HAS_NUTS3]-(nuts2:NUTS2)-[:HAS_NUTS2]-(nuts1:NUTS1)-[r:HAS_NUTS1]-(ar:Area)\n",
    "        where ar.EUcode in geo\n",
    "        RETURN COLLECT(DISTINCT nuts2.EUcode) + COLLECT(DISTINCT nuts3.EUcode) + COLLECT(DISTINCT nuts1.EUcode) as g\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "available_nuts = list(map(str,records[0]['g']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Associate NUTS regional dataset Indicator codes to EU SDG Indicator Codes as specified by Eurostat according to the relevant [Information Note](.\\Data\\3.EU_SDGs\\Info-note_sdg_reg_20250206.pdf) ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Read NUTS regional dataset Indicator codes, corresponding EU SDG Indicator codes from the Information Note pdf\n",
    "# Note that the Information Note contains the same information 3 times, in English, German and French\n",
    "reader = PdfReader(\"Data/3.EU_SDGs/Info-note_sdg_reg_20250206.pdf\")\n",
    "\n",
    "all_text = \"\" # initialise empty string to accummulate the text\n",
    "for page in reader.pages:\n",
    "    all_text += page.extract_text() # pass the text\n",
    "\n",
    "# establish pattern to match EU SDG Indicator and NUTS Indicator codes as follows:\n",
    "# r: raw string, to treat everything as a character\n",
    "# EU SDG Indicator codes follow the patter of \"sdg_xx_xx\", x is an integer -> matched by sdg_\\d{2}_\\d{2})\n",
    "# .*? matches the description in between, not needed for our dictionary\n",
    "# NUTS Indicator codes are lowercase strings in the same line as EU SDG Indicator codes -> matched by [a-z]{2,}_[a-z0-9_]+: 2 or more lowercase letters, underscore, 1 or more lowercase letters, digits, or underscores\n",
    "pattern = r\"(sdg_\\d{2}_\\d{2}).*?\\b([a-z]{2,}_[a-z0-9_]+)\" \n",
    "matches = re.findall(pattern, all_text, re.DOTALL) # find matches, re.DOTALL to match newline characters too\n",
    "\n",
    "codes_nuts_dict={dataset:indicator for indicator, dataset in matches} # create dictionary mapping"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>code</th>\n",
       "      <th>title</th>\n",
       "      <th>sdg_code</th>\n",
       "      <th>DateOfReport</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>lfst_r_lfe2emprt</td>\n",
       "      <td>employment rates by nuts 2 region</td>\n",
       "      <td>sdg_08_30</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>lfst_r_lfu2ltu</td>\n",
       "      <td>persons in long-term unemployment (12 months o...</td>\n",
       "      <td>sdg_08_40</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>634</th>\n",
       "      <td>hlth_silc_08b_r</td>\n",
       "      <td>self-reported unmet needs for medical examinat...</td>\n",
       "      <td>sdg_03_60</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1161</th>\n",
       "      <td>nama_10r_2gdp</td>\n",
       "      <td>gross domestic product (gdp) at current market...</td>\n",
       "      <td>sdg_10_10</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1457</th>\n",
       "      <td>hlth_cd_asdr2</td>\n",
       "      <td>causes of death - standardised death rate by n...</td>\n",
       "      <td>sdg_16_10</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3389</th>\n",
       "      <td>ilc_li41</td>\n",
       "      <td>at-risk-of-poverty rate by nuts 2 region</td>\n",
       "      <td>sdg_01_20</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3475</th>\n",
       "      <td>ilc_lvhl21n</td>\n",
       "      <td>persons living in households with very low wor...</td>\n",
       "      <td>sdg_01_40</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3864</th>\n",
       "      <td>ilc_mdsd18</td>\n",
       "      <td>severe material and social deprivation by nuts...</td>\n",
       "      <td>sdg_01_31</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3957</th>\n",
       "      <td>ilc_peps11n</td>\n",
       "      <td>persons at risk of poverty or social exclusion...</td>\n",
       "      <td>sdg_01_10</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4196</th>\n",
       "      <td>edat_lfse_04</td>\n",
       "      <td>population in private households by educationa...</td>\n",
       "      <td>sdg_04_20</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4205</th>\n",
       "      <td>edat_lfse_16</td>\n",
       "      <td>early leavers from education and training by n...</td>\n",
       "      <td>sdg_04_10</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4222</th>\n",
       "      <td>edat_lfse_22</td>\n",
       "      <td>young persons neither in employment nor in edu...</td>\n",
       "      <td>sdg_08_20</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4460</th>\n",
       "      <td>educ_uoe_enra22</td>\n",
       "      <td>pupils from age 3 to the starting age of compu...</td>\n",
       "      <td>sdg_04_31</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5013</th>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>victims in road accidents by nuts 2 region</td>\n",
       "      <td>sdg_11_40</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5405</th>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>participation rate in education and training (...</td>\n",
       "      <td>sdg_04_60</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6995</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>estimated soil erosion by water, by erosion le...</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7071</th>\n",
       "      <td>rd_e_gerdreg</td>\n",
       "      <td>gerd by sector of performance and nuts 2 region</td>\n",
       "      <td>sdg_09_10</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7105</th>\n",
       "      <td>rd_p_persreg</td>\n",
       "      <td>r&amp;d personnel and researchers by sector of per...</td>\n",
       "      <td>sdg_09_30</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7857</th>\n",
       "      <td>tepsr_lm220</td>\n",
       "      <td>gender employment gap by nuts 2 region</td>\n",
       "      <td>sdg_05_30</td>\n",
       "      <td>2025-01-10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  code                                              title  \\\n",
       "59    lfst_r_lfe2emprt                  employment rates by nuts 2 region   \n",
       "77      lfst_r_lfu2ltu  persons in long-term unemployment (12 months o...   \n",
       "634    hlth_silc_08b_r  self-reported unmet needs for medical examinat...   \n",
       "1161     nama_10r_2gdp  gross domestic product (gdp) at current market...   \n",
       "1457     hlth_cd_asdr2  causes of death - standardised death rate by n...   \n",
       "3389          ilc_li41           at-risk-of-poverty rate by nuts 2 region   \n",
       "3475       ilc_lvhl21n  persons living in households with very low wor...   \n",
       "3864        ilc_mdsd18  severe material and social deprivation by nuts...   \n",
       "3957       ilc_peps11n  persons at risk of poverty or social exclusion...   \n",
       "4196      edat_lfse_04  population in private households by educationa...   \n",
       "4205      edat_lfse_16  early leavers from education and training by n...   \n",
       "4222      edat_lfse_22  young persons neither in employment nor in edu...   \n",
       "4460   educ_uoe_enra22  pupils from age 3 to the starting age of compu...   \n",
       "5013       tran_r_acci         victims in road accidents by nuts 2 region   \n",
       "5405      trng_lfse_04  participation rate in education and training (...   \n",
       "6995     aei_pr_soiler  estimated soil erosion by water, by erosion le...   \n",
       "7071      rd_e_gerdreg    gerd by sector of performance and nuts 2 region   \n",
       "7105      rd_p_persreg  r&d personnel and researchers by sector of per...   \n",
       "7857       tepsr_lm220             gender employment gap by nuts 2 region   \n",
       "\n",
       "       sdg_code DateOfReport  \n",
       "59    sdg_08_30   2025-01-10  \n",
       "77    sdg_08_40   2025-01-10  \n",
       "634   sdg_03_60   2025-01-10  \n",
       "1161  sdg_10_10   2025-01-10  \n",
       "1457  sdg_16_10   2025-01-10  \n",
       "3389  sdg_01_20   2025-01-10  \n",
       "3475  sdg_01_40   2025-01-10  \n",
       "3864  sdg_01_31   2025-01-10  \n",
       "3957  sdg_01_10   2025-01-10  \n",
       "4196  sdg_04_20   2025-01-10  \n",
       "4205  sdg_04_10   2025-01-10  \n",
       "4222  sdg_08_20   2025-01-10  \n",
       "4460  sdg_04_31   2025-01-10  \n",
       "5013  sdg_11_40   2025-01-10  \n",
       "5405  sdg_04_60   2025-01-10  \n",
       "6995  sdg_15_50   2025-01-10  \n",
       "7071  sdg_09_10   2025-01-10  \n",
       "7105  sdg_09_30   2025-01-10  \n",
       "7857  sdg_05_30   2025-01-10  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get description form toc_df for NUTS regional dataset Indicators\n",
    "nuts_codes = []\n",
    "corresponding_sdgs = []\n",
    "\n",
    "for nuts_code, sdg_code in codes_nuts_dict.items():\n",
    "    nuts_codes.append(nuts_code)\n",
    "    corresponding_sdgs.append(sdg_code)\n",
    "\n",
    "nuts_df = toc_df[toc_df['code'].isin(nuts_codes)][['code', 'title']] # NUTS Indicator codes from toc_df\n",
    "nuts_to_sdg_mapping = dict(zip(nuts_codes, corresponding_sdgs))\n",
    "nuts_df['sdg_code'] = nuts_df['code'].map(nuts_to_sdg_mapping)\n",
    "\n",
    "first_dateofreport = df_eu['DateOfReport'].iloc[0] \n",
    "nuts_df['DateOfReport'] = first_dateofreport # add DateOfReport column from annual report\n",
    "nuts_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_nuts_indicators(tx,statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import NUTS regional dataset Indicator codes, add 'corespondant' relationships with EU SDG indicator nodes, add COMES_FROM relationship with the EU_SDG node\n",
    "parent_statement= \"\"\"\n",
    "    MATCH(pi:Indicator{code:$sdg_ind}), (i:Indicator{code:$nuts_ind}), (so:Source{name:'EU_SDG'})\n",
    "    MERGE (i)-[:ASSOCIATED_WITH{relevance:'correspondant',dateOfReport:date($report_date)}]->(pi)\n",
    "    MERGE (i)-[:COMES_FROM]->(so)\n",
    "\"\"\"\n",
    "statement_nuts_ind = \"\"\"\n",
    "    MERGE (i:Indicator{code:$nuts_ind,description:$desc})\n",
    "    MERGE (s:Series{code:$nuts_ind,description:$desc,\n",
    "                    dataProviderURL:\"https://ec.europa.eu/eurostat/web/sdi/database\"})\n",
    "    MERGE (i)-[:HAS_SERIES]->(s)\n",
    "    RETURN *\n",
    "\"\"\"\n",
    "\n",
    "i = 0\n",
    "with driver.session(database=database_name) as session:\n",
    "    for index,row in nuts_df.iterrows(): \n",
    "        session.execute_write(write_nuts_indicators, \n",
    "                            params_dict = {\n",
    "                                'desc': str(row.title),\n",
    "                                'nuts_ind': str(row.code)\n",
    "                            },\n",
    "                            statement = statement_nuts_ind)  \n",
    "        i +=1\n",
    "        session.execute_write(write_nuts_indicators, \n",
    "                        params_dict = { \n",
    "                            'nuts_ind': str(row.code),\n",
    "                            'sdg_ind': str(row.sdg_code),\n",
    "                            'report_date':str(row['DateOfReport'])\n",
    "                            },\n",
    "                        statement = parent_statement)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Import NUTS regional dataset data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Indicator code:  ilc_peps11n\n",
      "\n",
      "Length of df before removing NA values: 3450\n",
      "Length of df after removing NA values: 2342\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 2290\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "2290 observations: Done! (0.0582489291826884 minutes)\n",
      "Time for ilc_peps11n: 0.06 minutes\n",
      "\n",
      "Indicator code:  ilc_li41\n",
      "\n",
      "Length of df before removing NA values: 7700\n",
      "Length of df after removing NA values: 3746\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 3588\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "3588 observations: Done! (0.051470569769541424 minutes)\n",
      "Time for ilc_li41: 0.06 minutes\n",
      "\n",
      "Indicator code:  ilc_mdsd18\n",
      "\n",
      "Length of df before removing NA values: 3795\n",
      "Length of df after removing NA values: 2213\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 2164\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "2164 observations: Done! (0.05523241360982259 minutes)\n",
      "Time for ilc_mdsd18: 0.06 minutes\n",
      "\n",
      "Indicator code:  ilc_lvhl21n\n",
      "\n",
      "Length of df before removing NA values: 3795\n",
      "Length of df after removing NA values: 2348\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 2295\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "2295 observations: Done! (0.017033076286315917 minutes)\n",
      "Time for ilc_lvhl21n: 0.02 minutes\n",
      "\n",
      "Indicator code:  hlth_silc_08b_r\n",
      "\n",
      "Length of df before removing NA values: 832\n",
      "Length of df after removing NA values: 734\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 729\n",
      "\n",
      "Columns of df: ['reason', 'unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'reason']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "729 observations: Done! (0.015112984180450439 minutes)\n",
      "Time for hlth_silc_08b_r: 0.02 minutes\n",
      "\n",
      "Indicator code:  edat_lfse_16\n",
      "\n",
      "Length of df before removing NA values: 38250\n",
      "Length of df after removing NA values: 26378\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 23446\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.25975154638290404 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.16287816365559896 minutes)\n",
      "3445 observations: Done! (0.030301904678344725 minutes)\n",
      "Time for edat_lfse_16: 0.51 minutes\n",
      "\n",
      "Indicator code:  edat_lfse_04\n",
      "\n",
      "Length of df before removing NA values: 880650\n",
      "Length of df after removing NA values: 566373\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 507263\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'isced11', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'isced11', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.0914011557896932 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.07438422441482544 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.07498434782028199 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07446376085281373 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07445111672083536 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07404555877049764 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.07428143819173177 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.0736760417620341 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07364648977915446 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07384113470713298 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.07370591958363851 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.07504652341206869 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.07455402612686157 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.07336151997248332 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.07435164451599122 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.07493109703063965 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07411866188049317 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.07425920963287354 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.07395213842391968 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.0744473934173584 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.07473754088083903 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.0737863024075826 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.07485435009002686 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.07400815486907959 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.0739090085029602 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.07350121339162191 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.07477003733317057 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.07457640171051025 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.1649816632270813 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.16473703384399413 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.1659655451774597 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.1656051794687907 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.16594057083129882 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.16055688858032227 minutes)\n",
      "Batch 35 with 10000 observations : Done! (0.07426023880640666 minutes)\n",
      "Batch 36 with 10000 observations : Done! (0.07709428071975707 minutes)\n",
      "Batch 37 with 10000 observations : Done! (0.0741817553838094 minutes)\n",
      "Batch 38 with 10000 observations : Done! (0.07479761838912964 minutes)\n",
      "Batch 39 with 10000 observations : Done! (0.07424981594085693 minutes)\n",
      "Batch 40 with 10000 observations : Done! (0.07436760266621907 minutes)\n",
      "Batch 41 with 10000 observations : Done! (0.07629350026448568 minutes)\n",
      "Batch 42 with 10000 observations : Done! (0.07712218364079794 minutes)\n",
      "Batch 43 with 10000 observations : Done! (0.07494447628657024 minutes)\n",
      "Batch 44 with 10000 observations : Done! (0.07418418327967326 minutes)\n",
      "Batch 45 with 10000 observations : Done! (0.07488746643066406 minutes)\n",
      "Batch 46 with 10000 observations : Done! (0.07557216087977091 minutes)\n",
      "Batch 47 with 10000 observations : Done! (0.07524904012680053 minutes)\n",
      "Batch 48 with 10000 observations : Done! (0.07416801850001017 minutes)\n",
      "Batch 49 with 10000 observations : Done! (0.07447293599446615 minutes)\n",
      "Batch 50 with 10000 observations : Done! (0.07472335497538249 minutes)\n",
      "7262 observations: Done! (0.05412238438924154 minutes)\n",
      "Time for edat_lfse_04: 4.90 minutes\n",
      "\n",
      "Indicator code:  educ_uoe_enra22\n",
      "\n",
      "Length of df before removing NA values: 4180\n",
      "Length of df after removing NA values: 3412\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 2985\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "2985 observations: Done! (0.044598627090454104 minutes)\n",
      "Time for educ_uoe_enra22: 0.05 minutes\n",
      "\n",
      "Indicator code:  trng_lfse_04\n",
      "\n",
      "Length of df before removing NA values: 35550\n",
      "Length of df after removing NA values: 29882\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 27033\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.15321425994237264 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.15283053716023762 minutes)\n",
      "7032 observations: Done! (0.10797866582870483 minutes)\n",
      "Time for trng_lfse_04: 0.44 minutes\n",
      "\n",
      "Indicator code:  tepsr_lm220\n",
      "\n",
      "Length of df before removing NA values: 7040\n",
      "Length of df after removing NA values: 6252\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 5585\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "5585 observations: Done! (0.0856635332107544 minutes)\n",
      "Time for tepsr_lm220: 0.09 minutes\n",
      "\n",
      "Indicator code:  edat_lfse_22\n",
      "\n",
      "Length of df before removing NA values: 153000\n",
      "Length of df after removing NA values: 114048\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 101950\n",
      "\n",
      "Columns of df: ['wstatus', 'sex', 'geo', 'freq', 'age', 'unit', 'training', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'sex', 'training', 'wstatus']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.08088967402776083 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.07853408654530843 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.0789558211962382 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07803800900777182 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07899978558222452 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07801373402277628 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.077737824122111 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07847973505655924 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.0777947465578715 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07804170449574789 minutes)\n",
      "1949 observations: Done! (0.01612225373586019 minutes)\n",
      "Time for edat_lfse_22: 0.91 minutes\n",
      "\n",
      "Indicator code:  lfst_r_lfe2emprt\n",
      "\n",
      "Length of df before removing NA values: 444600\n",
      "Length of df after removing NA values: 380302\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 345153\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.10562535921732584 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.07443162202835082 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.07401284774144491 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07443021535873413 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07505090236663818 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07336989243825277 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.07309937874476115 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07624303499857585 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07471887667973837 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07418973843256632 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.07356324593226114 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.07483107248942057 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.07474934260050456 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.07428364356358846 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.07420584758122763 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.07360555330912272 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07430442174275716 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.07392588059107462 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.07488028208414714 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.07417652209599813 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.07459757725397746 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.07341165542602539 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.07415527105331421 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.07354119221369425 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.09719644784927368 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.1624753713607788 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.1604565978050232 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.17056629260381062 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.16049720843633017 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.16458967526753743 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.15916013717651367 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.0735618273417155 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.07391771475474039 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.0732409159342448 minutes)\n",
      "5152 observations: Done! (0.03909304936726888 minutes)\n",
      "Time for lfst_r_lfe2emprt: 3.51 minutes\n",
      "\n",
      "Indicator code:  lfst_r_lfu2ltu\n",
      "\n",
      "Length of df before removing NA values: 3336684\n",
      "Length of df after removing NA values: 1448574\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 1266726\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'isced11', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'isced11', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.17416938543319702 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.18217074473698933 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.12240251302719116 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07639680703481039 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07813014189402262 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07585676511128743 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.0767246683438619 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07612429857254029 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07673497597376505 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07602887153625489 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.18000983397165934 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.17472720940907796 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.1729464332262675 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.17651434342066447 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.17377229928970336 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.13125678300857543 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07634373505910237 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.07679460843404134 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.0772718071937561 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.07557421525319417 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.07742568254470825 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.07615329424540201 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.07680352528889973 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.07644703388214111 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.07765418688456217 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.07525951464970906 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.0767147978146871 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.07642235358556111 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.07686954339345296 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.07714643478393554 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.07642205158869425 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.0767768661181132 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.07615753809611002 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.07612183094024658 minutes)\n",
      "Batch 35 with 10000 observations : Done! (0.08043010234832763 minutes)\n",
      "Batch 36 with 10000 observations : Done! (0.08109583457310994 minutes)\n",
      "Batch 37 with 10000 observations : Done! (0.07951374848683675 minutes)\n",
      "Batch 38 with 10000 observations : Done! (0.07646838426589966 minutes)\n",
      "Batch 39 with 10000 observations : Done! (0.07677716414133708 minutes)\n",
      "Batch 40 with 10000 observations : Done! (0.07802304029464721 minutes)\n",
      "Batch 41 with 10000 observations : Done! (0.07881985902786255 minutes)\n",
      "Batch 42 with 10000 observations : Done! (0.07608131965001425 minutes)\n",
      "Batch 43 with 10000 observations : Done! (0.07630431254704793 minutes)\n",
      "Batch 44 with 10000 observations : Done! (0.17443002462387086 minutes)\n",
      "Batch 45 with 10000 observations : Done! (0.17445858319600424 minutes)\n",
      "Batch 46 with 10000 observations : Done! (0.20248744487762452 minutes)\n",
      "Batch 47 with 10000 observations : Done! (0.17688502073287965 minutes)\n",
      "Batch 48 with 10000 observations : Done! (0.1757668177286784 minutes)\n",
      "Batch 49 with 10000 observations : Done! (0.11173003911972046 minutes)\n",
      "Batch 50 with 10000 observations : Done! (0.07712024450302124 minutes)\n",
      "Batch 51 with 10000 observations : Done! (0.07666736443837484 minutes)\n",
      "Batch 52 with 10000 observations : Done! (0.07699480851491293 minutes)\n",
      "Batch 53 with 10000 observations : Done! (0.07611859242121378 minutes)\n",
      "Batch 54 with 10000 observations : Done! (0.07701549927393596 minutes)\n",
      "Batch 55 with 10000 observations : Done! (0.07632749080657959 minutes)\n",
      "Batch 56 with 10000 observations : Done! (0.0811028281847636 minutes)\n",
      "Batch 57 with 10000 observations : Done! (0.07797646919886271 minutes)\n",
      "Batch 58 with 10000 observations : Done! (0.07863046725591023 minutes)\n",
      "Batch 59 with 10000 observations : Done! (0.07587830225626628 minutes)\n",
      "Batch 60 with 10000 observations : Done! (0.07559034824371338 minutes)\n",
      "Batch 61 with 10000 observations : Done! (0.07553651730219522 minutes)\n",
      "Batch 62 with 10000 observations : Done! (0.07584843238194784 minutes)\n",
      "Batch 63 with 10000 observations : Done! (0.07671385606129964 minutes)\n",
      "Batch 64 with 10000 observations : Done! (0.07677805423736572 minutes)\n",
      "Batch 65 with 10000 observations : Done! (0.0774273951848348 minutes)\n",
      "Batch 66 with 10000 observations : Done! (0.07557189464569092 minutes)\n",
      "Batch 67 with 10000 observations : Done! (0.07617082198460896 minutes)\n",
      "Batch 68 with 10000 observations : Done! (0.0752480149269104 minutes)\n",
      "Batch 69 with 10000 observations : Done! (0.07722649574279786 minutes)\n",
      "Batch 70 with 10000 observations : Done! (0.0763857364654541 minutes)\n",
      "Batch 71 with 10000 observations : Done! (0.07786080042521158 minutes)\n",
      "Batch 72 with 10000 observations : Done! (0.07617284854253133 minutes)\n",
      "Batch 73 with 10000 observations : Done! (0.07539514700571696 minutes)\n",
      "Batch 74 with 10000 observations : Done! (0.07527740399042765 minutes)\n",
      "Batch 75 with 10000 observations : Done! (0.0755825122197469 minutes)\n",
      "Batch 76 with 10000 observations : Done! (0.07557382583618164 minutes)\n",
      "Batch 77 with 10000 observations : Done! (0.07620303630828858 minutes)\n",
      "Batch 78 with 10000 observations : Done! (0.07567092577616373 minutes)\n",
      "Batch 79 with 10000 observations : Done! (0.07554069757461548 minutes)\n",
      "Batch 80 with 10000 observations : Done! (0.07648109594980876 minutes)\n",
      "Batch 81 with 10000 observations : Done! (0.075832466284434 minutes)\n",
      "Batch 82 with 10000 observations : Done! (0.07766307592391967 minutes)\n",
      "Batch 83 with 10000 observations : Done! (0.07648186286290487 minutes)\n",
      "Batch 84 with 10000 observations : Done! (0.07613931099573772 minutes)\n",
      "Batch 85 with 10000 observations : Done! (0.07513682842254639 minutes)\n",
      "Batch 86 with 10000 observations : Done! (0.08087568283081055 minutes)\n",
      "Batch 87 with 10000 observations : Done! (0.07646058003107707 minutes)\n",
      "Batch 88 with 10000 observations : Done! (0.07594980398813883 minutes)\n",
      "Batch 89 with 10000 observations : Done! (0.07519588073094687 minutes)\n",
      "Batch 90 with 10000 observations : Done! (0.07729886372884115 minutes)\n",
      "Batch 91 with 10000 observations : Done! (0.07601003646850586 minutes)\n",
      "Batch 92 with 10000 observations : Done! (0.07722087701161702 minutes)\n",
      "Batch 93 with 10000 observations : Done! (0.17433944940567017 minutes)\n",
      "Batch 94 with 10000 observations : Done! (0.1750793695449829 minutes)\n",
      "Batch 95 with 10000 observations : Done! (0.17505332231521606 minutes)\n",
      "Batch 96 with 10000 observations : Done! (0.18146605094273885 minutes)\n",
      "Batch 97 with 10000 observations : Done! (0.17473549842834474 minutes)\n",
      "Batch 98 with 10000 observations : Done! (0.13023369312286376 minutes)\n",
      "Batch 99 with 10000 observations : Done! (0.07563860416412353 minutes)\n",
      "Batch 100 with 10000 observations : Done! (0.07890196243921915 minutes)\n",
      "Batch 101 with 10000 observations : Done! (0.07729670206705729 minutes)\n",
      "Batch 102 with 10000 observations : Done! (0.07660787105560303 minutes)\n",
      "Batch 103 with 10000 observations : Done! (0.0758483608563741 minutes)\n",
      "Batch 104 with 10000 observations : Done! (0.07675955295562745 minutes)\n",
      "Batch 105 with 10000 observations : Done! (0.0775944709777832 minutes)\n",
      "Batch 106 with 10000 observations : Done! (0.07585349082946777 minutes)\n",
      "Batch 107 with 10000 observations : Done! (0.07647709846496582 minutes)\n",
      "Batch 108 with 10000 observations : Done! (0.07756930987040202 minutes)\n",
      "Batch 109 with 10000 observations : Done! (0.07680654923121134 minutes)\n",
      "Batch 110 with 10000 observations : Done! (0.07735644578933716 minutes)\n",
      "Batch 111 with 10000 observations : Done! (0.07615921099980673 minutes)\n",
      "Batch 112 with 10000 observations : Done! (0.07791084051132202 minutes)\n",
      "Batch 113 with 10000 observations : Done! (0.07623616456985474 minutes)\n",
      "Batch 114 with 10000 observations : Done! (0.18370433648427328 minutes)\n",
      "Batch 115 with 10000 observations : Done! (0.17628222306569416 minutes)\n",
      "Batch 116 with 10000 observations : Done! (0.17522847255071003 minutes)\n",
      "Batch 117 with 10000 observations : Done! (0.17473082145055135 minutes)\n",
      "Batch 118 with 10000 observations : Done! (0.175347105662028 minutes)\n",
      "Batch 119 with 10000 observations : Done! (0.12857091029485065 minutes)\n",
      "Batch 120 with 10000 observations : Done! (0.07728472153345743 minutes)\n",
      "Batch 121 with 10000 observations : Done! (0.07719495296478271 minutes)\n",
      "Batch 122 with 10000 observations : Done! (0.07656387885411581 minutes)\n",
      "Batch 123 with 10000 observations : Done! (0.07922549645105997 minutes)\n",
      "Batch 124 with 10000 observations : Done! (0.0763302763303121 minutes)\n",
      "Batch 125 with 10000 observations : Done! (0.07725474039713541 minutes)\n",
      "Batch 126 with 10000 observations : Done! (0.17403240203857423 minutes)\n",
      "6725 observations: Done! (0.12123446861902873 minutes)\n",
      "Time for lfst_r_lfu2ltu: 13.81 minutes\n",
      "\n",
      "Indicator code:  rd_e_gerdreg\n",
      "\n",
      "Length of df before removing NA values: 795872\n",
      "Length of df after removing NA values: 245426\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 202759\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'sectperf', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'sectperf']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.17406072616577148 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.10410417715708414 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.07596129576365153 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07554958661397299 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.0762075940767924 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07624912659327189 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.07763047615687052 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.0771929144859314 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07554865678151448 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07721561590830485 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.07814089854558309 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.07615627845128377 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.07619578043619792 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.07874348560969034 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.0757520079612732 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.18510611454645792 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.156866459051768 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.15672844648361206 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.15686612923940021 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.1567811608314514 minutes)\n",
      "2758 observations: Done! (0.04364152352015178 minutes)\n",
      "Time for rd_e_gerdreg: 2.36 minutes\n",
      "\n",
      "Indicator code:  rd_p_persreg\n",
      "\n",
      "Length of df before removing NA values: 1911844\n",
      "Length of df after removing NA values: 519640\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 462936\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'freq', 'unit', 'sectperf', 'prof_pos', 'time', 'value']\n",
      "Dimension columns: ['freq', 'prof_pos', 'sectperf', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.1595657706260681 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.2132548451423645 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.0752664844195048 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07327510913213094 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07451812823613485 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07643746137619019 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.07407551606496175 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07513485749562582 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07435907920201619 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07527784109115601 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.07393469015757242 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.07538490692774455 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.07429898579915364 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.07602217197418212 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.07483421166737875 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.07447107632954915 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07563320795694987 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.07584835290908813 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.07434317668279013 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.07403742869695028 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.07498862743377685 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.16825267871220906 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.17156861225763956 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.18426174720128377 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.16427008708318075 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.16856006781260172 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.1466117779413859 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.07507871786753337 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.07398231426874796 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.073124098777771 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.07469163338343303 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.07309990326563517 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.0764055848121643 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.074669349193573 minutes)\n",
      "Batch 35 with 10000 observations : Done! (0.07560047705968222 minutes)\n",
      "Batch 36 with 10000 observations : Done! (0.07591483195622763 minutes)\n",
      "Batch 37 with 10000 observations : Done! (0.07439112265904745 minutes)\n",
      "Batch 38 with 10000 observations : Done! (0.07440026601155598 minutes)\n",
      "Batch 39 with 10000 observations : Done! (0.07337327400843302 minutes)\n",
      "Batch 40 with 10000 observations : Done! (0.07445023059844971 minutes)\n",
      "Batch 41 with 10000 observations : Done! (0.07208899259567261 minutes)\n",
      "Batch 42 with 10000 observations : Done! (0.07266334692637126 minutes)\n",
      "Batch 43 with 10000 observations : Done! (0.07308078606923421 minutes)\n",
      "Batch 44 with 10000 observations : Done! (0.07464419603347779 minutes)\n",
      "Batch 45 with 10000 observations : Done! (0.07361455758412679 minutes)\n",
      "Batch 46 with 10000 observations : Done! (0.07440362373987834 minutes)\n",
      "2935 observations: Done! (0.0218164324760437 minutes)\n",
      "Time for rd_p_persreg: 4.76 minutes\n",
      "\n",
      "Indicator code:  nama_10r_2gdp\n",
      "\n",
      "Length of df before removing NA values: 70080\n",
      "Length of df after removing NA values: 66013\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 58166\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.0709096352259318 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.07405381202697754 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.07380148967107138 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.15657174984614056 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.15819861888885497 minutes)\n",
      "8165 observations: Done! (0.1310575008392334 minutes)\n",
      "Time for nama_10r_2gdp: 0.72 minutes\n",
      "\n",
      "Indicator code:  tran_r_acci\n",
      "\n",
      "Length of df before removing NA values: 63240\n",
      "Length of df after removing NA values: 50553\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 46341\n",
      "\n",
      "Columns of df: ['unit', 'geo', 'victim', 'freq', 'time', 'value']\n",
      "Dimension columns: ['freq', 'victim']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.14534639517466227 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.1457624117533366 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.10476944049199423 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.06664028962453207 minutes)\n",
      "6340 observations: Done! (0.04485762119293213 minutes)\n",
      "Time for tran_r_acci: 0.55 minutes\n",
      "\n",
      "Indicator code:  aei_pr_soiler\n",
      "\n",
      "Length of df before removing NA values: 385440\n",
      "Length of df after removing NA values: 385440\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 375120\n",
      "\n",
      "Columns of df: ['clc18', 'geo', 'freq', 'unit', 'levels', 'time', 'value']\n",
      "Dimension columns: ['clc18', 'freq', 'levels']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.19262873729070026 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.16635989745457966 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.0766727606455485 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07502162456512451 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.07702775398890177 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.07859970728556315 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.072548508644104 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07076525688171387 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.07445588111877441 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.07403802871704102 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.07846779823303222 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.07721108595530192 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.07446270783742269 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.073977530002594 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.07320579687754313 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.07307161490122477 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07337061961491903 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.0738247791926066 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.0772428313891093 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.06996405124664307 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.0710966149965922 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.07473325332005819 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.07049824396769205 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.06970076163609823 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.08278202215830485 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.07097445329030355 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.07140151659647624 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.07554459969202677 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.07287983496983846 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.07332950433095296 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.07747992674509684 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.07099378903706868 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.0699557622273763 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.07239150603612264 minutes)\n",
      "Batch 35 with 10000 observations : Done! (0.07298502127329508 minutes)\n",
      "Batch 36 with 10000 observations : Done! (0.06989612976710001 minutes)\n",
      "Batch 37 with 10000 observations : Done! (0.07196349302927653 minutes)\n",
      "5119 observations: Done! (0.04097893238067627 minutes)\n",
      "Time for aei_pr_soiler: 3.39 minutes\n",
      "\n",
      "Indicator code:  hlth_cd_asdr2\n",
      "\n",
      "Length of df before removing NA values: 4431420\n",
      "Length of df after removing NA values: 3836289\n",
      "Length of df after selecting only areas existing in neo4j SustainGraph: 3461934\n",
      "\n",
      "Columns of df: ['sex', 'geo', 'icd10', 'freq', 'age', 'unit', 'time', 'value']\n",
      "Dimension columns: ['age', 'freq', 'icd10', 'sex']\n",
      "\n",
      "Attribute columns: unit\n",
      "\n",
      "----------------------------------------------------------\n",
      "Batch 1 with 10001 observations : Done! (0.07640164693196615 minutes)\n",
      "Batch 2 with 10000 observations : Done! (0.07723175287246704 minutes)\n",
      "Batch 3 with 10000 observations : Done! (0.07909395297368367 minutes)\n",
      "Batch 4 with 10000 observations : Done! (0.07667061487833658 minutes)\n",
      "Batch 5 with 10000 observations : Done! (0.08697074254353841 minutes)\n",
      "Batch 6 with 10000 observations : Done! (0.08901001612345377 minutes)\n",
      "Batch 7 with 10000 observations : Done! (0.0794386347134908 minutes)\n",
      "Batch 8 with 10000 observations : Done! (0.07687219381332397 minutes)\n",
      "Batch 9 with 10000 observations : Done! (0.08416944742202759 minutes)\n",
      "Batch 10 with 10000 observations : Done! (0.20578766663869222 minutes)\n",
      "Batch 11 with 10000 observations : Done! (0.1727160414059957 minutes)\n",
      "Batch 12 with 10000 observations : Done! (0.19157543579737346 minutes)\n",
      "Batch 13 with 10000 observations : Done! (0.19614291588465374 minutes)\n",
      "Batch 14 with 10000 observations : Done! (0.16719314654668171 minutes)\n",
      "Batch 15 with 10000 observations : Done! (0.08632995287577311 minutes)\n",
      "Batch 16 with 10000 observations : Done! (0.07986424366633098 minutes)\n",
      "Batch 17 with 10000 observations : Done! (0.07836731274922688 minutes)\n",
      "Batch 18 with 10000 observations : Done! (0.07668799956639608 minutes)\n",
      "Batch 19 with 10000 observations : Done! (0.07653881708780924 minutes)\n",
      "Batch 20 with 10000 observations : Done! (0.0744215726852417 minutes)\n",
      "Batch 21 with 10000 observations : Done! (0.0749247670173645 minutes)\n",
      "Batch 22 with 10000 observations : Done! (0.07606416940689087 minutes)\n",
      "Batch 23 with 10000 observations : Done! (0.07750793695449829 minutes)\n",
      "Batch 24 with 10000 observations : Done! (0.07746269305547078 minutes)\n",
      "Batch 25 with 10000 observations : Done! (0.07729753653208414 minutes)\n",
      "Batch 26 with 10000 observations : Done! (0.07545733054478963 minutes)\n",
      "Batch 27 with 10000 observations : Done! (0.07721522649129232 minutes)\n",
      "Batch 28 with 10000 observations : Done! (0.07725739479064941 minutes)\n",
      "Batch 29 with 10000 observations : Done! (0.07623655796051025 minutes)\n",
      "Batch 30 with 10000 observations : Done! (0.07718502680460612 minutes)\n",
      "Batch 31 with 10000 observations : Done! (0.07461051146189372 minutes)\n",
      "Batch 32 with 10000 observations : Done! (0.07629632552464803 minutes)\n",
      "Batch 33 with 10000 observations : Done! (0.0770413637161255 minutes)\n",
      "Batch 34 with 10000 observations : Done! (0.074359929561615 minutes)\n",
      "Batch 35 with 10000 observations : Done! (0.07522954940795898 minutes)\n",
      "Batch 36 with 10000 observations : Done! (0.07523463567097982 minutes)\n",
      "Batch 37 with 10000 observations : Done! (0.07547704776128134 minutes)\n",
      "Batch 38 with 10000 observations : Done! (0.0760007381439209 minutes)\n",
      "Batch 39 with 10000 observations : Done! (0.075240425268809 minutes)\n",
      "Batch 40 with 10000 observations : Done! (0.07733471790949503 minutes)\n",
      "Batch 41 with 10000 observations : Done! (0.07647412618001302 minutes)\n",
      "Batch 42 with 10000 observations : Done! (0.07748738129933676 minutes)\n",
      "Batch 43 with 10000 observations : Done! (0.07440119584401449 minutes)\n",
      "Batch 44 with 10000 observations : Done! (0.08907315731048585 minutes)\n",
      "Batch 45 with 10000 observations : Done! (0.07675137519836425 minutes)\n",
      "Batch 46 with 10000 observations : Done! (0.0746083935101827 minutes)\n",
      "Batch 47 with 10000 observations : Done! (0.07523231506347657 minutes)\n",
      "Batch 48 with 10000 observations : Done! (0.07496844132741293 minutes)\n",
      "Batch 49 with 10000 observations : Done! (0.0731435497601827 minutes)\n",
      "Batch 50 with 10000 observations : Done! (0.07488330602645873 minutes)\n",
      "Batch 51 with 10000 observations : Done! (0.07996511459350586 minutes)\n",
      "Batch 52 with 10000 observations : Done! (0.07746127843856812 minutes)\n",
      "Batch 53 with 10000 observations : Done! (0.07817582289377849 minutes)\n",
      "Batch 54 with 10000 observations : Done! (0.07493810256322225 minutes)\n",
      "Batch 55 with 10000 observations : Done! (0.07595853408177694 minutes)\n",
      "Batch 56 with 10000 observations : Done! (0.07470591862996419 minutes)\n",
      "Batch 57 with 10000 observations : Done! (0.07382137378056844 minutes)\n",
      "Batch 58 with 10000 observations : Done! (0.07428605556488037 minutes)\n",
      "Batch 59 with 10000 observations : Done! (0.07645047108332316 minutes)\n",
      "Batch 60 with 10000 observations : Done! (0.07456691265106201 minutes)\n",
      "Batch 61 with 10000 observations : Done! (0.07648055950800578 minutes)\n",
      "Batch 62 with 10000 observations : Done! (0.07517520189285279 minutes)\n",
      "Batch 63 with 10000 observations : Done! (0.08163696924845378 minutes)\n",
      "Batch 64 with 10000 observations : Done! (0.07678138812383016 minutes)\n",
      "Batch 65 with 10000 observations : Done! (0.07519126733144124 minutes)\n",
      "Batch 66 with 10000 observations : Done! (0.07496946652730306 minutes)\n",
      "Batch 67 with 10000 observations : Done! (0.07452474037806193 minutes)\n",
      "Batch 68 with 10000 observations : Done! (0.07972479263941447 minutes)\n",
      "Batch 69 with 10000 observations : Done! (0.07489628394444783 minutes)\n",
      "Batch 70 with 10000 observations : Done! (0.0761058489481608 minutes)\n",
      "Batch 71 with 10000 observations : Done! (0.16748555501302084 minutes)\n",
      "Batch 72 with 10000 observations : Done! (0.16651863257090252 minutes)\n",
      "Batch 73 with 10000 observations : Done! (0.1641687830289205 minutes)\n",
      "Batch 74 with 10000 observations : Done! (0.1655598799387614 minutes)\n",
      "Batch 75 with 10000 observations : Done! (0.16501259009043376 minutes)\n",
      "Batch 76 with 10000 observations : Done! (0.1640864570935567 minutes)\n",
      "Batch 77 with 10000 observations : Done! (0.07575997908910116 minutes)\n",
      "Batch 78 with 10000 observations : Done! (0.07560882965723674 minutes)\n",
      "Batch 79 with 10000 observations : Done! (0.07582070032755533 minutes)\n",
      "Batch 80 with 10000 observations : Done! (0.07619341611862182 minutes)\n",
      "Batch 81 with 10000 observations : Done! (0.07714889446894328 minutes)\n",
      "Batch 82 with 10000 observations : Done! (0.09098937511444091 minutes)\n",
      "Batch 83 with 10000 observations : Done! (0.0918812354405721 minutes)\n",
      "Batch 84 with 10000 observations : Done! (0.08916022777557372 minutes)\n",
      "Batch 85 with 10000 observations : Done! (0.10517423550287883 minutes)\n",
      "Batch 86 with 10000 observations : Done! (0.11147574583689372 minutes)\n",
      "Batch 87 with 10000 observations : Done! (0.09224526087443034 minutes)\n",
      "Batch 88 with 10000 observations : Done! (0.1035774827003479 minutes)\n",
      "Batch 89 with 10000 observations : Done! (0.10195973316828409 minutes)\n",
      "Batch 90 with 10000 observations : Done! (0.09120893478393555 minutes)\n",
      "Batch 91 with 10000 observations : Done! (0.0918707529703776 minutes)\n",
      "Batch 92 with 10000 observations : Done! (0.08862478733062744 minutes)\n",
      "Batch 93 with 10000 observations : Done! (0.09829578797022502 minutes)\n",
      "Batch 94 with 10000 observations : Done! (0.1285375197728475 minutes)\n",
      "Batch 95 with 10000 observations : Done! (0.09060995976130168 minutes)\n",
      "Batch 96 with 10000 observations : Done! (0.09115811189015706 minutes)\n",
      "Batch 97 with 10000 observations : Done! (0.09613715012868246 minutes)\n",
      "Batch 98 with 10000 observations : Done! (0.09343317349751791 minutes)\n",
      "Batch 99 with 10000 observations : Done! (0.09103975693384807 minutes)\n",
      "Batch 100 with 10000 observations : Done! (0.09113810857137045 minutes)\n",
      "Batch 101 with 10000 observations : Done! (0.09087826410929362 minutes)\n",
      "Batch 102 with 10000 observations : Done! (0.09010093212127686 minutes)\n",
      "Batch 103 with 10000 observations : Done! (0.09008748531341552 minutes)\n",
      "Batch 104 with 10000 observations : Done! (0.09209944407145182 minutes)\n",
      "Batch 105 with 10000 observations : Done! (0.08988049030303955 minutes)\n",
      "Batch 106 with 10000 observations : Done! (0.09064896504084269 minutes)\n",
      "Batch 107 with 10000 observations : Done! (0.08905165592829387 minutes)\n",
      "Batch 108 with 10000 observations : Done! (0.08925903638203939 minutes)\n",
      "Batch 109 with 10000 observations : Done! (0.091182808081309 minutes)\n",
      "Batch 110 with 10000 observations : Done! (0.10290406147638957 minutes)\n",
      "Batch 111 with 10000 observations : Done! (0.09038646618525187 minutes)\n",
      "Batch 112 with 10000 observations : Done! (0.09028691053390503 minutes)\n",
      "Batch 113 with 10000 observations : Done! (0.09180285135904948 minutes)\n",
      "Batch 114 with 10000 observations : Done! (0.17985866069793702 minutes)\n",
      "Batch 115 with 10000 observations : Done! (0.17864497105280558 minutes)\n",
      "Batch 116 with 10000 observations : Done! (0.1810248851776123 minutes)\n",
      "Batch 117 with 10000 observations : Done! (0.1766353686650594 minutes)\n",
      "Batch 118 with 10000 observations : Done! (0.17711735566457112 minutes)\n",
      "Batch 119 with 10000 observations : Done! (0.1319040815035502 minutes)\n",
      "Batch 120 with 10000 observations : Done! (0.09003601868947347 minutes)\n",
      "Batch 121 with 10000 observations : Done! (0.09183159669240316 minutes)\n",
      "Batch 122 with 10000 observations : Done! (0.09886121352513631 minutes)\n",
      "Batch 123 with 10000 observations : Done! (0.08982727527618409 minutes)\n",
      "Batch 124 with 10000 observations : Done! (0.09026165008544922 minutes)\n",
      "Batch 125 with 10000 observations : Done! (0.18616360028584797 minutes)\n",
      "Batch 126 with 10000 observations : Done! (0.18101732730865477 minutes)\n",
      "Batch 127 with 10000 observations : Done! (0.17546254793802898 minutes)\n",
      "Batch 128 with 10000 observations : Done! (0.18213647206624348 minutes)\n",
      "Batch 129 with 10000 observations : Done! (0.1840909997622172 minutes)\n",
      "Batch 130 with 10000 observations : Done! (0.1222118854522705 minutes)\n",
      "Batch 131 with 10000 observations : Done! (0.09799431562423706 minutes)\n",
      "Batch 132 with 10000 observations : Done! (0.09120421012242635 minutes)\n",
      "Batch 133 with 10000 observations : Done! (0.08973249594370523 minutes)\n",
      "Batch 134 with 10000 observations : Done! (0.08994220892588298 minutes)\n",
      "Batch 135 with 10000 observations : Done! (0.09419997930526733 minutes)\n",
      "Batch 136 with 10000 observations : Done! (0.17963244120279948 minutes)\n",
      "Batch 137 with 10000 observations : Done! (0.17685272693634033 minutes)\n",
      "Batch 138 with 10000 observations : Done! (0.17718352476755778 minutes)\n",
      "Batch 139 with 10000 observations : Done! (0.1958060105641683 minutes)\n",
      "Batch 140 with 10000 observations : Done! (0.17929827372233073 minutes)\n",
      "Batch 141 with 10000 observations : Done! (0.11697263320287068 minutes)\n",
      "Batch 142 with 10000 observations : Done! (0.08982401291529338 minutes)\n",
      "Batch 143 with 10000 observations : Done! (0.09101955890655518 minutes)\n",
      "Batch 144 with 10000 observations : Done! (0.09065638383229574 minutes)\n",
      "Batch 145 with 10000 observations : Done! (0.09050245682398478 minutes)\n",
      "Batch 146 with 10000 observations : Done! (0.09097338517506917 minutes)\n",
      "Batch 147 with 10000 observations : Done! (0.08945552905400594 minutes)\n",
      "Batch 148 with 10000 observations : Done! (0.08913986682891846 minutes)\n",
      "Batch 149 with 10000 observations : Done! (0.09001360336939494 minutes)\n",
      "Batch 150 with 10000 observations : Done! (0.09054449796676636 minutes)\n",
      "Batch 151 with 10000 observations : Done! (0.0906996210416158 minutes)\n",
      "Batch 152 with 10000 observations : Done! (0.08919143676757812 minutes)\n",
      "Batch 153 with 10000 observations : Done! (0.09029518365859986 minutes)\n",
      "Batch 154 with 10000 observations : Done! (0.08941398859024048 minutes)\n",
      "Batch 155 with 10000 observations : Done! (0.09167672793070475 minutes)\n",
      "Batch 156 with 10000 observations : Done! (0.09096587101618449 minutes)\n",
      "Batch 157 with 10000 observations : Done! (0.08950766324996948 minutes)\n",
      "Batch 158 with 10000 observations : Done! (0.08994554281234741 minutes)\n",
      "Batch 159 with 10000 observations : Done! (0.09015959103902181 minutes)\n",
      "Batch 160 with 10000 observations : Done! (0.09068479935328165 minutes)\n",
      "Batch 161 with 10000 observations : Done! (0.09168117841084798 minutes)\n",
      "Batch 162 with 10000 observations : Done! (0.08953611056009929 minutes)\n",
      "Batch 163 with 10000 observations : Done! (0.09015367031097413 minutes)\n",
      "Batch 164 with 10000 observations : Done! (0.09450618426005046 minutes)\n",
      "Batch 165 with 10000 observations : Done! (0.09180339177449544 minutes)\n",
      "Batch 166 with 10000 observations : Done! (0.09315782388051351 minutes)\n",
      "Batch 167 with 10000 observations : Done! (0.08915881315867107 minutes)\n",
      "Batch 168 with 10000 observations : Done! (0.09020740191141764 minutes)\n",
      "Batch 169 with 10000 observations : Done! (0.08994322220484416 minutes)\n",
      "Batch 170 with 10000 observations : Done! (0.09009665648142497 minutes)\n",
      "Batch 171 with 10000 observations : Done! (0.09167944590250651 minutes)\n",
      "Batch 172 with 10000 observations : Done! (0.09066276947657267 minutes)\n",
      "Batch 173 with 10000 observations : Done! (0.09145960013071695 minutes)\n",
      "Batch 174 with 10000 observations : Done! (0.08958270947138468 minutes)\n",
      "Batch 175 with 10000 observations : Done! (0.09094208478927612 minutes)\n",
      "Batch 176 with 10000 observations : Done! (0.09045770565668741 minutes)\n",
      "Batch 177 with 10000 observations : Done! (0.09018765687942505 minutes)\n",
      "Batch 178 with 10000 observations : Done! (0.0931558092435201 minutes)\n",
      "Batch 179 with 10000 observations : Done! (0.09517110586166382 minutes)\n",
      "Batch 180 with 10000 observations : Done! (0.09119629859924316 minutes)\n",
      "Batch 181 with 10000 observations : Done! (0.09232542117436728 minutes)\n",
      "Batch 182 with 10000 observations : Done! (0.090313720703125 minutes)\n",
      "Batch 183 with 10000 observations : Done! (0.09200990597407023 minutes)\n",
      "Batch 184 with 10000 observations : Done! (0.09005678097407023 minutes)\n",
      "Batch 185 with 10000 observations : Done! (0.09527000983556112 minutes)\n",
      "Batch 186 with 10000 observations : Done! (0.09044891198476156 minutes)\n",
      "Batch 187 with 10000 observations : Done! (0.09945946137110392 minutes)\n",
      "Batch 188 with 10000 observations : Done! (0.09080236355463664 minutes)\n",
      "Batch 189 with 10000 observations : Done! (0.1780062993367513 minutes)\n",
      "Batch 190 with 10000 observations : Done! (0.17767191727956136 minutes)\n",
      "Batch 191 with 10000 observations : Done! (0.17977420886357626 minutes)\n",
      "Batch 192 with 10000 observations : Done! (0.17943105300267537 minutes)\n",
      "Batch 193 with 10000 observations : Done! (0.17892178297042846 minutes)\n",
      "Batch 194 with 10000 observations : Done! (0.12686185042063394 minutes)\n",
      "Batch 195 with 10000 observations : Done! (0.08910841941833496 minutes)\n",
      "Batch 196 with 10000 observations : Done! (0.09076708555221558 minutes)\n",
      "Batch 197 with 10000 observations : Done! (0.09517165025075276 minutes)\n",
      "Batch 198 with 10000 observations : Done! (0.08960583607355753 minutes)\n",
      "Batch 199 with 10000 observations : Done! (0.09128438234329224 minutes)\n",
      "Batch 200 with 10000 observations : Done! (0.09047776858011881 minutes)\n",
      "Batch 201 with 10000 observations : Done! (0.09303471644719442 minutes)\n",
      "Batch 202 with 10000 observations : Done! (0.08992050488789877 minutes)\n",
      "Batch 203 with 10000 observations : Done! (0.09017696380615234 minutes)\n",
      "Batch 204 with 10000 observations : Done! (0.08955945173899332 minutes)\n",
      "Batch 205 with 10000 observations : Done! (0.0911775549252828 minutes)\n",
      "Batch 206 with 10000 observations : Done! (0.09046138525009155 minutes)\n",
      "Batch 207 with 10000 observations : Done! (0.08982028166453043 minutes)\n",
      "Batch 208 with 10000 observations : Done! (0.09042652050654093 minutes)\n",
      "Batch 209 with 10000 observations : Done! (0.09653192361195882 minutes)\n",
      "Batch 210 with 10000 observations : Done! (0.09201131264368693 minutes)\n",
      "Batch 211 with 10000 observations : Done! (0.09234495162963867 minutes)\n",
      "Batch 212 with 10000 observations : Done! (0.09177318811416627 minutes)\n",
      "Batch 213 with 10000 observations : Done! (0.09176597197850546 minutes)\n",
      "Batch 214 with 10000 observations : Done! (0.0924531896909078 minutes)\n",
      "Batch 215 with 10000 observations : Done! (0.09220088322957357 minutes)\n",
      "Batch 216 with 10000 observations : Done! (0.09176281690597535 minutes)\n",
      "Batch 217 with 10000 observations : Done! (0.09033290545145671 minutes)\n",
      "Batch 218 with 10000 observations : Done! (0.09223560492197673 minutes)\n",
      "Batch 219 with 10000 observations : Done! (0.0925600012143453 minutes)\n",
      "Batch 220 with 10000 observations : Done! (0.09172572294871012 minutes)\n",
      "Batch 221 with 10000 observations : Done! (0.09301885763804117 minutes)\n",
      "Batch 222 with 10000 observations : Done! (0.18463253180185954 minutes)\n",
      "Batch 223 with 10000 observations : Done! (0.20407063563664754 minutes)\n",
      "Batch 224 with 10000 observations : Done! (0.1822745084762573 minutes)\n",
      "Batch 225 with 10000 observations : Done! (0.18197837670644124 minutes)\n",
      "Batch 226 with 10000 observations : Done! (0.19131207863489788 minutes)\n",
      "Batch 227 with 10000 observations : Done! (0.10112402041753134 minutes)\n",
      "Batch 228 with 10000 observations : Done! (0.10107351144154866 minutes)\n",
      "Batch 229 with 10000 observations : Done! (0.0992782711982727 minutes)\n",
      "Batch 230 with 10000 observations : Done! (0.10161926349004109 minutes)\n",
      "Batch 231 with 10000 observations : Done! (0.20488021771113077 minutes)\n",
      "Batch 232 with 10000 observations : Done! (0.19336191018422444 minutes)\n",
      "Batch 233 with 10000 observations : Done! (0.19411122798919678 minutes)\n",
      "Batch 234 with 10000 observations : Done! (0.1846355398495992 minutes)\n",
      "Batch 235 with 10000 observations : Done! (0.2131385644276937 minutes)\n",
      "Batch 236 with 10000 observations : Done! (0.10215485493342082 minutes)\n",
      "Batch 237 with 10000 observations : Done! (0.09971534411112468 minutes)\n",
      "Batch 238 with 10000 observations : Done! (0.1888424555460612 minutes)\n",
      "Batch 239 with 10000 observations : Done! (0.18472460508346558 minutes)\n",
      "Batch 240 with 10000 observations : Done! (0.2283476988474528 minutes)\n",
      "Batch 241 with 10000 observations : Done! (0.18422780831654867 minutes)\n",
      "Batch 242 with 10000 observations : Done! (0.18801600138346355 minutes)\n",
      "Batch 243 with 10000 observations : Done! (0.09705746571222941 minutes)\n",
      "Batch 244 with 10000 observations : Done! (0.09556509256362915 minutes)\n",
      "Batch 245 with 10000 observations : Done! (0.09654612143834432 minutes)\n",
      "Batch 246 with 10000 observations : Done! (0.20279534657796225 minutes)\n",
      "Batch 247 with 10000 observations : Done! (0.20445890426635743 minutes)\n",
      "Batch 248 with 10000 observations : Done! (0.19359255234400433 minutes)\n",
      "Batch 249 with 10000 observations : Done! (0.18834232091903685 minutes)\n",
      "Batch 250 with 10000 observations : Done! (0.18465958833694457 minutes)\n",
      "Batch 251 with 10000 observations : Done! (0.09472162326176961 minutes)\n",
      "Batch 252 with 10000 observations : Done! (0.09409728844960531 minutes)\n",
      "Batch 253 with 10000 observations : Done! (0.0927351713180542 minutes)\n",
      "Batch 254 with 10000 observations : Done! (0.09438653389612833 minutes)\n",
      "Batch 255 with 10000 observations : Done! (0.09142253398895264 minutes)\n",
      "Batch 256 with 10000 observations : Done! (0.09122799237569174 minutes)\n",
      "Batch 257 with 10000 observations : Done! (0.0926480491956075 minutes)\n",
      "Batch 258 with 10000 observations : Done! (0.09194103479385377 minutes)\n",
      "Batch 259 with 10000 observations : Done! (0.09223960240681967 minutes)\n",
      "Batch 260 with 10000 observations : Done! (0.09376408259073893 minutes)\n",
      "Batch 261 with 10000 observations : Done! (0.09294646978378296 minutes)\n",
      "Batch 262 with 10000 observations : Done! (0.09157719612121581 minutes)\n",
      "Batch 263 with 10000 observations : Done! (0.09196268717447917 minutes)\n",
      "Batch 264 with 10000 observations : Done! (0.09283065795898438 minutes)\n",
      "Batch 265 with 10000 observations : Done! (0.0955503503481547 minutes)\n",
      "Batch 266 with 10000 observations : Done! (0.09280765056610107 minutes)\n",
      "Batch 267 with 10000 observations : Done! (0.0940064549446106 minutes)\n",
      "Batch 268 with 10000 observations : Done! (0.09116324583689371 minutes)\n",
      "Batch 269 with 10000 observations : Done! (0.09175384442011515 minutes)\n",
      "Batch 270 with 10000 observations : Done! (0.09000131686528524 minutes)\n",
      "Batch 271 with 10000 observations : Done! (0.09536587397257487 minutes)\n",
      "Batch 272 with 10000 observations : Done! (0.09147744576136271 minutes)\n",
      "Batch 273 with 10000 observations : Done! (0.09095432758331298 minutes)\n",
      "Batch 274 with 10000 observations : Done! (0.09071848789850871 minutes)\n",
      "Batch 275 with 10000 observations : Done! (0.09028471708297729 minutes)\n",
      "Batch 276 with 10000 observations : Done! (0.11936160723368326 minutes)\n",
      "Batch 277 with 10000 observations : Done! (0.09342757066090902 minutes)\n",
      "Batch 278 with 10000 observations : Done! (0.08931453625361124 minutes)\n",
      "Batch 279 with 10000 observations : Done! (0.0903557538986206 minutes)\n",
      "Batch 280 with 10000 observations : Done! (0.09082303444544475 minutes)\n",
      "Batch 281 with 10000 observations : Done! (0.09038394292195638 minutes)\n",
      "Batch 282 with 10000 observations : Done! (0.09050230979919434 minutes)\n",
      "Batch 283 with 10000 observations : Done! (0.08990761439005533 minutes)\n",
      "Batch 284 with 10000 observations : Done! (0.08910819292068481 minutes)\n",
      "Batch 285 with 10000 observations : Done! (0.09066171248753865 minutes)\n",
      "Batch 286 with 10000 observations : Done! (0.09037803014119467 minutes)\n",
      "Batch 287 with 10000 observations : Done! (0.0899481733640035 minutes)\n",
      "Batch 288 with 10000 observations : Done! (0.1940075914065043 minutes)\n",
      "Batch 289 with 10000 observations : Done! (0.17857941786448162 minutes)\n",
      "Batch 290 with 10000 observations : Done! (0.17912911574045817 minutes)\n",
      "Batch 291 with 10000 observations : Done! (0.1804498235384623 minutes)\n",
      "Batch 292 with 10000 observations : Done! (0.17653435468673706 minutes)\n",
      "Batch 293 with 10000 observations : Done! (0.11410064299901326 minutes)\n",
      "Batch 294 with 10000 observations : Done! (0.08982998530069987 minutes)\n",
      "Batch 295 with 10000 observations : Done! (0.09003048737843831 minutes)\n",
      "Batch 296 with 10000 observations : Done! (0.09102356831232707 minutes)\n",
      "Batch 297 with 10000 observations : Done! (0.08977135817209879 minutes)\n",
      "Batch 298 with 10000 observations : Done! (0.0893719474474589 minutes)\n",
      "Batch 299 with 10000 observations : Done! (0.08983433246612549 minutes)\n",
      "Batch 300 with 10000 observations : Done! (0.09011157353719075 minutes)\n",
      "Batch 301 with 10000 observations : Done! (0.09048184951146444 minutes)\n",
      "Batch 302 with 10000 observations : Done! (0.08940385580062866 minutes)\n",
      "Batch 303 with 10000 observations : Done! (0.0906661073366801 minutes)\n",
      "Batch 304 with 10000 observations : Done! (0.09070308605829874 minutes)\n",
      "Batch 305 with 10000 observations : Done! (0.09011030594507853 minutes)\n",
      "Batch 306 with 10000 observations : Done! (0.09056288003921509 minutes)\n",
      "Batch 307 with 10000 observations : Done! (0.09011687437693278 minutes)\n",
      "Batch 308 with 10000 observations : Done! (0.08920950889587402 minutes)\n",
      "Batch 309 with 10000 observations : Done! (0.08989884455998738 minutes)\n",
      "Batch 310 with 10000 observations : Done! (0.09009631077448527 minutes)\n",
      "Batch 311 with 10000 observations : Done! (0.08953843116760254 minutes)\n",
      "Batch 312 with 10000 observations : Done! (0.09012029568354289 minutes)\n",
      "Batch 313 with 10000 observations : Done! (0.09150035381317138 minutes)\n",
      "Batch 314 with 10000 observations : Done! (0.08982876141866049 minutes)\n",
      "Batch 315 with 10000 observations : Done! (0.0902193824450175 minutes)\n",
      "Batch 316 with 10000 observations : Done! (0.10030804077784221 minutes)\n",
      "Batch 317 with 10000 observations : Done! (0.09087843100229899 minutes)\n",
      "Batch 318 with 10000 observations : Done! (0.09071056842803955 minutes)\n",
      "Batch 319 with 10000 observations : Done! (0.09284945329030354 minutes)\n",
      "Batch 320 with 10000 observations : Done! (0.08895597457885743 minutes)\n",
      "Batch 321 with 10000 observations : Done! (0.09214619795481364 minutes)\n",
      "Batch 322 with 10000 observations : Done! (0.09837629795074462 minutes)\n",
      "Batch 323 with 10000 observations : Done! (0.0904118299484253 minutes)\n",
      "Batch 324 with 10000 observations : Done! (0.09060530265172323 minutes)\n",
      "Batch 325 with 10000 observations : Done! (0.09003967046737671 minutes)\n",
      "Batch 326 with 10000 observations : Done! (0.09043744007746378 minutes)\n",
      "Batch 327 with 10000 observations : Done! (0.09097795486450196 minutes)\n",
      "Batch 328 with 10000 observations : Done! (0.09090047677357992 minutes)\n",
      "Batch 329 with 10000 observations : Done! (0.08890434106190999 minutes)\n",
      "Batch 330 with 10000 observations : Done! (0.08983275095621744 minutes)\n",
      "Batch 331 with 10000 observations : Done! (0.0906319538752238 minutes)\n",
      "Batch 332 with 10000 observations : Done! (0.09230297009150187 minutes)\n",
      "Batch 333 with 10000 observations : Done! (0.09824591875076294 minutes)\n",
      "Batch 334 with 10000 observations : Done! (0.09167515436808268 minutes)\n",
      "Batch 335 with 10000 observations : Done! (0.08976436456044515 minutes)\n",
      "Batch 336 with 10000 observations : Done! (0.09085871378580729 minutes)\n",
      "Batch 337 with 10000 observations : Done! (0.09054495890935262 minutes)\n",
      "Batch 338 with 10000 observations : Done! (0.08932256698608398 minutes)\n",
      "Batch 339 with 10000 observations : Done! (0.09088515837987264 minutes)\n",
      "Batch 340 with 10000 observations : Done! (0.09339989423751831 minutes)\n",
      "Batch 341 with 10000 observations : Done! (0.09049037694931031 minutes)\n",
      "Batch 342 with 10000 observations : Done! (0.09149801333745321 minutes)\n",
      "Batch 343 with 10000 observations : Done! (0.09171346823374431 minutes)\n",
      "Batch 344 with 10000 observations : Done! (0.09002094268798828 minutes)\n",
      "Batch 345 with 10000 observations : Done! (0.09848012526830037 minutes)\n",
      "Batch 346 with 10000 observations : Done! (0.08981677691141764 minutes)\n",
      "1933 observations: Done! (0.018567967414855956 minutes)\n",
      "Time for hlth_cd_asdr2: 40.33 minutes\n",
      "Total execution time: 91.01751405795416 minutes\n"
     ]
    }
   ],
   "source": [
    "# Import NUTS Indicator codes metadata\n",
    "isNUTS = True\n",
    "batch_size = 10000\n",
    "\n",
    "number_of_nuts_observations = 0\n",
    "observations_per_nuts_indicator = {}\n",
    "series_metadata_expected_nuts = []\n",
    "\n",
    "# if statement is commented out, needed in case there are NUTS indicators correlated to multiple EU SDG indicators\n",
    "# filtering_params is commented out, needed in case specific filtering parameters are applied for each NUTS Indicator dataset\n",
    "\n",
    "st1 = time.time()\n",
    "for online_code, eu_code in codes_nuts_dict.items():\n",
    "    # if isinstance(eu_code, list): \n",
    "    #     for i, element in enumerate(eu_code):\n",
    "    #         #filtering_params_i = filter_params[online_code][i] if filter_params[online_code] else None #needed if filtering parameters are applied in NUTS datasets\n",
    "    #         df_eucode = preprocessing_eurostat_data(online_code, available_geoCodes=available_nuts, is_local_level=isNUTS,\n",
    "    #                                                       #filtering_params=filtering_params_i)\n",
    "    #         )\n",
    "    #         if df_eucode is not None:\n",
    "    #             number_of_nuts_observations += len(df_eucode)\n",
    "    #             st = time.time()\n",
    "    #             import_sm_obs(df_eucode, online_code, batch_size=batch_size, driver=driver)\n",
    "    #             et = time.time()\n",
    "    #             elapsed_time = et - st\n",
    "    #             print(f'Time for {online_code}-{element}: {elapsed_time/60:.2f} minutes')\n",
    "    # else:\n",
    "    #     #filtering_params_single = filter_params[online_code] if filter_params[online_code] else None #needed if filtering parameters are applied in NUTS datasets\n",
    "        df_eucode = preprocessing_eurostat_data(online_code, available_geoCodes=available_nuts, is_local_level=isNUTS,\n",
    "                                                      #filtering_params=filtering_params_single)\n",
    "        )\n",
    "        if df_eucode is not None:\n",
    "            number_of_nuts_observations += len(df_eucode)\n",
    "            observations_per_nuts_indicator[online_code] = len(df_eucode)\n",
    "\n",
    "            for _, r in df_eucode.iterrows():  # check per series metadata, add dimensions dim_cod and att_code\n",
    "                series_metadata_expected_nuts.append({\n",
    "                'indicator': online_code,\n",
    "                'dim_code': r['dim_codes'],\n",
    "                'att_code': r['att_codes']\n",
    "                })\n",
    "\n",
    "            st = time.time()\n",
    "\n",
    "            import_sm_obs(df_eucode, online_code, batch_size=batch_size, driver=driver)\n",
    "\n",
    "            et = time.time()\n",
    "            elapsed_time = et - st\n",
    "            \n",
    "            print(f'Time for {online_code}: {elapsed_time/60:.2f} minutes')\n",
    "\n",
    "et1 = time.time()\n",
    "elapsed_time_total = et1 - st1\n",
    "print('Total execution time:', elapsed_time_total / 60, 'minutes')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Checking for NUTS Indicator observations that weren't imported properly to the graph ('mismatches' between graph and Eurostat database)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NUTS regional dataset Indicator nodes created: 19, expected: 19 as of 2025.\n"
     ]
    }
   ],
   "source": [
    "records=driver.execute_query(\"\"\"\\\n",
    "    MATCH (:Source {name: 'EU_SDG'})<-[:COMES_FROM]-(i1:Indicator)-[r:ASSOCIATED_WITH]-(i2:Indicator)\n",
    "    WHERE i1.code CONTAINS \"sdg\" AND r.relevance='correspondant'\n",
    "    RETURN COUNT(DISTINCT i2) AS total_i2_matched\n",
    "    \"\"\",routing_=\"r\",database_=database_name,result_transformer_=neo4j.Result.to_df)\n",
    "print(\"NUTS regional dataset Indicator nodes created: {number}, expected: {expected} as of 2025.\".format(\n",
    "    number=records['total_i2_matched'].iloc[0],\n",
    "    expected=len(nuts_df)\n",
    "))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Individual indicator records:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>indicator</th>\n",
       "      <th>refer</th>\n",
       "      <th>has_obs</th>\n",
       "      <th>obs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>375120</td>\n",
       "      <td>375120</td>\n",
       "      <td>375120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>edat_lfse_04</td>\n",
       "      <td>507263</td>\n",
       "      <td>507263</td>\n",
       "      <td>507263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>edat_lfse_16</td>\n",
       "      <td>23446</td>\n",
       "      <td>23446</td>\n",
       "      <td>23446</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>edat_lfse_22</td>\n",
       "      <td>101950</td>\n",
       "      <td>101950</td>\n",
       "      <td>101950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>educ_uoe_enra22</td>\n",
       "      <td>2985</td>\n",
       "      <td>2985</td>\n",
       "      <td>2985</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hlth_cd_asdr2</td>\n",
       "      <td>3461934</td>\n",
       "      <td>3461934</td>\n",
       "      <td>3461934</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>hlth_silc_08b_r</td>\n",
       "      <td>729</td>\n",
       "      <td>729</td>\n",
       "      <td>729</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ilc_li41</td>\n",
       "      <td>3588</td>\n",
       "      <td>3588</td>\n",
       "      <td>3588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ilc_lvhl21n</td>\n",
       "      <td>2295</td>\n",
       "      <td>2295</td>\n",
       "      <td>2295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ilc_mdsd18</td>\n",
       "      <td>2164</td>\n",
       "      <td>2164</td>\n",
       "      <td>2164</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ilc_peps11n</td>\n",
       "      <td>2290</td>\n",
       "      <td>2290</td>\n",
       "      <td>2290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>lfst_r_lfe2emprt</td>\n",
       "      <td>345153</td>\n",
       "      <td>345153</td>\n",
       "      <td>345153</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>lfst_r_lfu2ltu</td>\n",
       "      <td>1266726</td>\n",
       "      <td>1266726</td>\n",
       "      <td>1266726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>nama_10r_2gdp</td>\n",
       "      <td>58166</td>\n",
       "      <td>58166</td>\n",
       "      <td>58166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>rd_e_gerdreg</td>\n",
       "      <td>202759</td>\n",
       "      <td>202759</td>\n",
       "      <td>202759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>rd_p_persreg</td>\n",
       "      <td>462936</td>\n",
       "      <td>462936</td>\n",
       "      <td>462936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>tepsr_lm220</td>\n",
       "      <td>5585</td>\n",
       "      <td>5585</td>\n",
       "      <td>5585</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>46341</td>\n",
       "      <td>46341</td>\n",
       "      <td>46341</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>27033</td>\n",
       "      <td>27033</td>\n",
       "      <td>27033</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           indicator    refer  has_obs      obs\n",
       "0      aei_pr_soiler   375120   375120   375120\n",
       "1       edat_lfse_04   507263   507263   507263\n",
       "2       edat_lfse_16    23446    23446    23446\n",
       "3       edat_lfse_22   101950   101950   101950\n",
       "4    educ_uoe_enra22     2985     2985     2985\n",
       "5      hlth_cd_asdr2  3461934  3461934  3461934\n",
       "6    hlth_silc_08b_r      729      729      729\n",
       "7           ilc_li41     3588     3588     3588\n",
       "8        ilc_lvhl21n     2295     2295     2295\n",
       "9         ilc_mdsd18     2164     2164     2164\n",
       "10       ilc_peps11n     2290     2290     2290\n",
       "11  lfst_r_lfe2emprt   345153   345153   345153\n",
       "12    lfst_r_lfu2ltu  1266726  1266726  1266726\n",
       "13     nama_10r_2gdp    58166    58166    58166\n",
       "14      rd_e_gerdreg   202759   202759   202759\n",
       "15      rd_p_persreg   462936   462936   462936\n",
       "16       tepsr_lm220     5585     5585     5585\n",
       "17       tran_r_acci    46341    46341    46341\n",
       "18      trng_lfse_04    27033    27033    27033"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Checking outgoing relationships for NUTS Indicators\n",
    "records = driver.execute_query(\"\"\"\\\n",
    "    MATCH (so:Source{name:'EU_SDG'})<-[:COMES_FROM]-(i:Indicator)-[:ASSOCIATED_WITH]-(i2:Indicator)--(s:Series)--(sm:SeriesMetadata)-[r:HAS_OBSERVATION]-(o:Observation)-[r1:REFERS_TO_AREA]->(ga)\n",
    "    WHERE ((ga:NUTS1) or (ga:NUTS2) or (ga:NUTS3))\n",
    "    RETURN s.code as indicator, COUNT(DISTINCT r1) as refer, COUNT(DISTINCT r) as has_obs,count(distinct o) as obs\n",
    "    order by indicator\n",
    "        \"\"\",routing_=\"r\",database_=database_name,\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "print(\"Individual indicator records:\")\n",
    "records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "# checking for data that weren't imported correctly to the graph for each NUTS Indicator per series metadata from Eurostat database, labeled 'mismatches'\n",
    "check_df_nuts = pd.DataFrame(series_metadata_expected_nuts)\n",
    "check_df_nuts['to_import'] = 1  \n",
    "check_df_nuts['imported'] = 0   \n",
    "\n",
    "# group expected counts per (indicator), (dim_code, att_code)->series metadata\n",
    "expected_grouped_nuts = check_df_nuts.groupby(['indicator', 'dim_code', 'att_code']).size().reset_index(name='to_import')\n",
    "expected_grouped_nuts['imported'] = 0  # initialize column to store actual counts\n",
    "\n",
    "check_statement_nuts = \"\"\"\n",
    "UNWIND $parameters AS row\n",
    "MATCH (i:Indicator {code: row.indicator})--(s:Series)--(sm:SeriesMetadata)--(o:Observation)\n",
    "WHERE sm.dimensionsCode = row.dim_code AND sm.attributesCode = row.att_code\n",
    "RETURN s.code AS series_code, count(distinct o) AS total\n",
    "\"\"\"\n",
    "\n",
    "results = []\n",
    "\n",
    "# check imported counts per (indicator), (dim_code, att_code)->series metadata\n",
    "for idx, row in expected_grouped_nuts.iterrows():\n",
    "    params = {\n",
    "        \"indicator\": str(row['indicator']),\n",
    "        \"dim_code\": str(row['dim_code']),\n",
    "        \"att_code\": str(row['att_code'])\n",
    "    }\n",
    "    records, summary, keys = driver.execute_query(\n",
    "        check_statement_nuts,\n",
    "        parameters=params,  \n",
    "        database_=database_name,\n",
    "        routing_=\"r\"\n",
    "    )\n",
    "    for r in records:\n",
    "        results.append({\n",
    "            \"indicator\": row['indicator'],\n",
    "            \"dim_code\": row['dim_code'],\n",
    "            \"att_code\": row['att_code'],\n",
    "            \"to_import\": row['to_import'],\n",
    "            \"series_code\": r['series_code'],\n",
    "            \"imported\": r['total']\n",
    "        })\n",
    "\n",
    "check_df_nuts_final = pd.DataFrame(results)\n",
    "\n",
    "# add seriesmetadata column\n",
    "check_df_nuts_final['seriesmetadata'] = check_df_nuts_final['dim_code'] + \"|\" + check_df_nuts_final['att_code']\n",
    "\n",
    "# add eu sdg indicator column \n",
    "check_df_nuts_final['eu sdg indicator'] = check_df_nuts_final['indicator'].map(codes_nuts_dict)\n",
    "\n",
    "check_df_nuts_final = check_df_nuts_final[\n",
    "    ['indicator', 'eu sdg indicator', 'series_code', 'dim_code', 'att_code', 'seriesmetadata', 'to_import', 'imported']\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total UN SDG observations imported in SustainGraph 6898463 , expected: 6898463\n",
      "Mismatches: 0\n"
     ]
    }
   ],
   "source": [
    "total_observations_imported = check_df_nuts_final['imported'].sum()\n",
    "total_observations_to_import = check_df_nuts_final['to_import'].sum()\n",
    "print(\"Total UN SDG observations imported in SustainGraph\", total_observations_imported, \", expected:\",total_observations_to_import)\n",
    "\n",
    "mismatches = check_df_nuts_final[check_df_nuts_final['to_import'] != check_df_nuts_final['imported']]\n",
    "if len(mismatches)==0:\n",
    "    print(\"Mismatches: 0\")\n",
    "else:\n",
    "    print(\"\\nMismatches:\\n\", mismatches)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>indicator</th>\n",
       "      <th>eu sdg indicator</th>\n",
       "      <th>series_code</th>\n",
       "      <th>dim_code</th>\n",
       "      <th>att_code</th>\n",
       "      <th>seriesmetadata</th>\n",
       "      <th>to_import</th>\n",
       "      <th>imported</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>CLC23_321|A|MOD</td>\n",
       "      <td>HA</td>\n",
       "      <td>CLC23_321|A|MOD|HA</td>\n",
       "      <td>4689</td>\n",
       "      <td>4689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>CLC23_321|A|MOD</td>\n",
       "      <td>KM2</td>\n",
       "      <td>CLC23_321|A|MOD|KM2</td>\n",
       "      <td>4689</td>\n",
       "      <td>4689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>CLC23_321|A|MOD</td>\n",
       "      <td>PC</td>\n",
       "      <td>CLC23_321|A|MOD|PC</td>\n",
       "      <td>4689</td>\n",
       "      <td>4689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>CLC23_321|A|MOD</td>\n",
       "      <td>T</td>\n",
       "      <td>CLC23_321|A|MOD|T</td>\n",
       "      <td>4689</td>\n",
       "      <td>4689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>sdg_15_50</td>\n",
       "      <td>aei_pr_soiler</td>\n",
       "      <td>CLC23_321|A|MOD</td>\n",
       "      <td>T_HA</td>\n",
       "      <td>CLC23_321|A|MOD|T_HA</td>\n",
       "      <td>4689</td>\n",
       "      <td>4689</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1475</th>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>sdg_11_40</td>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>A|KIL</td>\n",
       "      <td>NR</td>\n",
       "      <td>A|KIL|NR</td>\n",
       "      <td>11816</td>\n",
       "      <td>11816</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1476</th>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>sdg_11_40</td>\n",
       "      <td>tran_r_acci</td>\n",
       "      <td>A|KIL</td>\n",
       "      <td>P_MHAB</td>\n",
       "      <td>A|KIL|P_MHAB</td>\n",
       "      <td>11526</td>\n",
       "      <td>11526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1477</th>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>sdg_04_60</td>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>Y25-64|A|F</td>\n",
       "      <td>PC</td>\n",
       "      <td>Y25-64|A|F|PC</td>\n",
       "      <td>8970</td>\n",
       "      <td>8970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1478</th>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>sdg_04_60</td>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>Y25-64|A|M</td>\n",
       "      <td>PC</td>\n",
       "      <td>Y25-64|A|M|PC</td>\n",
       "      <td>8887</td>\n",
       "      <td>8887</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1479</th>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>sdg_04_60</td>\n",
       "      <td>trng_lfse_04</td>\n",
       "      <td>Y25-64|A|T</td>\n",
       "      <td>PC</td>\n",
       "      <td>Y25-64|A|T|PC</td>\n",
       "      <td>9176</td>\n",
       "      <td>9176</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1480 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          indicator eu sdg indicator    series_code         dim_code att_code  \\\n",
       "0     aei_pr_soiler        sdg_15_50  aei_pr_soiler  CLC23_321|A|MOD       HA   \n",
       "1     aei_pr_soiler        sdg_15_50  aei_pr_soiler  CLC23_321|A|MOD      KM2   \n",
       "2     aei_pr_soiler        sdg_15_50  aei_pr_soiler  CLC23_321|A|MOD       PC   \n",
       "3     aei_pr_soiler        sdg_15_50  aei_pr_soiler  CLC23_321|A|MOD        T   \n",
       "4     aei_pr_soiler        sdg_15_50  aei_pr_soiler  CLC23_321|A|MOD     T_HA   \n",
       "...             ...              ...            ...              ...      ...   \n",
       "1475    tran_r_acci        sdg_11_40    tran_r_acci            A|KIL       NR   \n",
       "1476    tran_r_acci        sdg_11_40    tran_r_acci            A|KIL   P_MHAB   \n",
       "1477   trng_lfse_04        sdg_04_60   trng_lfse_04       Y25-64|A|F       PC   \n",
       "1478   trng_lfse_04        sdg_04_60   trng_lfse_04       Y25-64|A|M       PC   \n",
       "1479   trng_lfse_04        sdg_04_60   trng_lfse_04       Y25-64|A|T       PC   \n",
       "\n",
       "            seriesmetadata  to_import  imported  \n",
       "0       CLC23_321|A|MOD|HA       4689      4689  \n",
       "1      CLC23_321|A|MOD|KM2       4689      4689  \n",
       "2       CLC23_321|A|MOD|PC       4689      4689  \n",
       "3        CLC23_321|A|MOD|T       4689      4689  \n",
       "4     CLC23_321|A|MOD|T_HA       4689      4689  \n",
       "...                    ...        ...       ...  \n",
       "1475              A|KIL|NR      11816     11816  \n",
       "1476          A|KIL|P_MHAB      11526     11526  \n",
       "1477         Y25-64|A|F|PC       8970      8970  \n",
       "1478         Y25-64|A|M|PC       8887      8887  \n",
       "1479         Y25-64|A|T|PC       9176      9176  \n",
       "\n",
       "[1480 rows x 8 columns]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "check_df_nuts_final"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv (3.12.7)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
