{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import eurostat\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "import neo4j\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import time\n",
    "import pycountry\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path\n",
    "import glob\n",
    "import warnings\n",
    "\n",
    "# Ignore all warnings\n",
    "warnings.filterwarnings(\"ignore\")\n",
    "\n",
    "from functions import import_sm_obs,import_happiness_score,preprocessing_happiness,country_code_converter,preprocessing_eurostat_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to neo4j\n"
     ]
    }
   ],
   "source": [
    "#load the environment variables\n",
    "dotenv_path = Path('~/.env')\n",
    "load_dotenv(dotenv_path=dotenv_path)  # This line brings all environment variables from .env into os.environ\n",
    "\n",
    "# Get variables\n",
    "SUSTAINGRAPH_URI = os.getenv('SUSTAINGRAPH_URI')\n",
    "SUSTAINGRAPH_USER = os.getenv('SUSTAINGRAPH_USER')\n",
    "SUSTAINGRAPH_PASSWORD = os.getenv('SUSTAINGRAPH_PASSWORD')\n",
    "database_name = os.getenv('DATABASE_NAME')\n",
    "\n",
    "# Connect to database\n",
    "driver = GraphDatabase.driver(SUSTAINGRAPH_URI, auth=(SUSTAINGRAPH_USER, SUSTAINGRAPH_PASSWORD))\n",
    "\n",
    "# Verify connectivity\n",
    "with driver.session(database=database_name) as session:\n",
    "    print(session.run(\"RETURN 'Connected to ' + $db\", db=database_name).single()[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write batch function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_tps_indicators(tx,statement, params_dict):\n",
    "    tx.run(statement, parameters=params_dict)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Since we have populated the graph with the EU, UN SDGs,it's time to enrich the Knoweledge graph with data coming from other sources, like the World Hapiness Report.\n",
    "> Create TPS Source node\n",
    "\n",
    "Before importing indicators coming from third party sources, the Source node with property name: \"TPS\" is created and all these indicators will be connected with this node through the relationship 'COMES_FROM'."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created 1 nodes in 1 ms.\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "        MERGE (s:Source{name:'TPS'})\n",
    "        RETURN count(s) as Source_Data\n",
    "        \"\"\")\n",
    "print(\"Created {nodes_created} nodes in {time} ms.\".format(\n",
    "    nodes_created=summary.counters.nodes_created,\n",
    "    time=summary.result_available_after\n",
    "))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Hapiness Score indicator"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### World Hapiness Report\n",
    "\n",
    "The [World Hapiness Report](https://worldhappiness.report) is a publication of the Sustainable Development Solutions Network, powered by the Gallup World Poll data. It uses global survey data to report how people evaluate their own lives in more than 150 countries worldwide.\n",
    "The global survey data are stored in an excel file, that we are going to import into the neo4j with the help of the py2neo library of python.\n",
    "\n",
    "#### Pycountry Library\n",
    "\n",
    "Before importing the data, it is required to map the country names to the ISO-alpha 3 codes. The ISOCode3 are unique for each country, while the country names may differ between different data sources. The [pycountry](https://pypi.org/project/pycountry/) is library of python that provides the ISO databases for countries, subdivision of countries etc."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Before update: No codes of countries: ['Kosovo', 'North Cyprus', 'Russia', 'Hong Kong S.A.R. of China', 'Ivory Coast', 'Turkey', 'Palestinian Territories', 'Eswatini, Kingdom of']\n",
      "\n",
      "After update: No codes of countries: ['Kosovo', 'North Cyprus', 'Turkey', 'Eswatini, Kingdom of']\n",
      "Length (with NA values): 146\n",
      "Length (without NA values): 142\n",
      "Length of df after selecting only countries existing in neo4j SustainGraph: 40\n",
      "---------------------------------------------------------------------------\n",
      "Before update: No codes of countries: ['Taiwan Province of China', 'Kosovo', 'North Cyprus', 'Russia', 'Hong Kong S.A.R. of China', 'Congo (Brazzaville)', 'Ivory Coast', 'Turkey', 'Palestinian Territories', 'Swaziland']\n",
      "\n",
      "After update: No codes of countries: ['Taiwan Province of China', 'Kosovo', 'North Cyprus', 'Turkey', 'Eswatini, Kingdom of']\n",
      "Length (with NA values): 149\n",
      "Length (without NA values): 145\n",
      "Length of df after selecting only countries existing in neo4j SustainGraph: 40\n",
      "---------------------------------------------------------------------------\n",
      "Before update: No codes of countries: ['Taiwan Province of China', 'Kosovo', 'Russia', 'North Cyprus', 'Hong Kong S.A.R. of China', 'Ivory Coast', 'Congo (Brazzaville)', 'Macedonia', 'Turkey', 'Palestinian Territories', 'Congo (Kinshasa)', 'Swaziland']\n",
      "\n",
      "After update: No codes of countries: ['Taiwan Province of China', 'Kosovo', 'North Cyprus', 'Macedonia', 'Turkey', 'Congo (Kinshasa)', 'Eswatini, Kingdom of']\n",
      "Length (with NA values): 153\n",
      "Length (without NA values): 147\n",
      "Length of df after selecting only countries existing in neo4j SustainGraph: 39\n",
      "---------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "path = 'Data/4.TPS_Happiness_Score'\n",
    "xls_files = glob.glob(os.path.join(path, \"*.xls\"))\n",
    "\n",
    "df_2022 = preprocessing_happiness(xls_files[2],'2022',driver=driver)\n",
    "df_2022.rename(columns={'Dystopia (1.83) + residual': 'Dystopia + residual'},inplace=True)\n",
    "df_2021 = preprocessing_happiness(xls_files[1],'2021',driver=driver)\n",
    "df_2020 = preprocessing_happiness(xls_files[0],'2020',driver=driver)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2020\n",
      "happiness_score\n",
      "39 observations: Done! (0.0022367556889851888 minutes)\n",
      "happiness_score_log_gdp\n",
      "39 observations: Done! (0.0005583683649698893 minutes)\n",
      "happiness_score_social_support\n",
      "39 observations: Done! (0.0002621054649353027 minutes)\n",
      "happiness_score_life_expectancy\n",
      "39 observations: Done! (0.00026175578435262047 minutes)\n",
      "happiness_score_life_choices\n",
      "39 observations: Done! (0.00033391714096069335 minutes)\n",
      "happiness_score_generosity\n",
      "39 observations: Done! (0.000526277224222819 minutes)\n",
      "happiness_score_corruption\n",
      "39 observations: Done! (0.0004932959874471029 minutes)\n",
      "happiness_score_dystopia\n",
      "39 observations: Done! (0.0005353768666585286 minutes)\n",
      "2021\n",
      "happiness_score\n",
      "40 observations: Done! (0.0005486249923706054 minutes)\n",
      "happiness_score_log_gdp\n",
      "40 observations: Done! (0.0005272229512532552 minutes)\n",
      "happiness_score_social_support\n",
      "40 observations: Done! (0.0010077277819315591 minutes)\n",
      "happiness_score_life_expectancy\n",
      "40 observations: Done! (0.0005302230517069498 minutes)\n",
      "happiness_score_life_choices\n",
      "40 observations: Done! (0.0004592617352803548 minutes)\n",
      "happiness_score_generosity\n",
      "40 observations: Done! (0.000800625483194987 minutes)\n",
      "happiness_score_corruption\n",
      "40 observations: Done! (0.0010211706161499024 minutes)\n",
      "happiness_score_dystopia\n",
      "40 observations: Done! (0.0010394652684529622 minutes)\n",
      "2022\n",
      "happiness_score\n",
      "40 observations: Done! (0.000793310006459554 minutes)\n",
      "happiness_score_dystopia\n",
      "40 observations: Done! (0.0005470832188924153 minutes)\n",
      "happiness_score_gdp\n",
      "40 observations: Done! (0.0004596511522928874 minutes)\n",
      "happiness_score_social_support\n",
      "40 observations: Done! (0.00044225454330444337 minutes)\n",
      "happiness_score_life_expectancy\n",
      "40 observations: Done! (0.00039099852244059246 minutes)\n",
      "happiness_score_life_choices\n",
      "40 observations: Done! (0.0005207975705464681 minutes)\n",
      "happiness_score_generosity\n",
      "40 observations: Done! (0.0005282243092854818 minutes)\n",
      "happiness_score_corruption\n",
      "40 observations: Done! (0.00032175779342651366 minutes)\n"
     ]
    }
   ],
   "source": [
    "series_encoding ={\n",
    "    'Happiness score':'happiness_score',\n",
    "    'Dystopia + residual':'happiness_score_dystopia',\n",
    "    'Explained by: GDP per capita':'happiness_score_gdp',\n",
    "    'Explained by: Log GDP per capita':'happiness_score_log_gdp',\n",
    "    'Explained by: Social support':'happiness_score_social_support', \n",
    "    'Explained by: Healthy life expectancy':'happiness_score_life_expectancy',\n",
    "    'Explained by: Freedom to make life choices':'happiness_score_life_choices',\n",
    "    'Explained by: Generosity':'happiness_score_generosity', \n",
    "    'Explained by: Perceptions of corruption':'happiness_score_corruption'\n",
    "}\n",
    "import_happiness_score(df=df_2020,year='2020',series_encoding=series_encoding,batch_size=10000,driver=driver)\n",
    "import_happiness_score(df=df_2021,year='2021',series_encoding=series_encoding,batch_size=10000,driver=driver)\n",
    "import_happiness_score(df=df_2022,year='2022',series_encoding=series_encoding,batch_size=10000,driver=driver)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "320 Hapiness Observations(expected 320 2022) in 53 ms.\n",
      "320 Hapiness Observations(expected 320 2021) in 0 ms.\n",
      "312 Hapiness Observations(expected 312 2020) in 20 ms.\n",
      "9 Hapiness Series(expected 9 2020) in 28 ms.\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:GeoArea)\n",
    "        where i.code='happiness_score'and o.time.year=2022\n",
    "        return count(DISTINCT o) as obs\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Hapiness Observations(expected {expected} 2022) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['obs'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = 40*8\n",
    "))\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:GeoArea)\n",
    "        where i.code='happiness_score'and o.time.year=2022\n",
    "        return count(DISTINCT o) as obs\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Hapiness Observations(expected {expected} 2021) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['obs'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = 40*8\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:GeoArea)\n",
    "        where i.code='happiness_score'and o.time.year=2020\n",
    "        return count(DISTINCT o) as obs\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Hapiness Observations(expected {expected} 2020) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['obs'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = 39*8\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)\n",
    "        where i.code='happiness_score'\n",
    "        return count(DISTINCT s) as s\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Hapiness Series(expected {expected} 2020) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['s'],\n",
    "    time=summary.result_available_after,\n",
    "    expected =9\n",
    "))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Press Freedom Index\n",
    "Reporters Without Borders is an international non-profit and non-governmental organization with the stated aim of safeguarding the right to freedom of information. The purpose of the World Press Freedom Index(https://rsf.org/en/index) is to compare the level of press freedom enjoyed by journalists and media in 180 countries and territories.  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Read files\n",
    "The csv files regarding the data of Press Freedom Index between 2013 and 2022 are available under the \"6.TPS_Press_Freedom_Index\" folder. Regarding the below script, we read the files and we concatenate them into a pandas data frame."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "File Name: 2013.csv\n",
      "File Name: 2014.csv\n",
      "File Name: 2015.csv\n",
      "File Name: 2016.csv\n",
      "File Name: 2017.csv\n",
      "File Name: 2018.csv\n",
      "File Name: 2019.csv\n",
      "File Name: 2020.csv\n",
      "File Name: 2021.csv\n",
      "File Name: 2022.csv\n"
     ]
    }
   ],
   "source": [
    "# Get path of folder containing press freedom index\n",
    "path = 'Data/4.TPS_Press_Freedom_Index'\n",
    "\n",
    "# Get csv files\n",
    "csv_files = glob.glob(os.path.join(path, \"*.csv\"))\n",
    "\n",
    "all_df = []\n",
    "for f in csv_files:\n",
    "      \n",
    "    # read the csv file\n",
    "    df = pd.read_csv(f, sep=';')\n",
    "    print('File Name:', f.split(\"\\\\\")[-1])\n",
    "    \n",
    "    # Different columns in 2022 csv file\n",
    "    if f.split(\"\\\\\")[-1] == '2022.csv':\n",
    "        df = df[['Year (N)','ISO', 'Rank', 'Score']]\n",
    "        df.rename(columns = {'Rank':'Rank N', 'Score':'Score N'}, inplace = True)\n",
    "    else:\n",
    "        df = df[['Year (N)', 'ISO', 'Rank N', 'Score N']]\n",
    "    \n",
    "    all_df.append(df)\n",
    "    \n",
    "# Concatenate all dfs  \n",
    "frame = pd.concat(all_df, axis=0, ignore_index=True)\n",
    "frame['att_codes'] = 'IND'\n",
    "frame['att_desc'] = 'Index'\n",
    "frame['dim_codes'] ='NA'\n",
    "frame['dim_desc'] = 'Not available'\n",
    "\n",
    "# Keep only the rows containing values of countries existing in the neo4j LPG model.\n",
    "records, summary, keys = driver.execute_query(\"\"\"\n",
    "        MATCH (r:Region{name:'Europe'})-[:HAS_SUBREGION]->(sr:SubRegion)-[:HAS_AREA]->(a:Area)\n",
    "        MATCH (eu:EuropeanUnion)<-[:BELONGS_TO]-(eua:Area)\n",
    "        WITH COLLECT(DISTINCT a.ISOalpha3code)+COLLECT(DISTINCT eua.ISOalpha3code) as geocodes\n",
    "        UNWIND geocodes as codes\n",
    "        RETURN COLLECT(DISTINCT codes) as geocodes\n",
    "        \"\"\",routing_=\"r\")\n",
    "available_neo4j_geocodes = records[0]['geocodes']\n",
    "\n",
    "frame = frame.loc[frame['ISO'].isin(available_neo4j_geocodes)]\n",
    "frame.rename(columns = {'Year (N)':'time', 'Score N':'value','ISO':'geo'}, inplace = True)\n",
    "frame['value'].replace(',','.',inplace=True,regex=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "420 observations: Done! (0.004695018132527669 minutes)\n"
     ]
    }
   ],
   "source": [
    "# Default values\n",
    "code_name = 'press_freedom_index'\n",
    "code_description= 'Press freedom is defined as the ability of journalists as individuals and collectives to select, produce, and disseminate news in the public interest independent of political, economic, legal, and social interference and in the absence of threats to their physical and mental safety'\n",
    "url='https://rsf.org/en/index'\n",
    "\n",
    "# Create (Series)<-[:HAS_SERIES]-(Indicator)-[:COMES_FROM]->(Source)\n",
    "statement_tps_s_sm = \"\"\"\n",
    "        MATCH (so:Source{name:'TPS'})\n",
    "        MERGE (i:Indicator{code:$ind_code,description:$ind_desc})\n",
    "        MERGE (i)-[:COMES_FROM]->(so)\n",
    "        MERGE (s:Series{code:$ind_code,dataProviderURL:$url,\n",
    "        description:$ind_desc})\n",
    "        MERGE (s)<-[:HAS_SERIES]-(i)        \n",
    "        \"\"\" \n",
    "with driver.session() as session:\n",
    "    session.execute_write(write_tps_indicators, \n",
    "                            params_dict = {'ind_code':code_name,'ind_desc':code_description,'url':url},\n",
    "                            statement = statement_tps_s_sm)\n",
    "    \n",
    "import_sm_obs(frame,code_name,batch_size=10000,driver=driver,geoEUcode=False)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "42 Press freedom Observations(expected 42 2022) in 7 ms.\n",
      "420 Press freedom Observations(expected 420) in 7 ms.\n",
      "42 Press freedom indicator HAS_OBSERVATIONS-geoArea(expected 42) in 4 ms.\n"
     ]
    }
   ],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:GeoArea)\n",
    "        where i.code='press_freedom_index' and o.time.year=2022\n",
    "        return count(DISTINCT o) as obs\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Press freedom Observations(expected {expected} 2022) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['obs'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = 42\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)--(s:Series)--(sm:SeriesMetadata)--(o:Observation)--(ga:GeoArea)\n",
    "        where i.code='press_freedom_index' \n",
    "        return count(DISTINCT o) as obs\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Press freedom Observations(expected {expected}) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['obs'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = len(frame)\n",
    "))\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       MATCH (i:Indicator)-[r:HAS_OBSERVATIONS]-(ga:GeoArea)\n",
    "        where i.code='press_freedom_index' \n",
    "        return count(DISTINCT r) as rels\n",
    "        \"\"\",routing_=\"r\")\n",
    "print(\"{nodes_created} Press freedom indicator HAS_OBSERVATIONS-geoArea(expected {expected}) in {time} ms.\".format(\n",
    "    nodes_created=records[0]['rels'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = 42\n",
    "))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
