{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth\n",
    "import neo4j\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import time\n",
    "import os\n",
    "import aiohttp\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to neo4j\n"
     ]
    }
   ],
   "source": [
    "#load the environment variables\n",
    "dotenv_path = Path('~/.env')\n",
    "load_dotenv(dotenv_path=dotenv_path)  # This line brings all environment variables from .env into os.environ\n",
    "\n",
    "# Get variables\n",
    "SUSTAINGRAPH_URI = os.getenv('SUSTAINGRAPH_URI')\n",
    "SUSTAINGRAPH_USER = os.getenv('SUSTAINGRAPH_USER')\n",
    "SUSTAINGRAPH_PASSWORD = os.getenv('SUSTAINGRAPH_PASSWORD')\n",
    "database_name = os.getenv('DATABASE_NAME')\n",
    "\n",
    "# Connect to database\n",
    "driver = GraphDatabase.driver(SUSTAINGRAPH_URI, auth=(SUSTAINGRAPH_USER, SUSTAINGRAPH_PASSWORD))\n",
    "\n",
    "# Verify connectivity\n",
    "with driver.session(database=database_name) as session:\n",
    "    print(session.run(\"RETURN 'Connected to ' + $db\", db=database_name).single()[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Constraints"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_constraint(tx,statement):\n",
    "    tx.run(statement)\n",
    "\n",
    "constraints = [\n",
    "    \"\"\"CREATE CONSTRAINT ndc_unique IF NOT EXISTS FOR (n:NDC) REQUIRE (n.text,n.typeOfInformation,n.documentType) IS NODE KEY\"\"\",\n",
    "    \"\"\"CREATE CONSTRAINT ndc_text_type IF NOT EXISTS FOR (n:NDC) REQUIRE n.text IS :: STRING\"\"\",\n",
    "    \"\"\"CREATE CONSTRAINT ndc_typeOfInformation_type IF NOT EXISTS FOR (n:NDC) REQUIRE n.typeOfInformation IS :: STRING\"\"\",\n",
    "    \"\"\"CREATE CONSTRAINT ndc_documentType_type IF NOT EXISTS FOR (n:NDC) REQUIRE n.documentType IS :: STRING\"\"\",\n",
    "    \"\"\"CREATE CONSTRAINT ndc_sector_type IF NOT EXISTS FOR (n:NDC) REQUIRE n.sector IS :: LIST<STRING NOT NULL>\"\"\",\n",
    "    \"\"\"CREATE CONSTRAINT ndc_status_type IF NOT EXISTS FOR (n:NDC) REQUIRE n.status IS :: LIST<STRING NOT NULL>\"\"\",  \n",
    "]\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    for statement_constraint in constraints:\n",
    "        session.execute_write(create_constraint, statement_constraint)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write batch function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def write_batch(tx,statement, params_list):\n",
    "    tx.run(statement, parameters={\"parameters\": params_list})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import NDC-SDG linkages\n",
    "\n",
    "NDC stands for a Nationally Determined Contribution. For the Paris Agreement goals to be achieved, every country needs to play its part. Because countries have different circumstances, resources and abilities, the agreement was designed so each country defines their own pledges, in terms of targets and contributions to the universal agreement. These country pledges are the NDCs. Each country produced an [NDC document](https://www4.unfccc.int/sites/NDCStaging/Pages/All.aspx) outlining these contributions and how they will be achieved ."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Collect data from API"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The [Climate Watch](https://www.climatewatchdata.org/data-explorer/ndc-sdg-linkages?ndc-sdg-linkages-countries=GRC&ndc-sdg-linkages-goals=clean-water-and-sanitation&ndc-sdg-linkages-sectors=All%20Selected&ndc-sdg-linkages-targets=All%20Selected&page=1#meta) offers an API, in order to use NDC data in our own applications. The data retrieved from then Climate-Watch API contain information about the linkages between them and the SDG targets."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 4.589588038126627 minutes\n"
     ]
    }
   ],
   "source": [
    "# get the start time\n",
    "st = time.time()\n",
    "\n",
    "async with aiohttp.ClientSession() as session:\n",
    "    runs_imported = 1\n",
    "    page = 1\n",
    "    ndcs = [] #final list with all the ndcs \n",
    "    while runs_imported > 0:\n",
    "        url = 'https://www.climatewatchdata.org/api/v1/data/ndc_sdg?page='+str(page)\n",
    "        async with session.get(url) as resp:\n",
    "            response = await resp.json()\n",
    "            runs_imported = len(response['data'])\n",
    "            ndcs += response['data'] #list of ndcs \n",
    "            page += 1\n",
    "\n",
    "# get the end time\n",
    "et = time.time()\n",
    "\n",
    "# get the execution time\n",
    "elapsed_time = et - st\n",
    "print('Execution time:', elapsed_time/60, 'minutes')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import data to neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We collect with a cypher query the available GeoArea iso alpha-3 codes in the knowledge graph to import only the NDCs \n",
    "that refer to them. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "        MATCH (ga:Area)\n",
    "        UNWIND ga.ISOalpha3code as codes\n",
    "        RETURN COLLECT(codes) as geocodes\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "available_iso3codes = list(map(str,records[0]['geocodes']))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We import the NDCs to the graph and create the linkages with the SDG targets, in batches of 10000 for better memory performance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Batch 1 with 10000 observations : Done! (0.050255354245503744 minutes)\n",
      "9660 observations: Done! (0.04829176266988119 minutes)\n",
      "Execution time: 0.04829176266988119 minutes\n"
     ]
    }
   ],
   "source": [
    "# Create Observation nodes in the neo4j and commit result in batches.\n",
    "statement_ndc = \"\"\" \n",
    "    UNWIND $parameters as row\n",
    "    WITH row \n",
    "    MATCH (ga:GeoArea),(t:Target{code:row.target_code})\n",
    "    WHERE row.geo = ga.ISOalpha3code\n",
    "    MERGE (n:NDC{text:row.ndc_text,typeOfInformation:row.info,documentType:row.doc_type})\n",
    "    FOREACH(_ in CASE WHEN NOT n.sector IS NOT NULL THEN [1] END | SET n.sector = [row.sector])\n",
    "    FOREACH(x in CASE WHEN NOT (row.sector IN n.sector) THEN [1] END |\n",
    "    SET n.sector = COALESCE(n.sector, []) + row.sector)\n",
    "    FOREACH(_ in CASE WHEN NOT n.status IS NOT NULL THEN [1] END | SET n.status = [row.status])\n",
    "    FOREACH(x in CASE WHEN NOT (row.status IN n.status) THEN [1] END |\n",
    "    SET n.status = COALESCE(n.status, []) + row.status)\n",
    "    WITH n,ga,t,row\n",
    "    MERGE (n)- [:REFERS_TO_AREA] ->(ga)\n",
    "    MERGE (n)-[:ASSOCIATED_WITH{climateResponse:row.clim_resp}] -> (t)\n",
    "\"\"\"\n",
    "\n",
    "# Begin a new auto-commit GraphTransaction.\n",
    "params,all_params = [],[]\n",
    "index = 0 \n",
    "batch_i=1\n",
    "batch_size=10000\n",
    "\n",
    "# get the start time\n",
    "st1 = time.time()\n",
    "\n",
    "with driver.session(database=database_name) as session:\n",
    "    for ndc in ndcs:\n",
    "        if(ndc['iso_code3'] in available_iso3codes):\n",
    "            params_dict = {\n",
    "                'geo': ndc['iso_code3'],\n",
    "                'ndc_text': ndc['indc_text'].rstrip('.,;'),\n",
    "                'target_code': ndc['sdg_target'].split('. ')[0],\n",
    "                'info': \"Not available\" if ndc['type_of_information'] is None else str(ndc['type_of_information'].title()),\n",
    "                'clim_resp': \"Not available\" if ndc['climate_response'] is None else str(ndc['climate_response'].title()),\n",
    "                'status':\"Not available\" if ndc['status'] is None else str(ndc['status'].title()),\n",
    "                'sector': \"Not available\" if ndc['sector'] is None else str(ndc['sector'].title()),\n",
    "                'doc_type': \"Not available\" if ndc['document_type'] is None else str(ndc['document_type'].title())\n",
    "            }\n",
    "            params.append(params_dict)\n",
    "            index +=1\n",
    "        if index % batch_size == 0 and index > 0:\n",
    "            st = time.time()\n",
    "            session.execute_write(write_batch, params_list = params,statement = statement_ndc)\n",
    "            et = time.time()\n",
    "            # get the execution time\n",
    "            elapsed_time = et - st            \n",
    "            print('Batch {} with {} observations : Done! ({} minutes)'.format(batch_i,len(params),elapsed_time/60))\n",
    "            batch_i +=1\n",
    "            all_params = all_params + params\n",
    "            params = []\n",
    "    all_params = all_params + params\n",
    "    if params:\n",
    "            st = time.time()  # Record start time for the last batch\n",
    "            session.execute_write(write_batch, params_list = params,statement = statement_ndc)\n",
    "            et = time.time()\n",
    "            elapsed_time = et - st\n",
    "            print('{} observations: Done! ({} minutes)'.format(len(params), elapsed_time/60))\n",
    "# get the end time\n",
    "et1 = time.time()\n",
    "\n",
    "# get the execution time\n",
    "elapsed_time_total = et1 - st1\n",
    "print('Execution time:', elapsed_time/60, 'minutes')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Check cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14716 ASSOCIATED_WITH (expected: 14716) in 1 ms.\n",
      "10137 NDCs (expected: 10137) in 1 ms.\n"
     ]
    }
   ],
   "source": [
    "df = pd.DataFrame(all_params)\n",
    "\n",
    "# Count number of distinct ASSOCIATED rels\n",
    "df2 = df.groupby(['ndc_text','doc_type','clim_resp','target_code']).size().reset_index()\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       match (n:NDC)-[r:ASSOCIATED_WITH]->(T:Target) RETURN COUNT(DISTINCT r) as rel\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{rels} ASSOCIATED_WITH (expected: {expected}) in {time} ms.\".format(\n",
    "    rels=records[0]['rel'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = len(df2)\n",
    "))\n",
    "\n",
    "# Count number of distinct NDC nodes\n",
    "df1 = df.groupby(['ndc_text','doc_type','info']).size().reset_index()\n",
    "\n",
    "records, summary, keys = driver.execute_query(\"\"\"\\\n",
    "       match (n:NDC) RETURN COUNT(DISTINCT n) AS NDC\n",
    "        \"\"\",routing_=\"r\",database_=database_name)\n",
    "print(\"{ndc} NDCs (expected: {expected}) in {time} ms.\".format(\n",
    "    ndc=records[0]['NDC'],\n",
    "    time=summary.result_available_after,\n",
    "    expected = len(df1)\n",
    "))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
